Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: The affected *Team* will triage the issue and either reject (label **wontfix**, close and remove from the project) or accept the issue. The team decides if it they will fix the issue in-house (move to "Accepted" and assign a team member) or wait for a community developer to pick it up (Label **help wanted**, remove from the project board and provide hints on how to resolve the issue and further details on the how the fix should be implemented if necessary). For non-critical issues that are trivial to fix, the label **good first issue** can be added as well.
ca: L'*Equip* afectat farà el triatge del problema i o bé el rebutjarà (etiqueta **wontfix** (no s'arreglarà), tancament i eliminació del projecte) o bé acceptarà el problema. L'equip decideix si arreglarà el problema internament (es mou a «Acceptat» i s'assigna a un membre) o espera que un desenvolupador de la comunitat l'agafi (etiqueta **help wanted**, cal ajuda, eliminació del panell del projecte i provisió de pistes sobre com resoldre el problema i de detalls addicionals sobre com s'hauria d'implementar la solució si cal). Per a problemes no crítics que són fàcils d'arreglar, es pot afegir també l'etiqueta **good first issue** (problema inicial adequat).
es: El *Equipo* afectado triará el problema y bien lo rechazará (etiquetado **wontfix** o **no se arreglará**, cerrado y eliminado del proyecto) o aceptará el problema. El equipo decide si arreglará el problema internamente (movido a "Accepted" o "aceptado" y asignado a un miembro del equipo) o espera para que un desarrollador de la comunidad lo tome (etiquetar **help wanted** o **se necesita ayuda**, eliminar del panel del proyecto y proporcionar pistas sobre como resolver el problema y más detalles de como el arreglo debería implementarse de ser necesario). Para problemas no críticos que son triviales de reparar, la etiqueta **good first issue** o **buen primer problema** puede añadirse también.
nb: Det berørte *laget* vil prøve ut problemet og enten avvise (etikett **wontfix**, lukke og fjerne fra prosjektet) eller godta problemet. Laget bestemmer om det vil løse problemet internt (gå til "Akseptert" og tildele et lagmedlem) eller vente på at en gemenskapsutvikler skal hente det (Etikett **help wanted**, fjern fra prosjektstyret og gi tips om hvordan du løser problemet og ytterligere detaljer om hvordan løsningen bør implementeres om nødvendig). For ikke-kritiske problemer som er trivielle å fikse, kan etiketten **good first issue** også legges til.
pl: *Zespół* dotknięty problemem oceni problem i odrzuci (etykieta ** wontfix **, zamknij i usuń z projektu) lub zaakceptuje problem. Zespół decyduje, czy problem zostanie rozwiązany wewnętrznie (przejdź do "Zaakceptowany" i przypisz członka zespołu) lub poczekaj, aż deweloper społeczności go odbierze (etykieta **potrzebuje pomocy**, usuń z planszy projektu i podaj wskazówki, jak rozwiązać problem i dalsze szczegóły dotyczące tego, w jaki sposób poprawka powinna zostać wdrożona, jeśli to konieczne). W przypadku niekrytycznych problemów, które są łatwe do naprawienia, można dodać etykietę **dobry pierwszy problem**.
ru: Команда разработчиков, которая ведет это направление, возьмёт проблему в работу и либо отклонит её (метка **wontfix** закроет и удалит карточку ошибки), либо подготовит исправление. Команда решает, решит ли она проблему самостоятельно (перейдет к метке «Accepted» и назначит члена команды) или подождет, пока ею не станет заниматься кто-нибудь из сообщества (в этом случае проблеме присваивается метка **help wanted**, она удаляется с доски проекта и предоставляется информация и подсказки о том, как проблему решить, и как должно быть реализовано исправление). Некритические проблемы, которые легко исправить, можно обозначить меткой **good first issue**.
sq: Skuadra e prekur * do ta gjykojë çështjen dhe ose do të refuzojë (etiketa ** wontfix **, mbyllet dhe largohet nga projekti) ose pranon çështjen. Ekipi vendos nëse do ta rregullojë çështjen brenda shtëpisë (të shkojë në "Pranohet" dhe të caktojë një anëtar të ekipit) ose të presë që një zhvillues i komunitetit ta marrë atë (Label ** do të ndihmojë për të kërkuar **, hiqni nga bordi i projektit dhe japin sugjerime se si të zgjidhen çështja dhe detaje të mëtejshme mbi mënyrën se si duhet të zbatohet rregullimi nëse është e nevojshme). Për çështje jo-kritike që janë të parëndësishme për të rregulluar, etiketa ** ** broshurë e mirë ** mund të shtohet gjithashtu.
zh_hans: 受影响的* 团队 *将对问题进行分类，并拒绝（标签** wontfix **，关闭并从项目中删除）或接受该问题。 团队决定他们是否会在内部解决问题（转到“接受”并指派一名团队成员）或等待社区开发人员接收它（标签**帮助想要**，从项目板中删除， 提供有关如何解决问题的提示以及有关如何在必要时实施修复的更多详细信息。 对于非常难以解决的非关键问题，也可以添加标签**良好的第一期**。
zh_hant: 受影響的 *團隊* 將對問題進行分類，並拒絕 ( 標示 **不修復**，關閉並從專案中刪除) 或接受該問題。團隊決定是否在內部解決此問題(移動到 "接受" 並分配團隊成員) 或等待社區開發人員拿起它 (標示 **需要幫助**，從專案板中刪除，並提供如何解決問題的提示，以及如何在必要時實施修復的更多詳細資訊)。對於需要修復的微不足道的非關鍵問題，也可以標示為 **好問題**。

source: Once a *developer* is assigned and starts working on the issue, it is moved to "In Development". As soon as they have something to show for, the issue is closed and automatically moved to "Quality Assurance" for feedback from the QA team. If necessary, the developer will provide hints on how to test his patch in a comment on the issue.
nb: Når en *utvikler* er tildelt og begynner å jobbe med problemet, flyttes den til "I utvikling". Så snart de har noe å vise for, lukkes problemet og flyttes automatisk til "Quality Assurance" for tilbakemelding fra kvalitetskontroll-laget. Om nødvendig vil utvikleren gi tips om hvordan du kan teste feilfiksen til vedkommende i en kommentar til problemet.
pl: Gdy *programista* zostanie przypisany i zacznie pracować nad problemem to problem jest przenoszony do "In Development". Gdy tylko mają coś do pokazania, problem jest zamykany i automatycznie przenoszony do sekcji "Quality Assurance" w celu uzyskania opinii zespołu ds. Kontroli jakości. W razie potrzeby deweloper w komentarzu do problemu poda wskazówki, jak przetestować swoją poprawkę.
ru: Как только *разработчик* назначен и и берет проблему в работу, ей присваивается маркер в «В разработке». Когда работа закончена, проблема закрывается и автоматически перемещается в «Группу контроля качества» ("Quality Assurance" - QA). При необходимости разработчик поясняет, как протестировать свой патч в комментарии к проблеме.

source: The *QA-Team* tests the fix on all devices and provides feedback to the developer. If problems are found, the issue is re-opened and goes back to "Accepted", else it’s moved to "Release Candidate" to be included in the next release.
nb: *Kvalitetskontroll-laget* tester løsningen på alle enheter og gir tilbakemelding til utvikleren. Hvis det blir funnet problemer, åpnes problemet på nytt og går tilbake til "Akseptert", ellers flyttes det til "Release Candidate" for å bli inkludert i neste utgivelse.
pl: Zespół *QA-Team* testuje poprawkę na wszystkich urządzeniach i przekazuje informacje zwrotne programistom. Jeśli zostaną znalezione problemy, jest ono ponownie otwierane i wraca do "Accepted", w przeciwnym razie jest przenoszone do "Release Candidate", aby dołączyć do następnej wersji.
ru: *Группа контроля качества (QA)* тестирует патч на всех устройствах и даёт обратную связь разработчику. Если снова обнаруживается проблема, то запрос снова открывается и возвращается к состоянию «Accepted». Если всё хорошо, и ошибка исправлена, то патч переносят в «Release Candidate» для следующей версии программы.

source: If not done already, the issue is added to the next milestone. Once the milestone is released, the issue is removed from the project board.
ca: Si no s'ha fet ja, el problema s'afegeix a la propera fita. Un cop es publica la fita, el problema s'elimina del panell del projecte.
de: Falls noch nicht geschehen, wird der Issue zum nächsten Meilenstein hinzugefügt. Sobald der Meilenstein veröffentlicht ist, wird das Problem vom Projekt entfernt.
es: Si no se ha hecho ya, el problema se añade al siguiente hito. Una vez que el hito es publicado, el problema es eliminado del panel del proyecto.
nb: Hvis det ikke allerede er gjort, blir problemet lagt til neste milepæl. Når milepælen er utgitt, blir problemet fjernet fra prosjekttavlen.
pl: Jeśli jeszcze nie zostało to zrobione, problem zostanie dodany do następnego etapu. Po zwolnieniu kamienia milowego problem zostaje usunięty z planszy projektu.
ru: Если ошибку не удаётся исправить, запрос переносится в следующий майлстоун. Как только майлстоун проходит, запрос с проблемой удаляется с доски проекта.
sq: Nëse nuk është bërë tashmë, çështja do të shtohet në momentin tjetër. Pasi të jetë botuar historiku, problemi largohet nga projekti.
zh_hans: 如果尚未完成，则会将问题添加到下一个 Milestone。 一旦 Milestones 发布，问题就会从项目板中删除。
zh_hant: 如果尚未完成，則會將問題添加到下一個里程碑中。里程碑發佈後，問題將從專案板中刪除。

source: This is the package archive system for UBports projects. It hosts various PPAs containing all deb-components of Ubuntu Touch.
nb: Dette er pakkearkivsystemet for UBports-prosjekter. Den er vert for forskjellige PPAer som inneholder alle deb-komponentene til Ubuntu Touch.
pl: Jest to system archiwizacji pakietów dla projektów UBports. Obsługuje różne PPA zawierające wszystkie składniki deb-Ubuntu Touch. Nowe PPA mogą być tworzone dynamicznie przez serwer CI za pomocą specjalnej: doc: `konwencja nazewnictwa gałęzi git <nazewnictwo gałęzi>.
ru: Это система архивирования пакетов для проектов UBports. Здесь находятся различные PPA, содержащие все deb-компоненты Ubuntu Touch.
zh_hant: 這是 UBports 專案的套件存檔系統。它承載著各種 PPA，包含 Ubuntu Touch 的所有分支元件。

source: Repository naming convention
nb: Navnesystem for kodelager
pl: Konwencja nazewnictwa gałęzi
ru: Принцип наименования репозиториев
zh_hant: 存儲庫命名規定

source: Native packages
nb: Systemspesifikke pakker
pl: Pakiety macierzyste
ru: Оригинальные пакеты
zh_hans: 原生包
zh_hant: 當地套件

source: Native packages are repositories which contain a ``debian/`` directory **with** the source used to create the Debian source package (``.dsc``).
nb: Systemspesifikke pakker er kodelager som inneholder en ``debian/``-mappe **med** kildekoden for å opprette Debian-kildepakken (``.dsc``).
pl: Pakiety macierzyste są repozytoriami, które zawierają katalog ``debian / `` ** z ** źródłem użytym do utworzenia pakietu źródłowego Debiana (``.dsc``).
ru: Оригинальные (нативные пакеты) - это репозитории, которые содержат каталог `` debian / `` ** с ** источником, использованным для создания исходного пакета Debian (`` .dsc``).
zh_hans: 原生包是一个包含 ``debian/`` 目录的存储库，其中 **包含** 用于创建 Debian 源码包的源代码 (``.dsc``)。
zh_hant: 本機套件是存儲庫，其中包含 "debian/" 目錄 **包含** 用於建立 Debian 源套件的原始程式碼(".dsc")。

source: The name of the Debian source package generated from the repository and the name of the git-repository should be the same.
nb: Navnet på Debian-kildepakken generert fra arkivet og navnet i git-arkivet skal være det samme.
pl: Nazwa pakietu źródłowego Debiana wygenerowanego z repozytorium i nazwa repozytorium git powinny być takie same.
ru: Имя исходного пакета Debian, сгенерированного из репозитория, и имя git-репозитория должны совпадать.
zh_hans: 从存储库生成的 Debian 源码包的名称和 Git 存储库的名称应该是相同的。
zh_hant: 從存儲庫生成的 Debian 源碼套件的名稱和 Git 存儲庫的名稱應該是相同的。

source: Packaging repositories
nb: Pakking av kodelager
pl: Repozytoria pakietów
ru: Пакетные репозитории
zh_hans: 打包存储库
zh_hant: 套件存儲庫

source: Packaging repositories contain a ``debian/`` directory **without** the source used to create the Debian source package (``.dsc``). They also contain instructions to tell ``debhelper`` how to get the source used to create the source package.
nb: Pakkede kodelager inneholder en ``debian/``-mappe **uten** kildekoden brukt til å opprette Debian-kildepakken (``.dsc``). De inneholder også instruks for å fortelle ``debhelper`` kilden skal brukes til å opprette kildepakken.
pl: Repozytoria pakietów zawierają katalog ``debian /`` **bez** źródła użytego do utworzenia pakietu źródłowego Debiana (``.dsc``). Zawierają również instrukcje mówiące ``debhelper`` jak uzyskać źródło użyte do stworzenia pakietu źródłowego.
ru: Пакетные репозитории содержат каталог ``debian /`` **без** источника, использованного для создания исходного пакета Debian (``.dsc``). Они также содержат инструкции для ``debhelper``, как получить исходный код для создания оригинальных пакетов.
zh_hans: 打包存储库包含一个 ``debian/`` 目录，其中 **不包含** 用于创建 Debian 源码包的源代码 (``.dsc``)。它们还包含说明 ``debhelper`` 如何获取用于创建源码包的源代码。
zh_hant: 打包存儲庫套件含一個 "debian/" 目錄，**不包含** 用於建立 Debian 源套件的原始程式碼 (".dsc")。它們還包含說明，告訴 "debhelper" 如何獲取用於創建源套件的源碼。

source: The repository should have the name of the source package it generates with ``-packaging`` appended to the end. For example, a packaging repository that generates a source package called ``sandwich`` would be called ``sandwich-packaging``.
nb: Kodelageret skal ha navnet på kildepakken det genererer med ``-packaging`` lagt til på slutten. For eksempel vil et pakkingskodelager som genererer en kildepakke kalt ``sandwich`` ha navnet ``sandwich-packaging``.
pl: Repozytorium powinno mieć nazwę pakietu źródłowego, który generuje z dopiskiem `-pakiet`` dołączonym na końcu. Na przykład repozytorium pakietu, które generuje pakiet źródłowy o nazwie "kanapka", będzie nazywane "kanapka-pakiet".
ru: Имя репозитория должно повторять имя пакета с исходным кодом и заканчиваться на `-packaging`. Например, репозиторий пакетов, содержащий исходный (оригинальный) пакет с именем ``sandwich``, будет называться ``sandwich-packaging``.
zh_hans: 存储库应该具有它生成的源码包的名称，并在末尾附加 ``-packaging``。 例如：生成命名为 ``sandwich`` 的源码包的打包存储库将会被称为 ``sandwich-packaging``。
zh_hant: 存儲庫應該有它生成的源套件的名稱，並在末尾附加 "-packaging"。例如:生成名為 "sandwich" 的源套件的打包存儲庫將會被稱為 "sandwich-packaging"。

source: Creating new PPAs
pl: Tworzenie nowych PPA
ru: Создание новых PPA
zh_hans: 创建新的 PPA
zh_hant: 建立新的 PPA

source: New PPAs can be created dynamically by the CI server using a special :doc:`git-branch naming convention <branch-naming>`. The name of the branch translates literally to the name of the PPA: ``http://repo.ubports.com/dists/[branch name]``
nb: Nye PPAer kan opprettes dynamisk av CI-tjeneren ved hjelp av en spesiell: doc: `git-branch nameing convention <branch-naming>`. Navnet på grenen oversettes bokstavelig til navnet på PPA: ``http://repo.ubports.com/dists/[branch name]``
pl: Nowe PPA mogą być tworzone dynamicznie przez serwer CI za pomocą specjalnej: doc: `konwencja nazewnictwa gałęzi git <nazwa-gałęzi>. Nazwa gałęzi tłumaczy dosłownie na nazwę PPA: ``http://repo.ubports.com/dists/[nazwa gałęzi)``
ru: Новые PPA могут создаваться динамически сервером CI с использованием специального: doc: `соглашения по названиям git-веток <branch-naming>`. Название ветки буквально совпадает с названием PPA: ``http://repo.ubports.com/dists/[branch name]``
zh_hant: 可以動態建立新的 PPA 由 CI 伺服器使用一個特殊的 :doc: "強制分支命名規定 <branch-naming>"。分支的名稱從字面上轉換為 PPA 的名稱: "http://repo.ubports.com/dists/[分支名稱]"

source: Non-standard PPAs (i.e. not ``xenial``, ``vivid`` or ``bionic``) are kept for three months. In case they need to be kept for a longer time, a file with the name ``ubports.keep`` can be created in the root of the repository, containing the date until which the PPA shall be kept open in the form of ``YYYY-MM-dd``. If this file is empty, the PPA will be kept for two years after the last build.
pl: Niestandardowe PPA (tj. Nie `` xenial``, `` vivid`` lub `` bionic``) są przechowywane przez trzy miesiące. Jeśli muszą być przechowywane przez dłuższy czas, plik z nazwą "ubports.keep" można utworzyć w katalogu głównym repozytorium, zawierający datę, do której PPA pozostanie otwarty w formie **RRRR-MM-dd**. Jeśli ten plik jest pusty, PPA będzie przechowywane przez dwa lata po ostatniej kompilacji.
ru: Нестандартные PPA (то есть, не «xenial», «vivid» или «bionic») хранятся в течение трех месяцев. Если их нужно хранить дольше, в корне хранилища можно создать файл с именем ``ubports.keep``. В нём содержится дата, до которой PPA должен оставаться открытым, в виде ` `YYYY-MM-dd``. Если этот файл не заполнен, PPA будет храниться в течение двух лет после последней сборки.
zh_hant: 非標準的PPA (即不是 "xenial"、"vivid" 或 "bionic") 保存三個月。如果他們需要保存更長的時間、一個檔的名稱 "ubports.keep" 可以在存儲庫的根目錄中創建, 其中包含 PPA 在表單中保持打開狀態的日期格式 "YYYY-MM-dd" 。如果此檔為空白，PPA 將在最後一次構建後保留兩年。

source: Release Schedule
ca: Calendari d'alliberament
de: Veröffentlichungs-Planung
es: Calendario de publicación
pl: Harmonogram wydania
ru: Расписание выхода релизов
sq: Planifikimi -Publikimi
tr: Yayın Planı
zh_hans: 发布时间表
zh_hant: 發佈時刻表

source: OTA updates usually follow this rhythm:
ca: Les actualitzacions OTA generalment segueixen aquest ritme:
de: OTA-Aktualisierungen folgen für gewöhnlich diesem Rhythmus:
es: Las actualizaciones OTA normalmente siguen este ritmo:
nb: OTA-oppdateringer følger vanligvis denne rytmen:
pl: Aktualizacje OTA zazwyczaj podążają za tym rytmem:
ru: Обновления OTA обычно выходят в таком ритме:
sq: Përditësimet e OTA zakonisht ndjekin këtë ritëm:
tr: OTA güncellemeleri genellikle bunu takip eder → rhythm:
zh_hans: OTA 更新通常遵循这个节奏：
zh_hant: OTA 更新通常遵循以下節奏:

source: devel: daily builds
ca: desenvolupament: compilacions diàries
de: devel: tägliche Builds
es: desarrollo: versiones diarias
nb: devel: daglige bygg
pl: devel: codzienne kompilacje
ru: devel: ежедневные сборки
sq: devel: ndërton çdo ditë
tr: devel: günlük derlemeler
zh_hans: devel：每日构建
zh_hant: 開發 (Devel)：每日構建

source: rc: weekly if no critical issue exists in the devel channel
ca: versió candidata: setmanalment si no hi cap problema crític al canal de desenvolupament
de: rc: wöchentlich, falls kein kritisches Problem im Enticklungskanal besteht
es: versión candidata: semanalmente si no existe un problema crítico en el canal desarrollo
nb: rc: ukentlig hvis det ikke er noe kritisk problem i utviklingskanalen
pl: rc: co tydzień, jeśli nie ma krytycznego problemu w kanale devel
ru: rc: еженедельные сборки, если нет критических ошибок на канале devel
sq: rc: javore nëse nuk ka ndonjë problem kritik në kanalin e zhvillimit
tr: rc: devel kanalında kritik bir sorun yoksa haftalık
zh_hans: rc：如果devel频道中不存在严重问题，则每周一次
zh_hant: 最終測試 (RC)：如果 "開發 (Devel)" 頻道中不存在嚴重問題，則每週發佈一次

source: stable: every six through eight weeks, if no critical issue exists in the rc channel
ca: estable: cada entre sis i vuit setmanes, si no hi ha cap problema crític al canal versió candidata
de: stable: alle sechs bis acht Wochen, falls kein kritisches Problem im rc-Kanal besteht
es: estable: cada entre seis a ocho semanas, si no existe un problema crítico en el canal versión candidata
nb: stabil: hver sjette til åttende uke, hvis det ikke er noe kritisk problem i rc-kanalen
pl: stabilny: co sześć do ośmiu tygodni, jeśli nie ma krytycznego problemu w kanale rc
ru: stable: сборки выходят каждые шесть недель, если нет критических ошибок на канале rc
sq: stabile: çdo gjashtë deri në tetë javë nëse nuk ka ndonjë problem kritik në kanalin rc
tr: stable: rc kanalında herhangi bir kritik sorun mevcut değilse, altı ila sekiz haftada bir
zh_hans: 稳定版：如果rc频道中没有关键问题，则每六到八周一次
zh_hant: 穩定 (Stable)：如果 "最終測試 (RC)" 頻道中不存在嚴重問題，則每6至8周發佈一次

source: This is not a definitive cycle. Stable releases are ready when they're ready and should not introduce new bugs or ship very incomplete features. Since the OTA update can not be released before all critical issues are closed, the ETA might have to be moved by making an educated guess for when all the issues can be handled. If there are too many issues added to a milestone, they are either removed or added to the next milestone.
ca: Això no és un cicle definitiu. Els alliberaments estable estan llestos quan estan llestos i no haurien d'introduir errors nous o contenir funcionalitats molt incompletes. Atès que l'actualització OTA no est pot alliberar abans que es tanquin tots els problemes crítics, el temps estimat d'alliberament s'hauria de moure fent una estimació aproximada sobre quan es podran gestionar tots els problemes. Si hi ha massa problemes afegits a una fita, o bé s'eliminen o bé s'afegeixen al següent alliberament.
de: Dies ist kein festgelegter Zyklus. Stabile Veröffentlichungen sind fertig, wenn sie fertig sind und sollten keine neuen Fehler einführen oder unvollständige Funktionalitäten ausliefern. Da eine OTA-Aktualisierung nicht veröffentlicht werden kann, bevor alle kritischen Probleme geschlossen sind, kann das geplante Veröffentlichungsdatum verschoben werden auf eine Schätzung, wann alle Probleme behoben werden können. Falls es zu viele Probleme in einem Meilenstein gibt, werden diese entweder entfernt oder einem anderen Meilenstein zugewiesen.
es: Esto no es un ciclo definitivo. Las publicaciones estables están listas cuando están listas y no deberían introducir nuevos errores o tener funciones incompletas. Como la actualización OTA no se puede publicar antes de que todos los problemas críticos estén cerrados, el tiempo estimado de publicación podría tener que ser movido haciendo una estimación de cuando se podrán tratar todos los problemas. Si hay demasiados problemas añadidos a un hito, o se eliminan o se añaden al siguiente hito.
nb: Dette er ikke en endelig syklus. Stabile utgivelser er klare når de er klare og bør ikke introdusere nye feil eller sende veldig ufullstendige funksjoner. Siden OTA-oppdateringen ikke kan frigjøres før alle kritiske problemer er lukket, kan det hende at ETA må flyttes ved å foreta en utdannet gjetning for når alle problemene kan håndteres. Hvis det er for mange problemer lagt til en milepæl, blir de enten fjernet eller lagt til neste milepæl.
pl: To nie jest ostateczny cykl. Wersje stabilne są gotowe, gdy są gotowe i nie powinny wprowadzać nowych błędów lub dostarczać bardzo niekompletnych funkcji. Ponieważ aktualizacja OTA nie może zostać wydana przed zamknięciem wszystkich krytycznych problemów, ETA może wymagać przeniesienia, dokonując świadomego przypuszczenia, kiedy wszystkie problemy mogą zostać obsłużone. Jeśli do punktu kontrolnego dodano zbyt wiele problemów, zostaną one usunięte lub dodane do następnego etapu.
ru: Это не окончательный цикл. Стабильные выпуски выпускаются по мере готовности, и не должны содержать новых ошибок или неработающих функций. Поскольку обновление OTA не выходит до того, как все критические проблемы будут закрыты, ETA придется переместить на то время, когда все ошибки будут исправлены. Если в майлстоун добавлено слишком много баг-репортов, они либо удаляются, либо переносятся в следующий майлстоун.
sq: Ky nuk është një cikël përfundimtar. Lirime të qëndrueshme janë gati kur të jenë gati dhe nuk duhet të futin mete të reja ose të ofrojnë tipare shumë të paplota. Që nga azhurimi OTA nuk mund të lëshohet para se të gjitha çështjet kritike janë të mbyllura, ETA mund të duhet të lëvizin duke bërë një hamend të arsimuar kur të gjitha çështjet mund të trajtohen. Nëse ka shumë çështje të shtuara në një moment historik, ato hiqen ose shtohen në momentin tjetër.
tr: Bu kesin bir döngü değildir. Kararlı sürümler hazır olduklarında hazırdır ve yeni hatalar önlememeli veya çok eksik özellikleri taşımamalıdır. OTA güncellemesi, tüm kritik sorunlar kapanmadan açıklanamadığından, ETA, tüm konuların işlenebileceği zaman için eğitimli bir tahmin yaparak taşınabilir. Bir dönüm noktasına çok fazla sayıda eklenen konular varsa, bunlar kaldırılır veya sonraki yapıya eklenir.
zh_hans: 这不是一个明确的周期。 稳定的版本在准备就绪时就已准备完整了，不应引入新的错误或发布非常不完整的功能。 由于OTA更新无法在所有关键问题结束前发布，因此可能需要通过对所有问题何时可以处理进行有根据的猜测来调动ETA。 如果添加到这次重要阶段的问题太多，则应将其删除或添加到下一个重要阶段。
zh_hant: 這不是一個確定的週期。穩定的版本準備好了，不應該引入新的錯誤或附帶非常不完整的功能。由於 OTA 更新無法在關閉所有關鍵問題之前發佈，因此可能必須通過對何時可以處理所有問題進行有根據的猜測來移動 ETA。如果添加到里程碑中的問題太多，則會將其刪除或添加到下一個里程碑中。
