Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: **good first issue**: This issue is not critical and trivial to fix. It is reserved for new contributors as a place to start.
ca: **good first issue**: Apropiat com a primer problema - Aquest problema no és crític i és trivial arreglar-lo. Està reservat per a contribuïdors novells com un lloc on començar.
de: **good first issue**: Dieses Problem ist nicht kritisch, aber einfach zu beheben. Es ist reserviert für neue Mitwirkende als Platz zum beginnen.
es: **buen primer problema**: este problema no es crítico y es trivial su reparación. Está reservado como un lugar por donde empezar para nuevos colaboradores.
ru: **good first issue** -**для начинающих**: эта проблема не является критической и важной. Она предназначена начинающим разработчикам.
sq: **good first issue**: Kjo çështje nuk është kritike dhe e parëndësishme për të rregulluar. Është e rezervuar për kontribuesit e rinj si vend për të filluar.
tr: **iyi ilk sorun**: Bu sayı, düzeltilmesi gereken kritik ve önemsiz değildir. Yeni katkıda bulunanlar için başlangıç noktası olarak ayrılmıştır.
zh_hant: **好問題** ：這個問題不是關鍵和瑣碎的解決，它是為新的貢獻者保留的，作為一個開始的地方。

source: This is the documentation for the UBports project. Our goal is to create an open-source (GPL if possible) mobile operating system that converges and respects your freedom.
ca: Aquesta és la documentació del projecte UBports. El nostre objectiu és crear un sistema operatiu mòbil de codi obert que sigui convergent i respecti la vostra llibertat.
de: Dies ist die Dokumentation für das UBports-Projekt. Unser Ziel ist es ein quelloffenes (nach Möglichkeit GPL) mobiles Betriebssystem zu schaffen welches konvergiert und Deine Freiheit respektiert.
es: Esta es la documentación del proyecto UBports. Nuestro objetivo es crear un sistema operativo móvil de código abierto (GPL si es posible) que sea convergente y respete su libertad.
sq: Ky është dokumentacioni për projektin UBports. Qëllimi ynë është të krijojmë një sistem operativ celular të hapur (nëse është e mundur GPL) që konvergon dhe respekton lirinë tuaj.
tr: Bu dökümanlar, UBports projesinin belgeleridir. Hedefimiz, özgürlükle özdeşleşen ve bu doğrultuda bir açık kaynak (mümkünse GPL) mobil işletim sistemi oluşturmaktır.
zh_hant: 這是 UBports 專案的文檔。我們的目標是建立一個開源 (GPL 如果可能的話) 移動作業系統，融合並尊重您的自由。

source: The UBports project was founded by Marius Gripsgard in 2015 and in its infancy was a place where developers could share ideas and educate each other in hopes of bringing the Ubuntu Touch platform to more and more devices.
ca: El projecte UBports va ser creat pel Marius Gripsgard en 2015 i, durant la seva primera fase, era un lloc on els desenvolupadors podien compartir idees i formació amb la il·lusió de portar la plataforma Ubuntu Touch a cada cop més dispositius.
de: Das UBports-Projekt wurde von Marius Gripsgard 2015 gegründet und in seinen Anfängen war es ein Platz wo Entwickler Ideen austauschen und sich gegenseitig helfen konnten, in der Hoffnung, die Ubuntu Touch Plattform auf immer mehr Geräte zu bringen.
es: El proyecto UBports fue creado por Marius Gripsgard en 2015 y, durante su primera fase, era un lugar donde los desarrolladores podían compartir ideas y formación con la ilusión de llevar la plataforma Ubuntu Touch a cada vez más dispositivos.
sq: Projekti UBports u themelua nga Marius Gripsgard në vitin 2015 dhe në fillim të tij ishte një vend ku zhvilluesit mund të ndajnë idetë dhe të ndihmojnë njëri-tjetrin, duke shpresuar që ta sjellin platformën Ubuntu Touch në gjithnjë e më shumë pajisje.
tr: UBports projesi Marius Gripsgard tarafından 2015 yılında kuruldu ve başlangıç döneminde geliştiricilerin fikir alışverişinde bulunabilecekleri ve Ubuntu Touch platformunu gittikçe daha fazla cihaza getirme umuduyla birbirlerini eğitebilecekleri bir yerdir. Arda C. tarafından dil desteği verilmektedir.
zh_hant: UBports 專案是由 Marius Gripsgard 在2015年所建立的，在其起步階段，開發者可以在這裡交流想法和互相教學，希望將 Ubuntu Touch 平臺帶到越來越多的設備。

source: After Canonical suddenly announced `their plans to terminate support of Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ in April of 2017, UBports and its sister projects began work on the open-source code, maintaining and expanding its possibilities for the future.
zh_hant: 在Canonical 於2017年4月突然宣佈 "他們終止對 Ubuntu Touch 的支<https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>"_ 2017年4月，UBports 及其姊妹專案開始開發開放原始碼，維護和擴大其未來的可能性。

source: This documentation is always improving thanks to the members of the UBports community. It is written in ReStructuredText and converted into this readable form by `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, and `Read the Docs <https://readthedocs.io>`_. You can start contributing by checking out the :doc:`Documentation intro </contribute/documentation>`.
ca: Aquesta documentació està sempre millorant gràcies als membres de la comunitat de l'UBports. Està escrita en ReStructuredText i convertida a aquesta forma llegible per l'`Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, i `Read the Docs <https://readthedocs.io>`_. Podeu començar a contribuir llegint la :doc:`Introducció a la documentació </contribute/documentation>`.
de: Diese Dokumentation wird stetig verbessert, dank vieler Mitglieder der Gemeinschaft. Sie wird in ReStructuredText geschrieben und durch `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_ und `Read the Docs <https://readthedocs.io>`_ in diese lesbare Form konvertiert. Auch Sie können mitwirken und bei der :doc:`Dokumentationseinführung </contribute/documentation>` beginnen.
es: Esta documentación está siempre mejorando gracias a los miembros de la comunidad de UBports. Está escrita en ReStructuredText y convertida a esta forma legible por `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, y `Read the Docs <https://readthedocs.io>`_. Puede comenzar a contribuir echando un vistazo a la :doc:`Introducción a la documentación </contribute/documentation>`.
sq: Ky dokumentacion po përmirësohet vazhdimisht, falë shumë anëtarëve të komunitetit. Është shkruar në ReStructuredText dhe sphinx <http://www.sphinx-doc.org/en/stable/> `_,` ReCommonMark <http://recommonmark.readthedocs.io/en/latest/> `_ dhe 'Lexo Dokumentet <https://readthedocs.io> `_ konvertuar në këtë formë të lexueshme. Edhe ju mund të merrni pjesë dhe të filloni me: doc: `paraqitja e dokumentacionit </ kontribute / dokumentacioni>`.
tr: Bu dokümantasyon, UBports topluluğunun üyeleri sayesinde her zaman gelişiyor. ReStructuredText'de yazılmış ve bu okunabilir forma Sphinx ile sokuldu <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, ve `Döküman Oku <https://readthedocs.io>`_. Katkıda bulunmaya, :doc:`Dokümantasyon tanıtımı </contribute/documentation>`.
zh_hant: 由於 UBports 社區的成員，此文檔始終在改進。它是用 Re 結構文本編寫的，並透過 "Sphinx <http://www.sphinx-doc.org/en/stable/>"_，"重新共同標記<http://recommonmark.readthedocs.io/en/latest/>"_，和 "閱讀文檔<https://readthedocs.io>"_。您可以通過查看:doc: "開始提供說明 </contribute/documentation>"。

source: **Quality Assurance**: The patch is completed and has passed initial testing. The QA team will now review it and provide feedback. If problems are found, the issue is moved back to “Accepted”.
ca: **Quality Assurance**: Control de qualitat - S'ha completat el pegat i ha passat les comprovacions inicials. A continuació l'equip de control de qualitat el revisarà en tots els dispositius i proveirà retroalimentació. Si es troben problemes, el problema es retornarà a «Acceptat».
de: **Quality Assurance**: Die Korrektur ist vollständig und hat das initiale Testen bestanden. Das QA-Team wird sie auf allen Geräten überprüfen und Rückmeldung geben. Falls Probleme gefunden werden wandert das Thema zurück zu “Accepted”.
es: **Control de calidad**: el parche está terminado y ha pasado la fase de prueba inicial. El equipo de control de calidad lo revisará y aportará su opinión. Si se encontrasen problemas se devolvería a “aceptado”.
sq: ** Sigurimi i Cilësisë **: Korrigjimi është i plotë dhe ka kaluar testimin fillestar. Ekipi i QA do t'i shqyrtojë ato në të gjitha pajisjet dhe do të japë reagime. Nëse gjenden probleme, tema kthehet te "Pranohet".
zh_hant: **品質保證 (QA) ** ：修補程式已完成並已通過初步測試。QA 團隊現在將對其進行審查並提供回報。如果發現問題，問題將移回 "已接受"。

source: **None (removed from the project)**: If the issue is open and labeled "help wanted", community contributions are required to resolve the issue. If it's closed, that means that either a patch has been released on the stable channel (a comment on the issue should link to the patch) or the issue has been rejected (labeled “wontfix”).
ca: **None (removed from the project)**: Cap, eliminat del projecte. Si el projecte està obert i etiquetat amb «help wanted» (cal ajuda), es requereixen contribucions de la comunitat per resoldre el problema. Si està tancat, això significa que o bé s'ha alliberat un pegat al canal estable (un comentari al problema hauria d'enllaçar amb el pegat) o bé el problema s'ha rebutjat (etiquetat «wontfix», no s'arreglarà).
es: **Ninguno (eliminado del proyecto)**: si el problema está abierto y etiquetado "help wanted" (se busca ayuda), se necesitan colaboraciones de la comunidad para resolver el problema. Si está cerrado, eso significa que tanto un parche ha sido publicado en el canal estable (un comentario sobre el problema debería enlazar con el parche) o el problema ha sido rechazado (etiquetado “wontfix” o no se arreglará).
sq: ** Asnjë (i hequr nga projekti) **: Nëse çështja është e hapur dhe etiketuar "ndihmë e kërkuar", kontributet e komunitetit janë të nevojshme për të zgjidhur çështjen. Nëse është e mbyllur, kjo do të thotë që ose një patch është lëshuar në kanalin e qëndrueshëm (një koment mbi çështjen duhet të lidhet me patchin) ose çështja është refuzuar (etiketuar "wontfix").
zh_hant: **無 (從專案中刪除) ** ：如果問題是打開的, 並標記為 "需要幫助"，則需要社區捐款來解決問題。如果它已關閉，這意味著在穩定通道上已發佈修補程式 (有關該問題的注釋應連結到該修補程式)，或者問題已被拒絕 (標記為 "不修復")。

source: Once a *developer* is assigned and starts working on the issue, it is moved to “In Development”. As soon as they have something to show for, the issue is closed and automatically moved to “Quality Assurance” for feedback from the QA team. If necessary, the developer will provide hints on how to test his patch in a comment on the issue.
zh_hant: 一旦 *開發人員* 被分配並開始處理該問題，它將被移至 “開發中”。 一旦他們有了展示的東西，問題就會被關閉，並自動轉移到 “品質保證 (QA)”，以獲得 QA 團隊的回應。 如有必要，開發人員將在有關問題的評論中提供有關如何測試其補丁的提示。

source: The *QA-Team* tests the fix on all devices and provides feedback to the developer. If problems are found, the issue is re-opened and goes back to “Accepted”, else it’s moved to “Release Candidate” to be included in the next release.
ca: L'*Equip de control de qualitat* verifica la correcció del problema a tos els dispositius i proveeix reaccions al desenvolupador. Si es troben problemes, el problema es torna a obrir i torna a «Acceptat», en cas contrari es mou a «Versió candidata» perquè s'inclogui al proper alliberament.
es: El *Equipo de control de calidad* prueba el arreglo en todos los dispositivos y aporta su valoración al desarrollador. Si se encuentran problemas, se reabre el problema y regresa a “aceptado”, si no se mueve a “Versión candidata” para su inclusión en la siguiente publicación.
sq: * QA-Team * teston rregullimin në të gjitha pajisjet dhe jep reagime për zhvilluesin. Nëse gjenden probleme, çështja rihapet dhe shkon prapa në "Pranohet", përndryshe është zhvendosur në "Çlirimin e kandidatit" për t'u përfshirë në lirimin e ardhshëm.
zh_hant: *QA 團隊* 在所有設備上測試修復程式，並向開發人員提供回應。如果發現問題，問題將重新打開並返回到 "已接受"，否則它將移動到 "最終測試 (RC)"，包含在下一個版本中。

source: After Canonical suddenly announced `their plans to terminate support of Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ in April of 2017, UBports and its sister projects began work on the open-source code, maintaining and expanding its possiblilities for the future.
de: Nachdem Canonical plötzlich `seine Pläne zum beenden des Supports für Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ im April 2017 veröffentlicht hatte, begannen UBports und seine Schwesterprojekte am pflegen und erweitern des Quellcode für die Zukunft zu arbeiten.
es: Después de que Canonical anunció de repente `su plan de acabar el soporte a Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ en Abril de 2017, UBports y sus proyectos hermanos empezaron a trabajar el código abierto, a mantenerlo y a ampliar sus posibilidades para el futuro.
tr: Canonical, aniden Ubuntu Touch desteğini sona erdirme planlarını açıkladı <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/> UBports ve kardeş projeleri, 2017 yılının nisan ayında, açık kaynak kodu üzerinde çalışmaya ve gelecek için olanakları korumaya ve genişletmeye başladı.

source: Since our quality assurance depends heavily on the community, we try to track issues where the user would expect them, instead of seperated by repository. This means, that issues of almost all components that are distributed as with the system-image are tracked in the `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. An exception of this are click-apps that can be updated independently through the OpenStore.
de: Da unsere Qualitätssicherung massiv von der Gemeinschaft abhängt, versuchen wir Probleme dort zu verfolgen, wo der Nutzer es erwarten würde, anstatt im jeweiligen Repository. Das bedeutet, dass die Probleme fast aller Komponenten, die mit dem Systemabbild ausgeliefert werden, im `Ubuntu Touch Tracker <https://github.com/ubports/ubuntu-touch>`__ verfolgt werden. Eine Ausnahme bilden die Click-Apps, die unabhängig über den OpenStore aktualisiert werden.
es: Dado que nuestra garantía de calidad recae fuertemente en la comunidad, tratamos de seguir los problemas donde el usuario lo esperaría, en vez de separadamente por repositorio. Esto significa que problemas de casi todos los componentes que están distribuidos, como la imagen de sistema, son seguidos en el `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. Una excepción a esto son las click-apps que pueden ser actualizadas independientemente a través de OpenStore.
tr: Kalite güvencemiz ağırlıklı olarak topluluğa bağlı olduğundan, depo tarafından ayrılmak yerine, kullanıcının onları bekleyeceği sorunları izlemeye çalışıyoruz. Bunun anlamı, sistem görüntüsü gibi dağıtılan hemen hemen tüm bileşenlerin sorunları içerir `Ubuntu Touch İzleyici <https://github.com/ubports/ubuntu-touch>`__. Bunun istisnası, OpenStore aracılığıyla bağımsız olarak güncellenebilen tıklama uygulamalarıdır.

source: To increase transparency and communication, GitHub projects (Kanban-Boards) are used whereever practical. In case of github.com/ubports/ubuntu-touch, a single project is used for all issues. Projects support filtering by labels, so that only issues that belong to a specific team or affect a specific device can be viewed.
de: Um die Transparenz und Kommunikation zu stärken, werden GitHub-Projekte (Kanban-Boards) genutzt, wann immer praktikabel. Im Falle von github.com/ubports/ubuntu-touch wird ein Projekt für alle Probleme genutzt. Projekte unterstützen das Filtern nach Markierungen, so dass man sich Probleme eines bestimmten Teams oder Geräts anzeigen lassen kann.
es: Para aumentar la transparencia y la comunicación, los proyectos de GitHub (Kanban-Boards) se utilizan siempre que sea práctico. En el caso de github.com/ubports/ubuntu-touch, se usa un solo proyecto para todos los problemas. Los proyectos admiten el filtrado por etiquetas, por lo que pueden verse los problemas que solo pertenecen a un equipo específico o afectan a un dispositivo específico.
tr: Şeffaflığı ve iletişimi artırmak için GitHub projeleri (Kanban-Boards) pratik olarak kullanılır. Github.com/ubports/ubuntu-touch konumunda, tüm konular için tek bir proje kullanılır. Projeler etiketleri kullanarak filtrelemeyi desteklemelisiniz, böylece yalnızca belirli bir ekibe ait olan veya belirli bir cihazı etkileyen sorunlar görüntülenebilir.

source: **None (awaiting triage)**: The issue has been approved by a member of the qa team and is awaiting review from the responsible development team. if the issue is a bug, instructions to reproduce are included in the issue description. if the issue is a feature request, it has passed a primary sanity check by the qa-team but has not yet been accepted by the responsible development-team.
de: **None (awaiting triage)**: Das Problem wurde durch ein Mitglied des QA-Teams bestätigt und wartet auf Überprüfung durch das Entwicklerteam. Falls es sich um einen Fehler handelt, werden Anweisungen zum Reproduzieren in die Problembeschreibung aufgenommen. Falls es sich um eine Funktionalitätsanfrage handelt, hat es eine erste Plausibilitätsprüfung durch das QA-Team bestanden, warten aber noch darauf, vom Entwickler-Team angenommen zu werden.
es: **Ninguno (esperando clasificación)**: el problema ha sido aprobado por un miembro del equipo de control de calidad y está esperando la revisión del responsable del equipo de desarrollo. Si el problema es un error, las instrucciones para reproducirlo están incluidas en la descripción del problema. Si el asunto es una solicitud de función, ha pasado una comprobación preliminar del equipo de control de calidad pero no ha sido aceptado aún por el responsable del equipo de desarrollo.
tr: **Hiçbirşey (triyaj bekleniyor)**: Sorun, qa ekibinin bir üyesi tarafından onaylandı ve sorumlu geliştirme ekibinden incelemeyi bekliyor. Sorun bir hata ise, yeniden üretme talimatları konunun tanımına dahil edilir. Sorun bir özellik isteği ise, qa-team tarafından birincil kontrolü geçti ancak henüz sorumlu geliştirme ekibi tarafından kabul edilmedi.

source: **Accepted**: The issue has been accepted by the responsible development-team. If the issue is a bugreport, the team has decided that it should be fixable and accepts the responsibility. If the issue is a featrue request, the team thinks it should be implemented as described.
de: **Accepted**: Das Problem wurde durch das verantwortliche Entwicklerteam angenommen. Falls es sich um einen Fehlerbericht handelt, hat das Team entschieden, dass der Fehler behebbar ist und übernimmt die Verantwortung. Falls es sich um eine Funktionalitätsanfrage handelt, so denkt das Team, dass die Funktion so wie beschrieben implementiert werden soll.
es: **Aceptado**: el problema ha sido aceptado por el responsable del equipo de desarrollo. Si el problema es un informe de un error, el equipo ha decidido que debería ser reparable y acepta la responsabilidad. Si el asunto es una solicitud de función, el equipo opina que debería implementarse como se describe.
tr: **Kabul edildi**: Konu, sorumlu geliştirme ekibi tarafından kabul edildi. Sorun bir hata raporuysa, ekip düzeltilebilir olmasına karar vererek sorumluluğu kabul eder. Eğer sorun muazzam bir talepse, ekip açıklandığı gibi uygulanması gerektiğini düşünüyor.

source: **bug**: This issue is a confirmed bug. If it's reproducable, reproduction steps are described.
de: **bug**: Das Problem ist ein bestätigter Fehler. Falls er reproduzierbar ist, sind die Schritte zum Reproduzieren beschrieben.
es: **error**: este problema es un error confirmado. Si es reproducible, se describen los pasos para su reproducción.
tr: **bug**: Bu sorun doğrulanmış bir hatadır. Yeniden üretilebilirse üreme adımları açıklanmaktadır.

source: Once a *developer* is assigned and starts working on the issue, it is moved to “In Development”. As soon as they have something to show for, the issue is closed and automatically moved to “Quality Assurance” for feedback from the QA team. If neccessary, the developer will provide hints on how to test his patch in a comment on the issue.
es: Una vez que se ha asignado un *desarrollador* y comienza a trabajar en el problema, se mueve a “En desarrollo”. Tan pronto como tenga algo que mostrar, el problema se cierra y automáticamente se mueve a “Control de calidad” para la valoración del equipo de control de calidad. Si es necesario, el desarrollador aportará pistas de como probar su parche en un comentario en el problema.
