Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: **critical (rc)**: This critical issue that only occurs on the devel and rc channel is blocking the release of the next stable release. Usually, issues that can not simply be moved to a different release and have the power to postpone the release are labeled this.
ca: **critical(rc)**: Crític (versió candidata) - Aquest problema crític que sols apareix als canals de desenvolupament i de versió candidata està blocant l'alliberament de la pròxima versió estable. Generalment, els problemes que no es poden simplement moure a una altra versió i tenen el poder de postposar la versió són els que reben aquesta etiqueta.
de: **critical (rc)**: Dieses kritische Problem, das nur auf dem Release-Kandidat- und Entwicklungskanal auftritt, blockiert die Veröffentlichung des nächsten stabilen Abbilds. In der Regel werden solche Probleme damit markiert, die nicht einfach in eine andere Veröffentlichung verschoben werden können und deshalb eine Veröffentlichung verzögern.
es: **crítico (versión candidata)**: este problema crítico que solo ocurre en el canal desarrollo y en el canal versión candidata está bloqueando la publicación de la próxima versión estable. Normalmente los problemas que no se pueden aplazar a otra publicación y tienen el poder de retrasar la publicación se etiquetan así.
nb: **kritisk (rc)**: Dette kritiske problemet som bare oppstår på utviklings- og rc-kanalen, blokkerer utgivelsen av neste stabile utgivelse. Vanligvis merkes problemer som ikke bare kan flyttes til en annen utgivelse og som har makt til å utsette utgivelsen.
pl: **krytyczny (rc)**: To problem krytyczny, który występuje tylko w kanale devel i rc blokuje wydanie następnej stabilnej wersji. Zwykle problemy, które nie mogą być przeniesione do innej wersji i mają prawo do odroczenia wydania, są oznaczone etykietą.
ru: **critical (rc)**: критическая ошибка, которая возникает только на каналах devel и rc. Она блокирует выпуск следующего стабильного релиза. Обычно так помечаются баги, которые нельзя перенести в следующий релиз.
sq: **critical (rc)**:Kjo çështje kritike që ndodh vetëm në kanalin e Lirimit të Kandidatit dhe Zhvillimit bllokon lirimin e imazhit të ardhshëm të qëndrueshëm. Si rregull, probleme të tilla shënohen me to, të cilat thjesht nuk mund të zhvendosen në një tjetër publikim dhe prandaj vonojnë botimin.
tr: **critical (rc)**: Sadece devel ve rc kanalında ortaya çıkan bu kritik konu bir sonraki istikrarlı sürümün yayınını engelliyor. Genellikle, basitçe farklı bir yayına taşınamayan ve yayınlamayı erteleme gücüne sahip olan konular bu etikete sahiptir.
zh_hans: ** critical（rc）**：仅在devel通道和rc通道上发生的关键问题阻碍了下一个稳定版本的发布。 通常情况下，不能简单地移动到不同版本并且有权推迟发布的问题都标记为此。
zh_hant: ** 關鍵 (Critical RC) ** ：僅在開發和最終測試 (RC) 通道上發生的這一關鍵問題正在阻止下一個穩定版本的發佈。通常情況下，不能簡單地將問題移動到不同的版本並有權推遲發佈的問題會將其標記為這一點。

source: **device: [DEVICE CODENAME]**: This issue affects only the specified device(s).
ca: **device:[NOM CLAU DEL DISPOSITIU]**: Aquest problema afecta sols el(s) dispositiu(s) afectat(s).
de: **device: [DEVICE CODENAME]**: Dieses Problem betrifft nur die angegebenen Geräte.
es: **dispositivo: [ALIAS DEL DISPOSITIVO]**: este problema afecta solo a un o unos dispositivos determinados.
nb: **enhet: [DEVICE CODENAME]**: Dette problemet berører bare de angitte enhetene.
pl: **urządzenie: [KOD NAZWY URZĄDZENIA]**: ten problem dotyczy tylko określonych urządzeń.
ru: **device: [DEVICE CODENAME]**: Ошибка проявляется только на этом устройстве.
sq: **device: [DEVICE CODENAME]**: Ky problem ndikon vetëm në pajisjet e specifikuara.
tr: **cihaz: [DEVICE CODENAME]**: Bu sorun yalnızca belirtilen cihazları etkiliyor.
zh_hans: **device: [DEVICE CODENAME] **：此问题仅影响指定的设备。
zh_hant: **裝置: [裝置代碼名稱]** ：此問題僅影響指定的設備。

source: **team: [TEAM NAME]**: This issue is falls under the responsibility of a specific team (hal, middleware, UI).
ca: **team:[NOM DE L'EQUIP]**: Aquest problema està sota la responsabilitat d'un equip especificat (hall, middleware, UI).
de: **team: [TEAM NAME]**: Dieses Problem fällt unter die Verantwortlichkeit des angegebenen Teams (hal, middleware, UI).
es: **equipo: [NOMBRE DEL EQUIPO]**: este problema recae bajo la responsabilidad de un equipo específico (hal, middleware, UI).
nb: **team: [LAGNAVN]**: Dette problemet faller under ansvaret til et bestemt team (HAL, middleware, grensesnitt).
pl: **zespół: [NAZWA ZESPOŁU]**: ten problem leży w gestii określonego zespołu (hal, middleware, UI).
ru: **team: [TEAM NAME]**: этим вопросом уже занимается определенная команда разработчиков (hal, middleware, UI).
sq: **team: [TEAM NAME]**: Kjo çështje bie nën përgjegjësinë e ekipit të specifikuar (hal, middleware, UI).
tr: **ekip: [TEAM NAME]**: Bu konu belirli bir ekibin sorumluluğundadır (hal, middleware, kullanıcı arayüzü).
zh_hans: **team: [TEAM NAME] **：这个问题属于特定团队（hal，middleware，UI）的责任范围。
zh_hant: **團隊: [團隊名稱]**: 此問題由特定團隊 (hal、middleware、UI) 負責。

source: If a repository that tracks issues locally defines it's own labels, they should be documented in the README.md.
ca: Si un repositori que segueix els problemes localment defineix les seves pròpies etiquetes, s'haurien de documentar al README.md.
de: Falls ein Repository, das lokal seine Probleme verfolgt, eigene Markierungen verwendet, so sollten diese in der README.md dokumentiert sein.
es: Si un repositorio que sigue los problemas localmente define sus propias etiquetas, estas deberían ser documentadas en el README.md.
nb: Hvis et arkiv som sporer problemer lokalt definerer dets egne etiketter, bør de dokumenteres i README.md.
pl: Jeśli repozytorium, które śledzi problemy lokalnie, definiuje własne etykiety, powinny być one udokumentowane w pliku README.md.
ru: Если репозиторий в баг-трекере использует свою собственную систему меток, то они должны быть подробно описаны в файле README.md.
sq: Nëse një depo që gjurmon çështjet në nivel lokal përcakton etiketat e veta, ato duhet të dokumentohen në README.md.
tr: Sorunları yerel olarak izleyen bir depo kendi etiketlerini tanımlıyorsa, README.md'de belgelenmelidir.
zh_hans: 如果在本地跟踪问题的存储库定义了它自己的标签，则应将其记录在README.md中。
zh_hant: 如果當地追蹤問題的存儲庫定義了自己的標示，則應在 README.md 中記錄這些標示。

source: Milestones
ca: Fites
de: Meilensteine
es: Hitos
nb: Milepæler
pl: Kamienie milowe
ru: Майлстоуны (контрольные точки проекта)
sq: Historiku
tr: Dönüm Noktaları
zh_hans: 里程碑
zh_hant: 里程碑

source: Milestones are used for stable OTA releases only. In general, milestones for the work-in-progress OTA and the next OTA are created. The ETA is set, once the work on the release starts (that is 6 weeks from start date), but can be adjusted afterwards. See the :doc:`release-schedule <release-schedule>` for more info.
ca: Les fites s'usen sols per alliberaments OTA estables. En general, es creen les fites per l'OTA treball-en-curs i pròxima. S'estableix el temps previst per l'alliberament un cop que comença el treball per l'alliberament (és a dir 6 setmanes des del moment de l'inici), però es pot ajustar més tard. Vegeu el :doc:`calendari-de-publicació <release-schedule>'_ per a més informació.
de: Meilensteine werden nur für OTA-Veröffentlichungen genutzt. Im Allgemeinen werden Meilensteine für das OTA in Arbeit und das nächste OTA erstellt. Das angepeilte Veröffentlichungsdatum wird gesetzt, sobald die Arbeit an einer Veröffentlichung beginnt (6 Wochen vom Startzeitpunkt), kann aber immer noch angepasst werden. Mehr Infos unter :doc:`Veröffentlichungs-Planung <release-schedule>`.
es: Los hitos se usan solo para las publicaciones estables OTA. En general, se crean hitos para la OTA trabajo en marcha y la siguiente OTA. El tiempo estimado de publicación se establece una vez comienza el trabajo sobre la publicación (esto es 6 semanas desde la fecha de comienzo) pero se puede modificar mas tarde. Vea el :doc:`calendario de publicación <release-schedule>`para más información.
nb: Milepæler brukes kun til stabile OTA-utgivelser. Generelt sett opprettes milepæler for den pågående arbeidet og neste OTA. ETA er satt når arbeidet med utgivelsen starter (det er 6 uker fra startdato), men kan justeres etterpå. Se: doc: ``release-schedule <release-schedule>' for mer info.
pl: Kamienie milowe są używane tylko do stabilnych wersji OTA. Ogólnie rzecz biorąc, powstają kamienie milowe dla pracującego w toku OTA i kolejnego OTA. ETA jest ustawiona, gdy rozpocznie się praca nad wydaniem (czyli 6 tygodni od daty rozpoczęcia), ale później można ją dostosować. Zobacz: doc: `release-schedule <release-schedule>`, aby uzyskać więcej informacji.
ru: Майлстоуны (или, как их ещё называют, вехи) используются только для стабильных релизов OTA. В основном, майлстоуны создаются для готовящегося и будущего релиза OTA. ETA определён, и тогда начинается работа над релизом (обычно он наступает через 6 недель после начала работ). Подробнее смотрите статью про :doc:`расписание выхода релизов <release-schedule>`.
sq: Historiku është përdorur vetëm për lëshime të qëndrueshme OTA. Në përgjithësi, krijohen momentet kryesore për OTA-në në punë dhe OTA-në e ardhshme. ETA është caktuar, sapo të fillojë puna për lirimin (domethënë 6 javë nga data e fillimit), por mund të përshtatet më pas. Shihni: doc: `release-schedule <release-schedule>` për më shumë informacion.
tr: Kilometre Taşları yalnızca istikrarlı OTA sürümleri için kullanılır. Genel olarak, devam eden OTA ve bir sonraki OTA için kilometre taşları oluşturulmuştur. ETA, bırakma işlemi başladıktan sonra (başlangıç tarihinden itibaren 6 hafta) başlar, ancak daha sonra ayarlanabilir. Daha fazla bilgi için:doc:`release-schedule <release-schedule>` bölümüne bakın.
zh_hans: 里程碑仅用于稳定的OTA释放。 通常，创建正在进行中的OTA和下一个OTA的里程碑。 一旦发布的工作开始（从开始日期起6周），ETA就会设置，但之后可以进行调整。 有关详细信息，请参阅：doc：`release-schedule <release-schedule>`。
zh_hant: 里程碑僅用於穩定的 OTA 釋放。一般來說, 將為正在進行的工作 OTA 和下一個 OTA 創建里程碑。在發佈工作開始後 (從即日起開始到第 6 周)，則設置了ETA，但可以在之後進行調整。有關詳細資訊，請參閱:doc:"發佈計畫 <release-schedule>"。

source: Assignees
ca: Assignats
de: Zuweisung
es: Asignados
nb: Tilknyttede
pl: Pełnomocnicy
ru: Назначение работы разработчику
sq: Pranuesit
tr: Atanılanlar
zh_hans: 申请人
zh_hant: 申請人

source: To make it transparent who's working on an issue, the developer should be assigned. This also allows the use of GitHub's global filtering as a type of TODO list. For example, `this is everything assigned to mariogrip in @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
ca: Per fer transparent qui està treballant en un problema, s'hauria d'assignar el desenvolupador. Això permet també usar el filtratge global de GItHub com una mena de llista de tasques pendents. Per exemple, `això és tot el que està assignat a mariogrip a @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
de: Um es transparent zu machen, wer woran arbeitet, sollte der Entwickler dem jeweiligen Problem zugewiesen werden. Damit lässt sich der GitHub-Filter als eine Art TODO-Liste nutzen. Zum Beispiel ist `dise alles, was mariogrip in @ubports zugewiesen ist <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
es: Para hacer transparente quien está trabajando en un problema, un desarrollador debería ser asignado. Esto además permite el uso del filtrado global de GitHub como una forma de lista POR HACER. Por ejemplo, `esto es todo lo asignado a mariogrip en @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
nb: For å gjøre det gjennomsiktig hvem som jobber med et problem, bør utvikleren tildeles. Dette tillater også bruk av GitHubs globale filtrering som en type TODO-liste. For eksempel, `dette er alt tildelt mariogrip i @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
pl: Aby było jasne, kto pracuje nad danym problemem, programista powinien zostać przypisany. Pozwala to również na wykorzystanie globalnego filtrowania GitHub jako typu listy TODO. Na przykład: "to wszystko przypisane do mariogrip w @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>` _.
ru: Чтобы было понятно, кто работает над какой-то задачей, разработчика нужно назначать. Это также позволяет использовать систему глобальной фильтрации GitHub для ведения списков TODO (список того, что нужно сделать). Например, `вот список того, над чем работает разработчик mariogrip из @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
sq: Për të bërë të qartë se kush po punon për një çështje, zhvilluesi duhet të caktohet. Kjo gjithashtu lejon përdorimin e filtrimit global të GitHub si një lloj liste TODO. Për shembull, `kjo është gjithçka e caktuar për mariogrip në @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>` _.
tr: Bir konuda kimin çalıştığını şeffaf yapmak için geliştiricinin görevlendirilmesi gerekir. Bu ayrıca, GitHub'un genel filtrelemesinin bir Yapılacaklar listesi türü olarak kullanılmasını sağlar. Örneğin, `bu, mariogrip'e atanan her şey @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_.
zh_hans: 为了使处理问题的人员变得透明，应该指派开发人员。 这也允许使用GitHub的全局过滤作为一种TODO列表。 例如，`这是在@ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>`_中分配给mariogrip的所有内容。
zh_hant: 為了使誰在處理某個問題是透明的，應分配開發人員。這也允許使用 GitHub 的全域篩選作為 TODO 清單的一種類型。例如:"這是分配給 mariogrip 的所有東西在@ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+assignee%3Amariogrip&type=>"_。

source: Developers are encouraged to keep their list short and update the status of their issues.
ca: Es demana als desenvolupadors de mantenir la seva llista curta i mantenir actualitzat l'estat del seus problemes.
de: Entwickler werden gebeten, ihre Liste kurz und ihre Issues aktuell zu halten.
es: Se anima a los desarrolladores a mantener su lista corta y a que mantengan el estatus de sus problemas actualizados.
nb: Utviklere oppfordres til å holde listen kort og oppdatere statusen på problemene sine.
pl: Programiści są zachęcani do trzymania listy skrótów i aktualizowania statusu swoich problemów.
ru: Разработчикам желательно не копить много задач и постоянно обновлять их статусы.
sq: Zhvilluesit inkurajohen të mbajnë listën e tyre të shkurtër dhe të përditësojnë statusin e çështjeve të tyre.
zh_hans: 鼓励开发人员保持他们的清单简短并更新他们的问题状态。
zh_hant: 鼓勵開發人員縮短清單並更新問題的狀態。

source: Examples
ca: Exemples
de: Beispiele
es: Ejemplos
nb: Eksempler
pl: Przykłady
ru: Примеры
sq: Shembuj
tr: Örnekler
zh_hans: 事例
zh_hant: 例子

source: Bug Lifecycle
ca: Cicle de vida de l'error
de: Lebenszyklus eines Fehlers
es: Ciclo de vida del error
nb: Livssyklus for feil
pl: Cykl życia błędu
ru: Жизненный цикл багов
sq: Ciklit të jetës së Bug
tr: Hataların Yaşam Döngüsü
zh_hans: Bug 生命周期
zh_hant: 錯誤生命週期

source: The same principle applies to feature requests. The only difference is, that instead of the label **bug**, the label **enhancement** is used. The **needs confirmation** label is not applicable for feature requests.
ca: S'aplica el mateix principi a les demandes de funcionalitat. L'única diferència és que, en comptes de l'etiqueta **bug** (error), s'usa l'etiqueta **enhancement** (millora). L'etiqueta **needs confirmation** (cal confirmació) no s'aplica a les demandes de funcionalitat.
de: Das selbe Prinzip gilt auch für Funktionalitätsanfragen. Der einzige Unterschied ist, dass anstatt der Markierung **bug** die Markierung **enhancement** genutzt wird. Die Markierung **needs confirmation** ist außerdem nicht auf Funktionalitätsanfragen anwendbar.
es: El mismo principio se aplica a las solicitudes de función. La única diferencia es que en vez de la etiqueta **error**, se usa la etiqueta **mejora**. La etiqueta **necesita confirmación** no se aplica a las solicitudes de función.
nb: Det samme prinsippet gjelder funksjonsforespørsler. Den eneste forskjellen er at i stedet for etiketten **bug** brukes etiketten **enhancement**. Merket **needs confirmation** gjelder ikke for funksjonsforespørsler.
pl: Ta sama zasada dotyczy zgłoszeń funkcji. Jedyna różnica polega na tym, że zamiast etykiety **błąd** używana jest etykieta **ulepszenie**. Etykieta **Potrzeba potwierdzenia** nie ma zastosowania w przypadku żądań funkcji.
ru: Тот же принцип применяется к запросам новых функций. Единственное отличие состоит в том, что вместо метки ** bug ** используется метка **extension**. Метка **needs confirmation** (**требуется подтверждение**) не применяется для запросов функций.
sq: I njëjti parim vlen edhe për kërkesat e funksioneve. I vetmi ndryshim është që në vend të etiketës ** bug **, përdoret etiketa ** **. Etiketa ** e konfirmimit ** nuk është e aplikueshme për kërkesat e funksioneve.
tr: Aynı ilke özellik talepleri için de geçerlidir. Tek fark sadece, **bug** etiketi yerine , **geliştirme** kullanılmasıdır. **needs confirmation** etiketi, özellik talepleri için geçerli değildir.
zh_hans: 同样的原则适用于功能请求。 唯一的区别是，使用标签**增强**而不是标签** bug **。 **需要确认**标签不适用于功能请求。
zh_hant: 同樣的原則也適用於功能請求。唯一的區別是，不是標示 **錯誤**，而是標示為 **增強**。標示 **需要確認** 不適用於功能請求。

source: A *User* files a new bug using the issue-template.
ca: Un *Usuari* registra un nou informe d'error usant la plantilla de problemes.
de: Ein *Nutzer* meldet einen neuen Fehler mithilfe der Problemvorlage.
es: Un *Usuario* presenta un nuevo error usando la plantilla de problema.
nb: En *bruker* arkiverer en ny feil ved hjelp av utgavemalen.
pl: *Użytkownik* zgłasza nowy błąd za pomocą szablonu problemu.
ru: Пользователь сообщает о новом баге с помощью этого шаблона.
sq: Një *përdorues * raporton një bug të ri duke përdorur shabllonin e problemit.
tr: *Kullanıcı*, konu şablonunu kullanarak yeni bir bug dosyasını dosyalar.
zh_hans: 一个 * 用户 *使用问题模板提交新错误。
zh_hant: *使用者* 使用問題範本提交一個新的錯誤。

source: The *QA-Team* adds the label **needs confirmation** and tries to work with the user to confirm the bug and add potentially missing information to the report. Once the report is complete a **team-label** will be added to the issue, the issue will be put on the **awaiting-triage-list** of the project and the label needs confirmation will be replaced with **bug**.
ca: L'*Equip de control de qualitat* afageix l'etiqueta **needs confirmation** (cal confirmació) i intenta treballar amb l'usuari per confirmar l'error i afegir informació que pugui faltar de l'informe. Un cop s'ha completat l'informe, s'afegirà una **etiqueta d'equip** al problema, el problema es posarà a la **awaiting-triage-list** (llista en espera de triatge) del projecte i l'etiqueta cal confirmació es reemplaçarà per **bug** (error).
de: Das *QA-Team* fügt die Markierung **needs confirmation** hinzu und versucht mit dem Nutzer zusammenzuarbeiten, um den Fehler und bestätigen und potenziell fehlende Informationen dem Bericht hinzuzufügen. Sobald der Bericht vollständig ist, wird eine **team-Markierung** angefügt und das Problem wird in die **awaiting-triage-list** des Projekts eingefügt. Die Markierung **needs confirmation** wird durch **bug** ersetzt.
es: El *Equipo de control de calidad* añade la etiqueta **necesita confirmación** y trata de trabajar con el usuario para confirmar el error y añadir información potencialmente ausente en el informe. Una vez se ha completado el informe una **etiqueta de equipo** será añadida al problema, el problema será puesto en la **lista esperando clasificación** del proyecto y la etiqueta necesita confirmación será reemplazada por **error**.
nb: *Kvalitetskontroll-laget* legger til etiketten **needs confirmation** og prøver å samarbeide med brukeren for å bekrefte feilen og legge til potensielt manglende informasjon i rapporten. Når rapporten er fullført, vil en **lag-etikett** bli lagt til i utgaven, problemet blir satt på **awaiting-triage-list** for prosjektet, og etiketten trenger bekreftelse vil bli erstattet med **bug**.
pl: *Zespół QA* dodaje etykietę **Potrzeba potwierdzenia** i próbuje współpracować z użytkownikiem, aby potwierdzić błąd i dodać potencjalnie brakujące informacje do raportu. Po zakończeniu raportu do zgłoszenia zostanie dodana **etykieta zespołu**, problem zostanie umieszczony na liście **oczekujących na stan** projektu, a potwierdzenie potrzebnej etykiety zostanie zastąpione na **błąd**.
ru: *QA-Team* сразу же помечает проблему ярлычком **needs confirmation** (**требуется подтверждение **), и проводит с пользователем беседу, чтобы подтвердить ошибку и выяснить все дополнительные детали. После неё заполняется тикет о проблеме, присваивается **маркер команды **( ** team-label **) и проблема помещается **список ожидающих проектов** (**awaiting-triage-list** ). Метка **needs confirmation** заменяется на **bug**.
sq: * QA-Team * shton etiketën ** për konfirmimin e nevojave ** dhe përpiqet të punojë me përdoruesin për të konfirmuar gabimin dhe për të shtuar informacionin që potencialisht mungon në raport. Sapo të përfundojë raporti, do të shtohet një ** etiketë ekipi **, çështja do të vendoset në listën ** në pritje të listës ** të projektit dhe etiketa duhet konfirmimi të zëvendësohet me ** insekt**.
tr: *QA-Team* etiketi şunu ekler; **needs confirmation** ve hatayı doğrulamak ve rapora eksik bilgi eklenmesi için kullanıcıyla çalışmaya çalışıyor. Rapor tamamlandıktan sonra **team-label** konuyla ilgili olarak eklenecek, şu etiket konuya konulacak; **awaiting-triage-list** ve etiket ihtiyaçları teyidi ile değiştirilecektir. **bug**.
zh_hans: * QA-Team *添加标签**需要确认**并尝试与用户一起确认错误并在报告中添加可能缺少的信息。 一旦报告完成，将在问题中添加**团队标签**，该问题将被放在项目的**等待分类列表**中，标签需求确认将被替换为**错误**。
zh_hant: *QA團隊* 添加標示 **需要確認**，並嘗試與使用者合作以確認錯誤並將可能缺少的資訊添加到報告中。報告完成後，將在問題上添加 **團隊標籤**，該問題將被列入專案的 **討論清單**，標示需要確認將要被 **錯誤** 所取代。
