Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: **Release Candidate**: The patch has passed QA and is ready for release. In case of deb-packages that are included in the system-image, the patch will be included in the next over-the-air update on the rc channel, and, if everything goes well, in the next release of the stable channel.
ca: **Release Candidate**: Versió candidata - El pegat ha passat el control de qualitat i ja es pot alliberar. Per al cas de paquets deb inclosos a la imatge de sistema, el pegat s'inclourà a la propera actualització OTA al canal versió candidata (rc), i, si tot va bé, al proper alliberament del canal estable.
de: **Release Candidate**: Die Korrektur hat die QS passiert und bereit für die Veröffentlichung. Im Falle von deb-Paketen, die im Systemabbild enthalten sind, wird die Korrektur in der nächsten over-the-air-Aktualisierung in den rc-Kanal eingefügt und, falls alles gut geht, in die nächste Veröffentlichung des stabilen Kanals.
es: **Versión candidata**: el parche ha pasado el control de calidad y está listo para su publicación. En el caso de paquetes deb que están incluidos en la imagen de sistema, el parche será incluido en la siguiente actualización OTA en el canal versión candidata y, si todo va bien, en la siguiente publicación del canal estable.
nb: **Utgivelseskandidat**: Feilrettingen har bestått kvalitetssikring og er klart for utgivelse. I tilfelle deb-pakker som er inkludert i systembildet, vil oppdateringen bli inkludert i den neste over-the-air oppdateringen på rc-kanalen, og hvis alt går bra, i neste utgivelse av den stabile kanalen.
pl: **Release Candidate**: łatka przeszła kontrolę jakości i jest gotowa do wydania. W przypadku pakietów deb, które są zawarte w obrazie systemu, łatka zostanie dołączona do kolejnej aktualizacji na kanale rc, a jeśli wszystko pójdzie dobrze, w następnej wersji stabilnego kanału.
ru: **Релиз-кандидат** - **Release Candidate**: патч прошел проверку группы контроля качества и готов к выпуску. Патч для deb-пакетов будет включен в следующее обновление на канале rc и, если все пойдет хорошо, он появится в следующей версии на стабильном канале.
sq: ** Lëshojeni Kandidatin **: Korrigjimi ka kaluar QS dhe është gati për lirim. Në rastin e paketave deb përfshirë në imazhin e sistemit, korrigjimi futet në kanalin rc në përditësimin e ardhshëm mbi-ajër dhe, nëse gjithçka shkon mirë, në lirimin e ardhshëm të kanalit të qëndrueshëm.
tr: **Sürüme Aday**: Düzeltme yaması QA'dan geçti ve sunulmaya bırakılmaya hazır. Sistem resmine dahil olan deb paketleri söz konusu olduğunda, düzeltme eki, rc kanalında yayınlanacak over-the-air ile sonraki güncellemeye ve her şey yolunda giderse istikrarlı kanalın bir sonraki sürümünde yer alacaktır.
zh_hans: **Release Candidate** ：该补丁已通过质量保证并准备发布。 如果系统映像中包含 Debian 软件包，该补丁将包含在 rc 频道的下一个 OTA 更新中，如果一切顺利，则将在稳定版频道的下一个版本中发布。
zh_hant: **最終測試 (RC)** ：修補程式已通過品質保證 (QA)，並已準備好發佈。如果系統映象中的套件，該修補程式將包含在最終測試 (RC) 通道上的下一次無線更新中，如果一切順利，則套件含在穩定通道的下一個版本中。

source: **None (removed from the project)**: If the issue is open and labeled "help wanted", community contributions are required to resolve the issue. If it's closed, that means that either a patch has been released on the stable channel (a comment on the issue should link to the patch) or the issue has been rejected (labeled "wontfix").
nb: **Ingen (fjernet fra prosjektet)**: Hvis problemet er åpent og merket "hjelp ønsket", kreves det at bidrag fra samfunnet løses. Hvis den er lukket, betyr det at enten en oppdatering er utgitt på den stabile kanalen (en kommentar til problemet skal lenke til oppdateringen) eller at problemet er avvist (merket "wontfix").
pl: **Brak (usunięto z projektu)**: Jeśli problem jest otwarty i oznaczony jako "potrzebna pomoc", do jego rozwiązania wymagany jest wkład społeczności. Jeśli jest zamknięty, oznacza to, że albo łatka została wydana na stabilnym kanale (komentarz do problemu powinien zawierać link do łatki), albo problem został odrzucony (oznaczony jako "wontfix").
ru: **None** - **Нет (удалено из проекта)**: Если проблема открыта и помечена как «Требуется помощь», для ее решения требуется участие сообщества. Если она закрыта, это означает, что либо патч был выпущен на стабильном канале (комментарий к проблеме должен содержать ссылку на патч), либо проблема была отклонена (помечена как "wontfix").

source: Labels
ca: Etiquetes
de: Markierungen
es: Etiquetas
nb: Etiketter
pl: Etykiety
ru: Метки
sq: Shenimet
tr: Etiketler
zh_hans: 标签
zh_hant: 標示

source: All issues - even closed ones - should be labeled to allow the use of GitHub's global filtering. For example, `these are all of the issues labeled 'enhancement' inside @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Consult the `GitHub help pages <https://help.github.com/articles/about-searching-on-github/>`__ for more information on search and filtering.
ca: Tots els problemes - fins i tot els tancats - s'haurien d'etiquetar per permetre l'ús del filtratge global del GitHub. Per exemple «aquests són tots els problemes etiquetats amb «enhancement» dins de `@ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Consulteu les `Pàgines d'ajuda <https://help.github.com/articles/about-searching-on-github/>`__ per a més informació sobre la cerca i el filtratge.
de: Alle Probleme - auch geschlossene - sollten markiert sein, um mit GitHubs globalen Filtern gefunden werden zu können. Zum Beispiel, `sind dies alle als 'enhancement' markierten Probleme innerhalb von @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Mehr Informationen zu Suche und Filtern findet man in den `GitHub-Hilfeseiten <https://help.github.com/articles/about-searching-on-github/>`__.
es: Todos los problemas - incluso los cerrados - deberían ser etiquetados para permitir el uso del sistema global de filtrado de GitHub. Por ejemplo `estos son todos los asuntos etiquetados 'mejora' en @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22& 8type=>`_. Consulte las `páginas de ayuda de GitHub <https://help.github.com/articles/about-searching-on-github/>`__ para más información sobre búsquedas y filtrado.
nb: Alle feil (selv lukkede) skal merkes for å tillate bruk av GitHubs filtrering. For eksempel er dette `feilrapportene med etiketten 'enhancement' i @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Hendend dem til `GitHub sine hjelpesider <https://help.github.com/articles/about-searching-on-github/>`__ for mer info om søk og filtrering.
pl: Wszystkie problemy - nawet zamknięte - powinny być oznaczone, aby umożliwić korzystanie z globalnego filtrowania GitHub. Na przykład "są to wszystkie problemy oznaczone jako" ulepszenia "w witrynie @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=> `_. Aby uzyskać więcej informacji na temat wyszukiwania i filtrowania, zapoznaj się ze stronami pomocy GitHub <https://help.github.com/articles/about-searching-on-gitub/> `.
ru: Все запросы - даже закрытые - должны маркироваться для корректной работы системы глобальной фильтрации GitHub. Например, `это все запросы, отмеченные как "улучшение" в проектах @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Обратитесь к `справочным страницам GitHub <https://help.github.com/articles/about-searching-on-github/> `_ для получения дополнительной информации о поиске и фильтрации.
sq: Të gjitha çështjet, duke përfshirë ato të mbyllura, duhet të shënohen për t'u gjetur duke përdorur filtrat globale të GitHub. Për shembull, "të gjitha këto janë çështje të" zgjerimit "të shënuara brenda @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature _ + kërkesa% 22 & type => `. Më shumë informacion mbi kërkimin dhe filtrimin mund të gjenden në faqet e ndihmës "GitHub" <https://help.github.com/articles/about-searching-on-github/> `__.
tr: Tüm sorunlar - hatta kapalı olanlar - GitHub'un genel filtrelemesinin kullanılmasına izin vermek için etiketlenmelidir. Örneğin, `Bunların hepsi içinde 'geliştirme' etiketli konular @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_. Şunlara Danışın: `GitHub yardım sayfaları <https://help.github.com/articles/about-searching-on-github/>`__ arama ve filtreleme hakkında daha fazla bilgi için...
zh_hans: 所有问题 - 甚至是已关闭的问题 - 都应该贴上标签以使用 GitHub 的全局过滤功能。比如 `这些都是 @ubports 内部标记为“增强功能”的所有问题<https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>`_。有关搜索和过滤的更多信息，请参阅 `GitHub 帮助页面 <https://help.github.com/articles/about-searching-on-github/>`__ 以获取更多信息。
zh_hant: 所有問題 -即使是封閉的問題- 都應標示，允許使用 GitHub 的全域過濾。例如: "這些都是所有的問題標示為 "增強" 裡 @ubports <https://github.com/search?utf8=%E2%9C%93&q=is%3Aopen+org%3Aubports+label%3A%22feature+request%22&type=>"_。請參閱 "GitHub 說明頁面"<https://help.github.com/articles/about-searching-on-github/>"_有關搜尋和篩選的詳細資訊。

source: Here's a list of labels that are normally used by all repositories.
ca: Aquí hi ha una llista d'etiquetes que s'usen en general a tots els repositoris.
de: Hier ist eine Liste von Markierungen, die normalerweise in allen Repositories genutzt werden.
es: Aquí tiene una lista de las etiquetas que usan normalmente todos los repositorios.
nb: Her er en liste over etiketter som normalt brukes av alle arkiver.
pl: Oto lista etykiet, które są normalnie używane przez wszystkie repozytoria.
ru: Ниже приводится список меток, которые обычно используются во всех репозиториях.
sq: Këtu është një listë e shënusve që normalisht përdoren në të gjitha depo.
tr: İşte normalde tüm depolar tarafından kullanılan etiketlerin listesi.
zh_hans: 这里是存储库通常使用的标签列表。
zh_hant: 下面是通常由所有存儲庫使用的標示清單。

source: **needs confirmation**: The bug needs confirmation and / or further information from affected users
ca: **needs confirmation**: Cal confirmació - A l'error li cal confirmació i / o més informació dels usuaris afectats
de: **needs confirmation**: Der Fehler benötigt Bestätigung und / oder weitere Informationen von betroffenen Nutzern
es: **necesita confirmación**: el error necesita confirmación y/o mas información de los usuarios afectados
nb: **trenger bekreftelse**: Feilen trenger bekreftelse og / eller ytterligere informasjon fra berørte brukere
pl: **Wymagane potwierdzenie**: Błąd wymaga potwierdzenia i/lub dalszych informacji od użytkowników, których dotyczy problem
ru: **needs confirmation** - **требуется подтверждение**: ошибка требует подтверждения или дополнительной информации от пользователей
sq: ** ka nevojë për konfirmim **: Gabimi kërkon konfirmim dhe / ose informacione të tjera nga përdoruesit e prekur
tr: **teyit gerekiyor**: Hata, etkilenen kullanıcılardan onay ve / veya daha fazla bilgiye ihtiyaç duyuyor
zh_hans: **needs confirmation**：这个 bug 需要受影响用户的确认和进一步提供信息
zh_hant: **需要確認** ：該錯誤需要受影響使用者的確認和/或進一步資訊

source: **bug**: This issue is a confirmed bug. If it's reproducible, reproduction steps are described.
nb: **feil**: Dette problemet er en bekreftet feil. Hvis det er reproduserbart, blir reproduksjonstrinn beskrevet.
pl: **błąd**: ten problem jest potwierdzonym błędem. Jeśli jest odtwarzalny, opisane są kroki reprodukcji.
ru: **bug** - ** ошибка **: этот баг подтверждён. Если его можно воспроизвести, приводится информация о том, как это сделать.
zh_hans: **bug**：这个问题已确认。如果它是可重现的，请描述再现步骤。
zh_hant: **錯誤** ：此問題是已確認的錯誤。如果它是可重現的，複製步驟描述。

source: **opinion**: This issue needs further discussion.
ca: **opinion**: Opinió - Cal més discussió per a aquest problema.
de: **opinion**: Dieses Problem benötigt weitere Diskussion.
es: **opinión**: este problema necesita más discusión.
nb: **mening**: Denne saken trenger ytterligere diskusjon.
pl: **opinia**: Ta kwestia wymaga dalszej dyskusji.
ru: **opinion** - ** мнение **: вопрос требует дальнейшего обсуждения.
sq: ** opinion **: Ky problem ka nevojë për diskutim të mëtejshëm.
tr: **görüş**: Bu konu daha fazla tartışmaya ihtiyaç duyuyor.
zh_hans: **opinion**：这个问题需要进一步讨论。
zh_hant: **意見** ：這個問題需要進一步討論。

source: **enhancement**: This issue is a feature request.
ca: **enhancement**: Millora - Aquest problema és una demanda de funcionalitat.
de: **enhancement**: Bei diesem Problem handelt es sich um eine Funktionalitätsanfrage.
es: **mejora**: este asunto es una solicitud de función.
nb: **forbedring**: Dette problemet er en funksjonsforespørsel.
pl: **ulepszenie**: ten problem jest żądaniem funkcji.
ru: **enhancement** -**улучшение **: это запрос функции.
sq: **enhancement**: Kjo çështje është një kërkesë funksionaliteti.
tr: **geliştirme**: Bu sorun bir özellik isteğidir.
zh_hans: **enhancement**：这个问题是功能请求。
zh_hant: **增強** ：此問題是功能請求。

source: **question**: This issue is a support request or general question.
ca: **question**: Pregunta - Aquest problema és una demanda de suport o una pregunta general.
de: **question**: Dieses Problem ist eine Unterstützungsanfrage oder eine allgemeine Frage.
es: **pregunta**: este problema es una solicitud de soporte o una pregunta general.
nb: **spørsmål**: Dette problemet er en støtteforespørsel eller et generelt spørsmål.
pl: **pytanie**: ten problem to prośba o pomoc lub pytanie ogólne.
ru: **question** - **вопрос**: запрос в службу поддержки или общий вопрос.
sq: **question**: Ky problem është një kërkesë mbështetëse ose një pyetje e përgjithshme.
tr: **soru**: Bu sorun bir destek isteği veya genel bir soru.
zh_hans: **question**：这个问题是一个支持请求或一般问题。
zh_hant: **問題** ：此問題是支援請求或一般問題。

source: **invalid**: This issue can not be confirmed or was reported in the wrong tracker.
ca: **invalid*: No vàlid - Aquest problema no es pot confirmar o s'ha informat en el seguidor incorrecte.
de: **invalid**: Dieses Problem kann nicht bestätigt werden oder wurde im falschen Tracker gemeldet.
es: **inválido**: este problema no puede confirmarse o fue comunicado en el lugar equivocado.
nb: **ugyldig**: Dette problemet kan ikke bekreftes eller ble rapportert i feil tracker.
pl: **nieprawidłowy**: problemu nie można potwierdzić lub został zgłoszony w złym trackerze.
ru: **invalid** - **недействительно**: проблема не подтверждается или о ней сообщается на баг-трекере другого проекта.
sq: **invalid**:Kjo çështje nuk mund të konfirmohet ose të raportohet në gjurmuesin e gabuar.
tr: **geçersiz**: Bu sorun doğrulanamıyor veya yanlış izleyici tarafından bildirildi.
zh_hans: **invalid**：这个问题无法得到确认或是在错误的跟踪器中报告的。
zh_hant: **無效** ：此問題無法確認或無法在錯誤追蹤器中報告。

source: **duplicate**: This has already been reported somewhere else. Please provide a link and close.
ca: **duplicate**: Duplicat - Això ja se ha informat en algun altre lloc. Si us plau proveïu un enllaç i tanqueu-lo.
de: **duplicate**: Dies wurde bereits woanders gemeldet. Bitte einen Link einfügen und schließen.
es: **duplicado**: ya ha sido comunicado en algún otro lugar. Por favor proporcione un enlace y ciérrelo.
nb: **duplikat**: Dette er allerede rapportert et annet sted. Vennligst oppgi en lenke og lukk.
pl: **duplikat**: Zostało to już zgłoszone w innym miejscu. Podaj link i zamknij.
ru: **duplicate** - **повтор**: об этой проблеме уже сообщалось ранее. Пожалуйста, укажите ссылку на старый запрос и закройте этот.
sq: **duplicate**: Kjo tashmë është raportuar diku tjetër. Jepni një lidhje dhe mbyllni.
tr: **çoğaltıldı**: Bu daha önce başka bir yerde bildirildi. Lütfen bir bağlantı sağlayın ve kapatın.
zh_hans: **help wanted**：这个问题已经被报告。请提供链接并关闭。
zh_hant: **重複** ：這已經在其他地方報告過，請提供連結並關閉。

source: **help wanted**: This issue is ready to be picked up by a community developer.
ca: **help wanted**: Es demana ajuda - Aquest problema ja està preparat perquè algun desenvolupador de la comunitat l'agafi.
de: **help wanted**: Dieses Problem wartet darauf, durch einen Entwickler aus der Gemeinschaft übernommen zu werden.
es: **se busca ayuda**: este problema está listo para ser escogido por un desarrollador de la comunidad.
nb: **hjelp ønsket**: Dette problemet er klart til å bli plukket opp av en utvikler.
pl: **potrzebna pomoc**: ten problem jest gotowy do odebrania przez twórcę społeczności.
ru: **help wanted** - **требуется помощь**: для решения проблемы требуется помощь сообщества.
sq: **help wanted**: Kjo çështje po pret të merret nga një zhvillues i komunitetit.
tr: **yardım isteniyor**: Bu sorun bir topluluk geliştiricisi tarafından alınmaya hazır.
zh_hans: **help wanted**：这个问题已经准备好由社区开发者提供帮助。
zh_hant: **需要幫助** ：此問題已準備好由社區開發人員拿起。

source: **good first issue**: The report contains instructions or hints required to fix it. It is an excellent place for someone new to learn about the project by fixing a real issue.
nb: **god første utgave**: Rapporten inneholder instruksjoner eller tips som kreves for å fikse den. Det er et utmerket sted for noen nye å lære om prosjektet ved å fikse et reelt problem.
pl: **good first issue**: raport zawiera instrukcje lub wskazówki potrzebne do rozwiązania tego problemu. Jest to doskonałe miejsce dla kogoś nowego, aby dowiedzieć się o projekcie, rozwiązując prawdziwy problem.

source: **wontfix**: It does not make sense to fix this bug, since it will probably resolve itself, it will be too much work to fix it, it's not fixable, or an underlying component will soon change.
ca: **wontfix**: No s'arreglarà - No té sentit arreglar aquest error, atès que probablement s'arreglarà per sí mateix, implicaria molta feina arreglar-lo, no es pot arreglar, o algun component subjacent canviarà aviat.
de: **wontfix**: Es ergibt keinen Sinn diesen Fehler zu beheben, weil er sich von selbst erledigen wird, weil es zu viel Arbeit machen würden, weil er nicht behebbar ist oder eine zugrunde liegende Komponente sich bald ändert.
es: **nosearreglará**: no tiene sentido arreglar este problema ya que probablemente se arreglará solo, será demasiado trabajo arreglarlo, no tiene arreglo, o un componente subyacente cambiará pronto.
nb: **wontfix**: Det er ikke fornuftig å fikse denne feilen, siden den sannsynligvis vil løse seg selv, det vil være for mye arbeid å fikse den, den kan ikke repareres, eller en underliggende komponent vil snart endres.
pl: **wontfix**: Naprawienie tego błędu nie ma sensu, ponieważ prawdopodobnie sam się rozwiąże, będzie to zbyt dużo pracy, aby go naprawić, nie da się go naprawić, lub wkrótce zmieni się element bazowy.
ru: **wontfix** -**неисправляемо**: исправлять эту ошибку не имеет смысла. Скорее всего, она уйдет сама по себе, или для её исправления требуется много работы, или скоро изменится содержащий её программный компонент.
sq: **wontfix**: Nuk ka kuptim të ndreqim këtë gabim sepse do ta bëjë vetë, sepse do të bënte shumë punë sepse nuk mund të përmirësohej ose një komponent themelor do të ndryshonte së shpejti.
tr: **fixlenemez**: Bu hatayı düzeltmek mantıklı değil, çünkü muhtemelen kendisini çözecek, düzeltmek için çok fazla iş olacak, düzeltilebilir değil ya da altta yatan bir bileşen yakında değişecektir.
zh_hans: **wontfix**： 这个问题没有修复的意义，因为它要么可能会被自行解决、要么需要太多精力、要么不可修复，或者因底层组件即将改变而不需要修复。
zh_hant: **不修復** ：修復此錯誤沒有意義，因為它可能會自行解決，修復它將是太多的工作，它不是可修復的，或者基礎元件很快就會更改。

source: Additional special labels can be defined. As an example, here's the labels used in the Ubuntu Touch tracker:
ca: Es poden definir etiquetes addicionals especials. Com a exemple, aquí hi ha les etiquetes usades al seguidor de l'Ubuntu Touch:
de: Zusätzlich können weitere Markierungen definiert werden. Zum Beispiel hier die Markierungen, die im Ubuntu Touch Tracker genutzt werden:
es: Se pueden definir etiquetas especiales adicionales. Como ejemplo, aquí están las etiquetas utilizadas en el seguidor de Ubuntu Touch:
nb: Ytterligere spesialmerker kan defineres. Som et eksempel, her er etikettene som brukes i Ubuntu Touch-trackeren:
pl: Można zdefiniować dodatkowe etykiety specjalne. Oto przykład etykiet używanych w module do śledzenia Ubuntu Touch:
ru: Могут использоваться и дополнительные метки. Например, вот такие метки используются в баг-трекере Ubuntu Touch:
sq: Përveç kësaj, mund të përcaktohen edhe shënime të mëtejshme. Për shembull, këtu janë shënuesit që përdoren në Ubuntu Touch Tracker:
tr: İlave özel etiketler tanımlanabilir. Örnek olarak, Ubuntu Touch Tracker'de kullanılan etiketler aşağıda belirtilmiştir:
zh_hans: 流程定义仍在进行中，它需要由各个团队来完成：
zh_hant: 可以定義其他特殊標示。例如:以下是 Ubuntu Touch 追蹤器中使用的標示:

source: **critical (devel)**: This critical issue that only occurs on the devel channel is blocking the release of the next rc image.
ca: **critical (devel)**: Crític (desenvolupament) - Aquest problema crític que sols apareix al canal de desenvolupament està blocant l'alliberament de la pròxima imatge de versió candidata.
de: **critical (devel)**: Dieses kritische Problem, das nur auf dem Entwicklungskanal auftritt, blockiert die Veröffentlichung des nächsten rc-Abbilds.
es: **crítico (desarrollo)**: este problema crítico que solo ocurre en el canal desarrollo está bloqueando la publicación de la siguiente imagen de la versión candidata.
nb: **kritisk (utvikling)**: Dette kritiske problemet som bare oppstår på utviklingskanalen, blokkerer utgivelsen av neste RC-avtrykk.
pl: **krytyczny (devel)**: To problem krytyczny, który występuje tylko w kanale devel, blokuje wydawanie następnego obrazu rc.
ru: **critical (devel)**: критическая ошибка, которая возникает только на канале разработчиков и блокирует выпуск следующего образа на ветке rc.
sq: **critical (devel)**:Kjo çështje kritike që ndodh vetëm në kanalin e zhvillimit, po bllokon lirimin e imazhit të ardhshëm -rc.
tr: **critical (devel)**: Sadece devel kanalında oluşan bu kritik konu bir sonraki rc görüntüsünün yayınını engelliyor.
zh_hans: ** critical（devel）**：这个严重的问题只在``devel通道上阻塞了下一个rc图像的发布``这一情况中发生。
zh_hant: **關鍵 (開發) ** ：僅在 Devel 通道上發生的這一關鍵問題阻礙了下一個最終測試 (RC) 映像的釋放。
