Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: Introduction
ca: Introducció
de: Einleitung
es: Introducción
nb: Introduksjon
pl: Wprowadzenie
ru: Введение
sq: Paraqitje
tr: Başlangıç
zh_hans: 介绍
zh_hant: 介紹

source: This is the documentation for the UBports project. Our goal is to create a Free and open-source (GPL if possible) mobile operating system that converges and respects your freedom.
nb: Dette er dokumentasjonen for UBports-prosjektet. Målet vårt er å lage et gratis operativsystem med åpen kildekode (GPL hvis mulig) som konvergerer og respekterer din frihet.
pl: To jest dokumentacja projektu UBports. Naszym celem jest stworzenie bezpłatnego i otwartego mobilnego systemu operacyjnego typu open source (jeśli to możliwe - GPL) , który łączy i szanuje Twoją wolność.
ru: Это документация для проекта UBports. Наша цель - создать бесплатную мобильную операционную систему с открытым исходным кодом и распространяющуюся по лицензии GPL. Наша система с уважением относится к вопросам безопасности и конфиденциальности пользователей.

source: About UBports
ca: Quant al UBports
de: Über UBports
es: Sobre UBports
nb: Om UBports
pl: O UBports
ru: О UBports
sq: Rreth UBports
tr: UBports Hakkında
zh_hans: 关于 UBports
zh_hant: 關於 UBports

source: The UBports project was founded by Marius Gripsgard in 2015 and in its infancy was a place where developers could share ideas and educate each other in hopes of bringing the Ubuntu Touch platform to more mobile devices.
nb: UBports-prosjektet ble grunnlagt av Marius Gripsgard i 2015 og var i sin barndom et sted der utviklere kunne dele ideer og utdanne hverandre i håp om å bringe Ubuntu Touch-plattformen til flere mobilenheter.
pl: Projekt UBports został założony przez Mariusa Gripsgarda w 2015 roku i było to miejsce, w którym programiści mogli dzielić się pomysłami i edukować się nawzajem w nadziei na przeniesienie platformy Ubuntu Touch na więcej urządzeń mobilnych.
ru: Проект UBports был основан Мариусом Грипсгардом в 2015 году. В то время разработчики могли обмениваться идеями и обучать друг друга в надежде портировать операционную систему Ubuntu Touch на большее количество мобильных устройств.

source: After Canonical suddenly announced `their plans to terminate support of Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_ in April 2017, UBports and its sister projects began work on the open-source code, maintaining and expanding its possibilities for the future.
nb: Etter at Canonical plutselig kunngjorde `deres planer om å avslutte støtten til Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and- konvergens />`_ i april 2017 begynte UBports og dets søsterprosjekter å jobbe med åpen kildekode, vedlikeholde og utvide mulighetene for fremtiden.
pl: Po tym, jak firma Canonical nagle ogłosiła `swoje plany zakończenia wsparcia Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence />`_ w kwietniu 2017 roku UBports i jego siostrzane projekty rozpoczęły pracę nad kodem open source, utrzymując i rozszerzając jego możliwości na przyszłość.
ru: После того, как в апреле 2017 года компания Canonical внезапно `объявила о своих планах прекратить поддержку Ubuntu Touch <https://insights.ubuntu.com/2017/04/05/growing-ubuntu-for-cloud-and-iot-rather-than-phone-and-convergence/>`_, сообщество UBports и входящие в него группы разработчиков начали работу над открытыми исходными кодами системы, поддержкой пакетов и новыми перспективными опциями.

source: About the Documentation
ca: Quant a la documentació
de: Über die Dokumentation
es: Sobre la documentación
nb: Om Dokumentasjonen
pl: O dokumentacji
ru: О документации
sq: Rreth dokumentacionit
tr: Döküman Hakkında
zh_hans: 关于本文档
zh_hant: 關於文檔

source: This documentation is always improving thanks to the members of the UBports community. It is written in ReStructuredText and converted into this readable form by `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, and `Read the Docs <https://readthedocs.io>`_. You can start contributing by checking out the :doc:`Documentation contribution document </contribute/documentation>`.
nb: Denne dokumentasjonen forbedres alltid takket være medlemmene i UBports-samfunnet. Den er skrevet i ReStructuredText og konvertert til denne lesbare formen av `Sphinx <http://www.sphinx-doc.org/en/stable/>` _, `ReCommonMark <http://recommonmark.readthedocs.io/en/ latest />`_ og`Read the Docs <https://readthedocs.io>`_. Du kan begynne å bidra ved å sjekke ut: doc: `Dokumentasjonsbidragsdokumentet </contribute/documentation>`.
pl: Ta dokumentacja jest zawsze ulepszana dzięki członkom społeczności UBports. Jest napisany w ReStructuredText i przekonwertowany na tę czytelną formę przez `Sphinx <http://www.sphinx-doc.org/en/stable/>` _, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/> `_ i` Przeczytaj dokumentację <https://readthedocs.io> `_. Możesz zacząć współtworzyć, sprawdzając: doc: `Dokument udziału w dokumentacji </contribute/documentation>`.
ru: Эти инструкции и документы постоянно исправляются и дополняются благодаря работе сообщества UBports. Текст написан в ReStructuredText и переведён в читаемый вид с помощью приложений `Sphinx <http://www.sphinx-doc.org/en/stable/>`_, `ReCommonMark <http://recommonmark.readthedocs.io/en/latest/>`_, и `Read the Docs <https://readthedocs.io>`_. Вы можете проверить и дополнить любой раздел документации :doc:`Documentation contribution document </contribute/documentation>`.

source: All documents are licensed under the Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_) license. Please give attribution to "The UBports Community".
ca: Tots els documents tenen la llicència Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`). Si us plau feu l'atribució de crèdit a «The UBports Community».
de: Alle Dokumente stehen unter der Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_) Lizenz. Als Urheber ist "Die UBports-Gemeinschaft" anzugeben.
es: Todos los documentos están bajo la licencia Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Atribuya el crédito a "The UBports Community".
nb: Alle dokumenter er lisensiert under Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>` _) lisens. Gi heder til "The UBports Community".
pl: Wszystkie dokumenty są licencjonowane na podstawie licencji Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Podaj nazwę "The UBports Community".
ru: Все документы доступны по лицензии Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_). Пожалуйста, оставляйте ссылку на "Сообщество UBports".
sq: Të gjitha dokumentet janë nën licencën Creative Commons Attribution ShareAlike 4.0 (licenca "CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/> _). Autori duhet të jetë "Komuniteti i UBports".
tr: Tüm belgeler, Creative Commons Attribution ShareAlike 4.0 (`CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`_) lisanslıdır. Lütfen "UBports Topluluğu"na atıfta bulunun.
zh_hans: 所有文件均根据知识共享署名相同方式共享4.0 (CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/> `_) 许可证。请给予“UBports 社区”的署名。
zh_hant: 所有文件均根據 Creative Commons Attribution ShareAlike 4.0 獲得許可執照 ("CC-BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>"_) 。 請將歸屬於 “UBports 社區”。

source: Attribution
ca: Atribució
de: Zurechnung
es: Atribución
nb: Heder
pl: Zakres
ru: Первоисточники
sq: Përfshirje
tr: İçerme
zh_hans: 归属
zh_hant: 屬性

source: This documentation was heavily modeled after the `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, attribution to Juan Linietsky, Ariel Manzur and the Godot community.
ca: Aquesta documentació segueix molt properament el model `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, atribució a Juan Linietsky, Ariel Manzur i la comunitat Godot.
de: Diese Dokumentation wurde stark an die `Godot Engine-Dokumentation <http://docs.godotengine.org/en/stable/>`_ angelehnt, welche Juan Linietsky, Ariel Manzur und der Godot-Gemeinschaft zuzurechnen ist.
es: Esta documentación ha sido intensamente modelada siguiendo la `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>`_, atribución del crédito a Juan Linietsky, Ariel Manzur y la comunidad Godot.
nb: Denne dokumentasjonen ble sterkt modellert etter `Godot Engine's Documentation <http://docs.godotengine.org/en/stable/>` _, heder til Juan Linietsky, Ariel Manzur og Godot-samfunnet.
pl: Ta dokumentacja została silnie wzorowana na "Godot Engine's Documentation" (http://docs.godotengine.org/en/stable/> `_, atrybucja do Jana Linietsky'ego, Ariela Manzura i społeczności Godot.
ru: Эта документация в значительной степени написана по мотивам `Документации Godot Engine <http://docs.godotengine.org/en/stable/>`_, созданной благодаря Хуану Линецкому, Ариэлю Манзуру и сообществу Godot.
sq: Ky dokumentacion është frymëzuar fuqishëm nga 'Documentation Engine Engine <http://docs.godotengine.org/en/stable/> `, që i atribuohet Juan Linietsky, Ariel Manzur dhe komunitetit Godot.
tr: Bu dokümantasyon, `Godot Motoru Dökümanları <http://docs.godotengine.org/en/stable/>`_, dan sonra yoğun bir şekilde modellendi.
zh_hans: 本文档高度依赖 `Godot Engine’s Documentation <http://docs.godotengine.org/en/stable/>`_ 建模，归属于 Juan Linietsky, Ariel Manzur 和 Godot 社区。
zh_hant: 這些文檔在很大程度上是參照 "Godot 引擎" 的文檔 <http://docs.godotengine.org/en/stable/>"_，歸屬於 Juan Linietsky，Ariel Manzur 和 Godot 社區。

source: Branch-naming convention
nb: Navnesystem for forgreninger
pl: Konwencja nazewnictwa gałęzi
ru: Соглашение о названиях веток разработки
sq: Konventa e emërtimit të degës
zh_hans: 文件命名规则
zh_hant: 分支命名規定

source: Our branch-naming conventions ensure that software can be built by our CI and tested easily by other developers.
nb: Navngivningen av forgreningene forsikrer at programvare enkelt kan bygges av vårt KI, og testes av andre utviklere.
pl: Nasze konwencje nazewnictwa gałęzi zapewniają, że oprogramowanie może być budowane przez nasz CI i testowane z łatwością przez innych programistów.
ru: Наши соглашения о названиях веток разработки гарантируют, что программное обеспечение создается по технологии непрерывной интеграции (CI) и может быть легко протестировано другими разработчиками.
sq: Konventat tona të emërtimit të degës sigurojnë që softueri mund të ndërtohet nga CI tonë dhe modifikohet lehtësisht nga zhvilluesit e tjerë.
zh_hans: 我们的约定好分支命名的规则以确保我们的CI可以构建软件并由其他开发人员轻松测试。
zh_hant: 我們的分支命名規定是確保軟體可以由我們的 CI 構建，並可由其他開發人員輕鬆進行測試。

source: Every Git repository's README file should state which branch-naming convention is used and possible deviations from the norm.
nb: README-filen i hvert Git-kodelager skal inneholde info om hvilket forgreningsnavnesystem som er i bruk, og mulige avvik fra normen.
pl: Każdy plik README repozytorium Git powinien określać konwencję nazewnictwa gałęzi i możliwe odchylenia od normy.
ru: В файле README каждого репозитория Git должно быть указано, какое соглашение об именах ветвей используется, и возможные отклонения от нормы.
sq: Çdo skedar README i depos Git duhet të deklarojë se cili konventë e emërtimit të degëve është përdorur dhe devijime të mundshme nga norma.
zh_hans: 每个Git存储库的README文件都应该说明使用哪个分支命名约定以及可能与规范的偏差。
zh_hant: 每個 Git 存儲庫的 README 檔都應說明使用了哪些分支命名規定以及可能與規範偏離。

source: Click-Packages
nb: Klikk-pakker
pl: Pakiety Click
ru: Click-Пакеты
sq: Kliko Paketat
zh_hans: 一键安装包
zh_hant: Click-套件

source: Software that is exclusively distributed as a click-package (and not also as a deb) only uses one ``master`` branch that is protected. Separate temporary development branches with arbitrary descriptive names can be created and merged into master when the time comes. For marking and archiving milestones in development history, ideally Git tags or GitHub releases should be used.
pl: Oprogramowanie, które jest dystrybuowane wyłącznie jako pakiet click (a nie także jako deb), używa tylko jednej gałęzi "master", która jest chroniona. Oddzielne tymczasowe gałęzie rozwojowe o arbitralnych nazwach opisowych mogą być tworzone i scalane z wzorcem, gdy nadejdzie czas. Do oznaczania i archiwizacji kamieni milowych w historii rozwoju, najlepiej użyć tagów Git lub GitHub.
ru: Программное обеспечение, которое распространяется исключительно в виде click-пакета (а не как deb), использует только одну защищенную ветку `` master``. Отдельные временные ветки разработки с произвольными описательными именами могут быть созданы и объединены в master, когда придет время. Для маркировки и архивирования вех в истории разработки в идеале следует использовать теги Git или релизы GitHub.
sq: Software që shpërndahet ekskluzivisht si një paketë klikoni (dhe jo si deb) përdor vetëm një degë `` master`` që është e mbrojtur. Degët e përkohshme të zhvillimit me emra përshkrues arbitrarë mund të krijohen dhe bashkohen në mjeshtra kur të vijë koha. Për shënimin dhe arkivimin e pikave historike në historinë e zhvillimit, idealisht Git tags ose GitHub lëshime duhet të përdoren.
zh_hans: 专门作为 click-package（而不是deb）分发的软件只使用一个受保护的``master``分支。 可以创建具有任意描述性名称的单独临时开发分支，并及时合并到master分支中。为了标记和归档在开发历史记录中的重要阶段性数据，最好使用Git的tags功能或GitHub 的 releases页面。
zh_hant: 專門作為 click-套件 (也作為 deb) 分發的軟體只使用一個受保護的 "master" 分支。可以創建具有任意描述性名稱的單獨臨時開發分支，並在時機成熟時合併為 master。對於開發歷史中的標記和存檔里程碑，最好使用 Git 標記或 GitHub 版本。

source: Deb-Packages
nb: Deb-Pakker
pl: Pakiety deb
ru: Deb-Пакеты
sq: Paketa Deb
zh_hans: Debian 软件包
zh_hant: Deb-套件

source: To make most efficient use of our CI system, a special naming convention for git-branches is used.
pl: Aby jak najlepiej wykorzystać nasz system CI, stosowana jest specjalna konwencja nazewnictwa dla gałęzi git.
ru: Для наиболее эффективного использования нашей системы CI используется специальное соглашение по именованию для git-веток.
sq: Për të bërë përdorimin më efikas të sistemit tonë CI, përdoret një konventë e veçantë emërtimi për git-degët.
zh_hans: 为了最有效地使用我们的CI系统，我们使用了一个特殊的git-分支命名规则。
zh_hant: 為了最有效地利用我們的 CI 系統，使用了專門的決策分支命名規定。

source: For pre-installed Ubuntu Touch components, deb-packages are used wherever possible. This includes Core Apps, since they can still be independently updated using click-package downloads from the OpenStore. This policy allows us to make use of the powerful Debian build system to resolve dependencies.
pl: W przypadku wstępnie zainstalowanych składników Ubuntu Touch, pakiety deb są używane wszędzie tam, gdzie to możliwe. Obejmuje to aplikacje podstawowe, ponieważ nadal mogą być niezależnie aktualizowane przy użyciu pakietów click z OpenStore. Ta zasada pozwala nam wykorzystać potężny system kompilacji Debiana do rozwiązywania zależności.
ru: Для предустановленных компонентов Ubuntu Touch, deb-пакеты используются везде, где это возможно. Это включает в себя основные приложения, так как они все еще могут быть независимо обновлены с помощью загрузки пакетов из OpenStore. Эта политика позволяет нам использовать мощную систему сборки Debian для устранения зависимостей.
sq: Për komponentët e instaluar paraprakisht të Ubuntu Touch, paketa deb janë përdorur kudo që është e mundur. Kjo përfshin Apps Core, pasi ato mund të shkarkohen nga OpenStore. Kjo politikë na lejon të krijojmë sistemin e Debianit për të zgjidhur varësitë.
zh_hans: 对于预先安装的Ubuntu Touch组件，尽可能使用deb包。 这包括核心应用程序，因为它们仍然可以使用OpenStore的点击包下载进行独立更新。 这个策略允许我们利用强大的Debian构建系统来解决依赖关系。
zh_hant: 對於預先安裝的 Ubuntu Touch 元件，只要有可能，就會使用 deb-套件。這包括核心應用，因為它們仍然可以使用 OpenStore 的 click-套件下載獨立更新。此策略允許我們利用強大的 Debian 構建系統來解決依賴關係。

source: Every repository that uses this convention will have branches for the actively supported Ubuntu releases referenced by their codenames (``bionic``, ``xenial``, ``vivid``, etc.). These are the branches that are built directly into the corresponding images and published on :doc:`repo.ubports.com <ppa>`. If no separate versions for the different Ubuntu bases are needed, the repository will just have one ``master`` branch and the CI system will still build versions for all actively supported releases and resolve dependencies accordingly.
pl: Każde repozytorium korzystające z tej konwencji będzie miało gałęzie dla aktywnie wspieranych wydań Ubuntu, do których odwołują się ich nazwy kodowe (`` bionic``, `` xenial``, `` vivid`` itd.). Są to gałęzie, które są wbudowane bezpośrednio w odpowiednie obrazy i opublikowane na: doc: `repo.ubports.com <ppa>`. Jeśli nie są potrzebne oddzielne wersje dla różnych baz Ubuntu, repozytorium będzie miało tylko jedną gałąź `` master``, a system CI nadal będzie budował wersje dla wszystkich aktywnie obsługiwanych wersji i odpowiednio rozwiązuje zależności.
ru: Каждый репозиторий, организованный по этому принципу, будет иметь свою ветку, активно поддерживаемую соответствующими версиями Ubuntu (``bionic``, ``xenial``, ``vivid``, и так далее). Эти ветки подробно разобраны на картинках в :doc:`repo.ubports.com <ppa>`. Если не требуется отдельных версий для разных дистрибутивов Ubuntu, в репозитории будет размещена только одна ветка ``master``, а система CI будет создавать версии для всех активно поддерживаемых выпусков и соответственно разрешать зависимости.
sq: Lirimet e Ubuntu të referuara nga emrat e kodeve të tyre (`` bionic``, `xenial``,` `të gjalla``, etj). Këto janë degët që janë ndërtuar direkt në imazhe dhe botohen në: doc: `repo.ubports.com <ppa>`. Bazat e Ubuntu nevojiten, depo kërkon vetëm një degë `` master`` dhe sistemi CI dëshiron të ndërtojë versione për versione të ndryshme.
zh_hans: 每个使用这种规定的资料库都会有分支，用于代号（“bionic”，“xenial”，“vivid”等）引用的主动支持的Ubuntu发布版本。这些都是直接构建到相应镜像中并发布在：doc：`repo.ubports.com <ppa>`上的分支。如果不需要用于不同Ubuntu版本的独立版本，版本库将只有一个``master``分支，并且CI系统仍然会为所有主动支持的发布版本构建版本并相应地解决依赖关系。
zh_hant: 使用此約定的每個存儲庫都將有分支, 用於由其代號引用的主動支援的 Ubuntu 版本是由 ("bionic"、"xenial"、"vivid" 等等)。這些分支直接內置到相應的映像中，並在:doc上發佈"repo.ubports.com <ppa>"。如果不需要不同 Ubuntu 庫的單獨版本，存儲庫將只有一個 "master" 分支，CI 系統仍將為所有積極支援的版本生成版本，並相對應地解決依賴關係。

source: Branch-extensions
nb: Forgreningsutvidelser
pl: Rozgałęzienia-rozszerzenia
ru: Расширения для веток
sq: Zgjerime të degës
zh_hans: 分支-扩展
zh_hant: 分支擴展

source: To build and publish packages based on another repository, an extension in the form of ``xenial_-_some-descriptive_extension`` can be used. The CI system will then resolve all dependencies using the ``xenial_-_some-descriptive_extension`` branch of other repositories or fall back on the normal ``xenial`` dependencies, if that doesn't exist. These special dependencies are not built into the image but still pushed to on :doc:`repo.ubports.com <ppa>`.
pl: Aby budować i publikować pakiety na podstawie innego repozytorium, można użyć rozszerzenia w postaci `` xenial _-_ jakieś_opisowe_rozszerzenie``. System CI rozwiąże wszystkie zależności, używając gałęzi `` xenial _-_ jakieś_opisowe_rozszerzenie`` od innych repozytoriów lub powróci do normalnych zależności `` xenial``, jeśli to nie istnieje. Te specjalne zależności nie są wbudowane w obraz, ale nadal są przesyłane dalej: doc: `repo.ubports.com <ppa>`.
ru: Чтобы собирать и публиковать пакеты, основанные на другом репозитории, можно использовать расширение в форме ``xenial_-_some-descriptive_extension``. Система CI потом определит все необходимые файлы зависимостей, используя ветку `xenial_-_some-descriptive_extension` или обратится к стандартным файлам зависимостей ``xenial`, если такой не существует. Эти специальные файлы зависимостей не включаются в пакет с программой, но находятся в :doc:`repo.ubports.com <ppa>`.
sq: Për të ndërtuar dhe publikuar paketa bazuar në një depo tjetër, mund të përdoret shtrirja në formën e "xenial _-_ some-descriptive_extension``. Sistemi CI pastaj do të zgjidhë të gjitha varësitë duke përdorur degën `` xenial _-_ some-descriptive_extension`` të magazinave të tjera ose rasti mbrapa në variacione normale `` xenial``, nëse kjo nuk ekziston. Këto varësi të veçanta nuk janë ndërtuar në imazh, por janë të shtyrë në heshtje në: doc: repo.ubports.com <ppa> `.
zh_hans: 基于另一个存储库构建和发布包，形式为的扩展可以使用``xenial _-_ some-descriptive_extension``。 然后，CI系统将使用其他存储库的``xenial _-_ some-descriptive_extension``分支来解析所有依赖关系，或者如果不存在则回退到正常的``xenial``依赖关系。 这些特殊的依赖项没有内置到图像中，但仍然被推送到on：doc：`repo.ubports.com <ppa>`。
zh_hant: 要構建和發佈基於另一個存儲庫的套件，可以使用 "xenial_-_some-descriptive_extension" 的形式的擴展。然後，CI系統將使用其他存儲庫的 "xenial_-_some-descriptive_extension" 分支來解決所有依賴關係，或者回到正常的 "xenial" 依賴關係上，如果這種依賴關係不存在的話。這些特殊的依賴項不是內置到映像中，而是在 :doc:上推送到: "repo.ubports.com <ppa>"。

source: Multiple branch extensions can be chained together in the form of ``xenial_-_dependency-1_-_dependency-2_-_dependency-3``. This means that the CI system will look for dependencies in the following repositories:
pl: Wiele rozszerzeń gałęzi można połączyć ze sobą w postaci zależności `xenial _-_zależność-1 _-_ zależność-2 _-_ zależność-3``. Oznacza to, że system CI będzie szukać zależności w następujących repozytoriach:
ru: Несколько расширений для ветки можно объединить в цепочку в форме `` xenial _-_ dependency-1 _-_ dependency-2 _-_ dependency-3``. Это значит, что система CI будет искать зависимости в следующих репозиториях:
sq: Zgjerimet e shumëfishta të degëve mund të lidhen me zinxhirë së bashku në formën e varësisë xenial _-_ varësisë-_ _ _ varësisë-2 _-_ varësisë-3``. Kjo do të thotë se sistemi CI dëshiron të kërkojë varësi në depot e mëposhtme:
zh_hans: 多个分支扩展可以以“xenial _-_ dependency-1 _-_ dependency-2 _-_ dependency-3”的形式链接在一起。 这意味着CI系统将会在以下存储库中查找依赖关系：
zh_hant: 多個分支擴展可以以 "xenial_-_dependency-1_-_dependency-2_-_dependency-3" 的形式鏈接在一起。 這意味著 CI 系統將在以下存儲庫中尋找依賴項：

source: There is no prioritization, so the build system will always use the package with the highest version number or the newest build if the version is equal.
nb: Det er ingen prioritering, så byggesystemet vil alltid bruke pakken med det høyeste versjonsnummeret eller den nyeste versjonen hvis versjonen er lik.
pl: Nie ma priorytetu, więc system kompilacji zawsze będzie używał pakietu o najwyższym numerze wersji lub najnowszej wersji, jeśli wersja jest równa.
ru: Приоритетов нет, поэтому система сборки всегда будет использовать пакет с самой свежей версией или самой новой сборкой, если версия равна.
sq: Nuk ka renditje prioritare, prandaj sistemi i ndërtuar do të përdorë gjithmonë paketën me numrin më të fundit të versionit.
zh_hans: 因为没有优先级，构建系统将始终使用版本号最高的软件包或版本相同的最新版本。
zh_hant: 沒有優先順序，因此生成系統將始終使用版本號最新的套件，如果版本相等，則始終使用最新的構建。

source: Dependency-file
pl: Plik zależności
ru: Файл зависимостей
sq: Varësia-dosja
zh_hans: 依赖文件
zh_hant: 依賴檔案
