Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/about.po
Languages: ca, de, es, nb, pl, ru, sq, tr, zh_hans, zh_hant

source: For complex or non-linear dependencies, a ``ubports.depends`` file can be created in the root of the repository to specify additional dependencies. The branch name will be ignored if this file exists.
nb: For komplekse eller ikke-lineære avhengigheter kan en ``ubports.depends`` - fil opprettes i roten i arkivet for å spesifisere flere avhengigheter. Grennavnet blir ignorert hvis denne filen eksisterer.
pl: W przypadku złożonych lub nieliniowych zależności można utworzyć plik `` ubports.depends`` w katalogu głównym repozytorium w celu określenia dodatkowych zależności. Nazwa tego katalogu zostanie zignorowana, jeśli ten plik istnieje.
ru: Для сложных или нелинейных зависимостей в корневой папке репозитория можно создать файл ``ubports.depends`, где следует указать дополнительные файлы зависимостей. Имя ветки будет игнорироваться, если этот файл существует.
sq: Për varësi komplekse ose jo-lineare, një skedar `` ubaces.depends`` mund të krijohet në rrënjën e depos për të përcaktuar varësi shtesë. Emri i degës dëshiron të injorohet nëse ekziston ky skedar.
zh_hans: 对于复杂或非线性的依赖关系，可以在存储库的根目录中创建一个名为``ubports.depends``的文件来指定其他依赖项。 如果此文件存在，则自动忽略分支名称。
zh_hant: 對於複雜或非線性依賴關係，可以在存儲庫的根目錄中創建 "ubports.depends" 檔，以指定其他依賴項。如果此檔存在，則將忽略分支名稱。

source: The ``ubports.depends`` file is an **exclusive list**, so the build system will not resolve dependencies linearly like it does in a branch name! Every dependency has to be listed. You will almost always want to include your base release (i.e. ``xenial``).
nb: Filen ``ubports.depends`` er en **eksklusiv liste**, så byggesystemet vil ikke løse avhengigheter lineært slik det gjør i et filialnavn! Hver avhengighet må oppføres. Du vil nesten alltid ønske å inkludere baseutgivelsen (dvs. ``xenial``).
pl: Plik `ubports.depends`` jest **wyłączną listą**, więc system kompilacji nie rozdzieli zależności tak liniowo jak w nazwie gałęzi! Każda zależność musi być wymieniona. Będziesz prawie zawsze chciał dołączyć swoje podstawowe wydanie (tj. `` Xenial``).
ru: Файл ``ubports.depends` - это **исполнительный лист**, поэтому собранное приложение не будет включать в себя зависимости линейно, как это происходит в имени ветви! Каждая зависимость должна быть указана в этом файле. Вы почти всегда захотите включить в него свой базовый релиз (например, ``xenial``).
sq: Dosja `` ubports.depends`` është ** listë ekskluzive **, kështu që sistemi i ndërtuar nuk i zgjidh varësitë linearisht ashtu siç bën në një emër të degës! Çdo varësi duhet të renditet. Ju pothuajse gjithmonë doni të përfshini lirimin bazë tuaj (p.sh. `` xenial``).
zh_hans: ``ubports.depends``文件是一个**独占列表**，因此构建系统不会像在分支名称中那样线性地解析依赖关系！每个依赖项都必须列出。你几乎总是希望每一个依赖项均包含于你的基本版本中（即``xenial``）。
zh_hant: "ubports.depends" 檔案是一個 ** 獨立清單 **，因此生成系統不會像分支名稱那樣線性地解析依賴關係!必須列出每個依賴項。您幾乎總是希望包括您的基本版本 (即 "xenial")。

source: Processes
ca: Processos
de: Prozesse
es: Procesos
nb: Prosesser
pl: Procesy
ru: Процессы
sq: Procese
tr: Süreçler
zh_hans: 流程
zh_hant: 流程

source: This section of the documentation details standardized processes for different teams.
ca: Aquesta secció de la documentació detalla els processos estandarditzats per a diferents equips.
de: Dieser Abschnitt der Dokumentation beschreibt die standardisierten Prozesse der verschiedenen Teams im Detail.
es: Esta sección de la documentación detalla los procesos estandarizados para los diferentes equipos.
nb: Denne delen av dokumentasjonen beskriver standardiserte prosesser for forskjellige team.
pl: Ta sekcja dokumentacji zawiera standardowe procedury dla różnych zespołów.
ru: Этот раздел документации детально описывает процессы для разных команд разработчиков.
sq: Ky seksion i dokumentacionit përshkruan proceset e standardizuara të ekipeve të ndryshme në detaje.
tr: Dokümantasyonun bu bölümünde, deneyimli ekipler için standartlaştırılmış işlemlerin ayrıntıları verilir.
zh_hans: 这部分文档详细说明了不同团队的标准化流程。
zh_hant: 文檔的這一部分詳細介紹了不同團隊的標準化流程。

source: The process definitions are still a work in progress and need to be completed by the respective teams.
ca: Les definicions dels processos encara són un treball en curs i cal que els diferents equips les completin.
de: Die Prozessdefinitionen sind noch in Arbeit und sollen durch die jeweiligen Teams vervollständigt werden.
es: Las definiciones del proceso son aún un trabajo en marcha y necesitan ser completadas por los equipos respectivos.
nb: Prosessdefinisjonene er fortsatt et pågående arbeid og må fullføres av de respektive lagene.
pl: Definicje procesów wciąż są w toku i muszą zostać uzupełnione przez odpowiednie zespoły.
ru: Разработка и описание процессов все еще находится в стадии разработки и должно быть закончено соответствующими командами разработчиков.
sq: Përkufizimet e procesit janë ende në progres dhe duhet të plotësohen nga ekipet përkatëse.
tr: Süreç tanımları halen devam etmekte olan bir çalışmadır ve ilgili ekipler tarafından tamamlanması gerekir.
zh_hans: 流程定义的工作仍在进行中，需要由各个团队共同完成它。
zh_hant: 流程定義仍在進行中，需要由各團隊完成。

source: Issue-Tracking Guidelines
ca: Guia de seguiment de problemes
de: Richtlinien Problemverfolgung
es: Pautas de seguimiento de problemas
pl: Wskazówki dotyczące śledzenia zgłoszeń
ru: Руководство по отслеживанию багов и работе с ними
sq: Udhëzime për ndjekjen e problemeve
tr: Sorun-İzleme Kuralları
zh_hans: 问题跟踪指南
zh_hant: 問題追蹤指南

source: This document describes the standard process of dealing with new issues in UBports projects. Not to be confused with the :doc:`guide on writing a good bugreport </contribute/bugreporting>`.
ca: Aquest document descriu el procés estàndard per tractar amb problemes nous als projectes de l'UBports. No s'ha de confondre amb la guia :doc:`guia per a l'escriptura d'un bon informe d'error </contribute/bugreporting>`.
de: Dieses Dokument beschreibt den Standardprozess für den Umgang mit neuen Problemen im UBports-Projekt. Nicht zu verwechseln mit der :doc:`Anleitung zum Schreiben von guten Fehlerberichten </contribute/bugreporting>`.
es: Este documento describe el proceso estándar para tratar con nuevos problemas en los proyectos de UBports. No confundir con la :doc:`guía para escribir un buen informe de errores </contribute/bugreporting>`.
nb: Dette dokumentet beskriver standardprosessen for å håndtere nye problemer i UBports-prosjekter. Ikke forveksles med: doc: ``guide om å skrive en god feilrapport </contribute/bugreporting>`.
pl: Ten dokument opisuje standardowy proces radzenia sobie z nowymi problemami w projektach UBports. Nie mylić z: doc: `poradnikiem na temat pisania dobrego zgłoszenia błędów </contribute/bugreporting>`.
ru: В этом документе описывается стандартный процесс работы с новыми багами и ошибками в проектах UBports. Его не следует путать с :doc:`руководством по написанию качественного баг-репорта </contribute/bugreporting>`.
sq: Ky dokument përshkruan procesin standard për trajtimin e problemeve të reja në projektin UBports. Për të mos u hutuar me: doc: `Udhëzues për të shkruar raporte të mira bug '</ contrib / bugreporting>`.
tr: Bu belgede UBports projelerindeki yeni sorunlarla başa çıkma standart süreci açıklanmaktadır. Belgeler Ile karıştırılmamalıdır :doc:`iyi bir bug bildirimi yazma kılavuzu </contribute/bugreporting>`.
zh_hans: 本文档描述了处理UBports项目中新问题的标准流程。请不要与 :doc：`编写好的bug报告指南</贡献/错误报告>` 混淆。
zh_hant: 本文檔描述了處理 UBports 項目中新問題的標準流程。 不要混淆:doc:"編寫好的錯誤報告指南 </contribute/bugreporting>"。

source: Where are bugs tracked?
ca: On se segueixen els errors?
de: Wo werden Fehler verfolgt?
es: ¿Dónde se siguen los errores?
pl: Gdzie są śledzone błędy?
ru: Где отслеживаются ошибки?
sq: Ku janë përndjekur gabimet?
tr: Hatalar nereden takip edilir?
zh_hans: Bug 会在哪里被跟踪？
zh_hant: 跟踪錯誤在哪裡？

source: Since our quality assurance depends heavily on the community, we try to track issues where the user would expect them, instead of separated by repository. This means, that issues of almost all components that are distributed as with the system-image are tracked in the `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`__. An exception of this are click-apps that can be updated independently through the OpenStore.
nb: Siden kvalitetssikringen er avhengig av samfunnet, prøver vi å spore problemer der brukeren forventer dem, i stedet for å skille de fra arkivet. Dette betyr at problemer med nesten alle komponenter som distribueres som med systembildet blir sporet i `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>` __. Et unntak av dette er klikk-apper som kan oppdateres uavhengig gjennom OpenStore.
pl: Ponieważ nasze zapewnienie jakości zależy w dużej mierze od społeczności, staramy się śledzić problemy, w których użytkownik ich oczekuje, zamiast rozdzielać je za pomocą repozytorium. Oznacza to, że problemy z prawie wszystkimi komponentami, które są dystrybuowane tak, jak z obrazem systemowym, są śledzone w `trackerze Ubuntu Touch <https://github.com/ubports/ubuntu-touch>`__. Wyjątkiem są aplikacje click, które można niezależnie aktualizować za pośrednictwem OpenStore.
ru: Так как вопросы качества в значительной степени зависят от сообщества пользователей, мы стараемся отслеживать проблемы там, где их ожидает пользователь, а не в отдельных тестовых репозиториях. Это означает, что ошибки почти всех компонентов, которые распространяются с образом системы, собираются на баг-трекере `Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch>`_. Исключением являются click-приложения, которые обновляются через OpenStore.
zh_hans: 由于我们的质量保证在很大程度上取决于社区，因此我们尝试跟踪用户期望的问题，而不是由存储库分离。 这意味着，几乎所有与系统镜像一起分发的组件的问题都会在 `Ubuntu Touch 跟踪器 <https://github.com/ubports/ubuntu-touch>`__。click-apps 是一个例外，因为它们可以通过 OpenStore 来进行更新。
zh_hant: 由於我們的品質保證 (QA) 有很大程度上需要依賴於社區，我們試圖跟蹤使用者期望它們出現的問題，而不是用存儲庫分隔。這意味著，幾乎所有與系統映象一樣分佈的元件的問題都會在 "Ubuntu Touch 追蹤器 <https://github.com/ubports/ubuntu-touch>"__。這方面的一個例外是可以通過 OpenStore 來獨立更新 Click-應用程式。

source: Most other repositories track issues locally. If you're unsure whether a repository uses its own tracker or not, consult the README.md file. Repositories that don't track issues locally have their bugtracker disabled.
ca: La major part dels altres repositoris fan seguiment local dels problemes. Si no teniu seguretat sobre si un repositori usa el seu propi seguidor o no, consulteu el fitxer README.md. Els repositoris que no fan seguiment local tenen el seu seguidor d'errors inhabilitat.
de: Die meisten anderen Repositories verfolgen ihre Probleme lokal. Falls Sie sich unsicher sind, ob ein Repository einen eigenen Tracker nutzt, schauen Sie in der README.md nach. Bei Repositories, die ihre Probleme nicht lokal verfolgen, ist der Tracker deaktiviert.
es: La mayoría de los otros repositorios siguen los problemas localmente. Si no está seguro de si un repositorio usa su propio seguimiento o no, consulte el archivo README.md. Los repositorios que no siguen los problemas localmente tienen su seguimiento de errores deshabilitado.
nb: De fleste andre arkiver sporer problemer lokalt. Hvis du er usikker på om et arkiv bruker sin egen tracker eller ikke, kan du se README.md-filen. Arkiv som ikke sporer problemer lokalt, har bugtracker deaktivert.
pl: Większość innych repozytoriów śledzi problemy lokalnie. Jeśli nie masz pewności, czy repozytorium używa własnego śledzenia, czy nie, zapoznaj się z plikiem README.md. Repozytoria, które nie śledziły problemów lokalnie, mają wyłączoną funkcję bugtracker.
ru: Большинство других репозиториев следят за ошибками локально. Если у Вас нет уверенности, есть ли у репозитория свой багтрекер или нет, прочитайте соответствующий файл README.md. Багтрекер отключен у репозиториев, которые не следят за ошибками локально.
sq: Shumica e magazinave të tjera i përcjellin problemet e tyre në nivel lokal. Nëse nuk jeni i sigurt nëse një depo përdor ndjekësin e vet, kontrolloni README.md. Për repositories që nuk ndjekin problemet e tyre në nivel lokal, tracker është çaktivizuar.
zh_hans: 大多数其他存储库在本地跟踪问题。 如果您不确定资源库是否使用自己的跟踪器，请查阅README.md文件。 不在本地跟踪问题的存储库禁用了错误跟踪器。
zh_hant: 大多數其他存儲庫在當地追蹤問題。 如果您不確定存儲庫是否使用自己的追蹤器，請查閱 README.md 文件。 不在本地跟踪問題的存儲庫禁用了錯誤追蹤器。

source: This page is mainly about the Ubuntu Touch tracker, but most principles apply to other projects as well.
ca: Aquesta pàgina tracta principalment sobre el seguidor de l'Ubuntu Touch, però la major part de les seves regles és vàlida també per a d'altres projectes.
de: Diese Seite behandelt hauptsächlich den Ubuntu Touch Tracker, aber die meisten Prinzipien sollten auch für andere Projekte gelten.
es: Esta página es principalmente acerca del seguidor de Ubuntu Touch, pero la mayoría de los principios se aplican a los otros proyectos también.
nb: Denne siden handler hovedsakelig om Ubuntu Touch tracker, men de fleste prinsipper gjelder også for andre prosjekter.
pl: Ta strona dotyczy głównie narzędzia do śledzenia systemu Ubuntu Touch, ale większość zasad dotyczy również innych projektów.
ru: Эта страница в основном относится к баг-трекеру Ubuntu Touch, но основные принципы могут быть применены и к другим проектам.
sq: Kjo faqe kryesisht mbulon Ubuntu Touch Tracker, por shumica e parimeve duhet të zbatohen edhe për projekte të tjera.
tr: Bu sayfa esas olarak Ubuntu Touch Tracker ile ilgili, ancak çoğu ilke de diğer projeler için de geçerlidir.
zh_hans: 此页面主要介绍了关于Ubuntu Touch跟踪器的信息，但大多数原则上也适用于其他项目。
zh_hant: 本頁主要介紹 Ubuntu Touch 追蹤器，但大多數原則也適用於其他專案。

source: Practicality beats purity! Exceptions might apply and should be described in the projects README.md file.
ca: El sentit pràctic guanya a la puresa! És possible que hi hagi excepcions i s'haurien de descriure al fitxer README.md del projecte.
de: Zweckmäßigkeit schlägt Reinheit! Wo Ausnahmen gelten, sollten diese in der README.md des Projekts beschrieben sein.
es: ¡La funcionalidad es mejor que la pureza! Pueden haber excepciones y deben ser descritas en el archivo README.md del proyecto.
nb: Praktikalitet slår renhet! Unntak kan gjelde og bør beskrives i prosjektene README.md-filen.
pl: Praktyczność bije czystość! Mogą występować wyjątki i powinny być opisane w pliku README.md projektów.
ru: Практика отличается от теории! Есть исключения из правил, они описываются в файле README.md для каждого проекта.
sq: Saktësia sugjeron pastërtinë! Aty ku përjashtohen përjashtimet, ato duhet të përshkruhen në projektin README.md.
tr: Pratiklik saflığı ve anlaşılabilirliği sağlar! İstisnalar uygulanabilir ve projelerdeki README.md dosyasında tanımlanmalıdır.
zh_hans: 实用性要大于整洁度！例外情况可能适用，应在项目README.md文件中加以说明。
zh_hant: 實用性勝過純潔！ 例外可能適用，應在項目 README.md 文件中描述。

source: GitHub projects
ca: Projectes del GitHub
de: GitHub-Projekte
es: Proyectos de GitHub
nb: GitHub prosjekter
pl: Projekty GitHub
ru: GitHub проекты
sq: GitHub-Projektet
tr: GitHub projeleri
zh_hans: GitHub 项目
zh_hant: GitHub 專案

source: To increase transparency and communication, GitHub projects (Kanban-Boards) are used wherever practical. In case of github.com/ubports/ubuntu-touch, a single project is used for all issues. Projects support filtering by labels, so that only issues that belong to a specific team or affect a specific device can be viewed.
nb: For å øke åpenhet og kommunikasjon brukes GitHub-prosjekter (Kanban-Boards) der det er praktisk. I tilfelle github.com/ubports/ubuntu-touch, brukes et enkelt prosjekt for alle problemer. Prosjekter støtter filtrering etter etiketter, slik at bare problemer som tilhører et bestemt lag eller som påvirker en bestemt enhet, kan vises.
pl: Aby zwiększyć przejrzystość i komunikację, projekty GitHub (Tablice Kanban) są wykorzystywane wszędzie tam, gdzie jest to praktyczne. W przypadku github.com/ubports/ubuntu-touch do wszystkich problemów wykorzystywany jest pojedynczy projekt. Projekty obsługują filtrowanie według etykiet, dzięki czemu można wyświetlić tylko problemy należące do określonego zespołu lub mające wpływ na określone urządzenie.
ru: Для повышения прозрачности и коммуникации везде, где это возможно, используются проекты GitHub (Kanban-Boards) . В случае github.com/ubports/ubuntu-touch для всех вопросов и замечаний используется один проект. Проекты поддерживают фильтрацию по меткам, поэтому можно просматривать только замечания, относящиеся к определенной группе или к конкретному устройству.
zh_hans: 为了增加透明度和交流，GitHub 项目（Kanban-Boards）可以在任何实际情况下使用。在 github.com/ubports/ubuntu-touch 上，所有问题都用于单个项目。项目支持按标签过滤，因此只能查看属于特定团队或影响特定设备的问题。
zh_hant: 為了提高透明度和溝通，在可行的情況下使用 GitHub 專案 (Kanban-Boards)。在 github.com/ubports/ubuntu-touch 的情況下，所有問題都使用一個專案。專案支援按標示進行篩選，因此只能查看屬於特定團隊或影響特定裝置的問題。

source: These are the standard columns:
ca: Aquestes són les columnes estàndard:
de: Diese sind die Standardspalten:
es: Estas son las columnas estándar:
nb: Dette er standardkolonnene:
pl: Są to standardowe kolumny:
ru: Замечания или ошибки разделены на стандартные группы:
sq: Këto janë kolonat standarde:
tr: Bunlar standart sütunlardır:
zh_hans: 以下是标准列：
zh_hant: 這些都是標準列:

source: **None (awaiting triage)**: The issue has been approved by a member of the QA team and is awaiting review from the responsible development team. if the issue is a bug, instructions to reproduce are included in the issue description. if the issue is a feature request, it has passed a primary sanity check by the qa-team but has not yet been accepted by the responsible development-team.
nb: **Ingen (venter på sortering)**: Problemet er godkjent av et medlem av kvalitetskontroll-laget og venter gjennomgang av det ansvarlige utviklingslaget. Hvis problemet er en feil, vel instruks om hvordan problemet kan reproduseres være å finne i beskrivelsen av det. Hvis problemet er en funksjonsforespørsel har det bestått en innledende kontroll utført av kvalitetskontroll-laget, men enda ikke blitt akseptert av det ansvarlige utviklingslaget.
pl: **Brak (oczekiwanie na oznaczenie)**: problem został zatwierdzony przez członka zespołu qa i oczekuje na opinię od odpowiedzialnego zespołu programistycznego. jeśli problem jest błędem, instrukcje dotyczące odtwarzania są zawarte w opisie problemu. jeśli problem jest prośbą o funkcję, przeszedł kontrolę podstawowej kontroli jakości przez zespół qa, ale nie został jeszcze zaakceptowany przez odpowiedzialny zespół ds. rozwoju.
ru: **None (awaiting triage)** - **Нет (ждет обработки)**: проблема была подтверждена членом команды QA и ожидает рассмотрения командой разработчиков. Если проблема является багом, инструкции по ее воспроизведению включаются в описание проблемы. Если проблема связана с запросом на добавление функциональности, то так она прошла первичную проверку отделом QA, но еще не была принята в работу ответственной командой разработчиков.
zh_hans: **None (awaiting triage)**：问题已得到 QA 团队的一名成员批准，正在等待负责的开发团队审查。如果问题是错误，则在问题描述中包含重现说明。如果问题是功能请求，那么它已经通过了 QA 团队的主要检查，但尚未被负责的开发团队所接受。
zh_hant: ** 無 (等待分類)** ：該問題已得到 QA 團隊一名成員的批准，正在等待負責的開發團隊的審查。如果問題是錯誤，則問題說明中包含重現說明。如果問題是功能請求，則它已通過 QA 團隊的主要理智檢查，但尚未被負責的開發團隊接受。

source: **Accepted**: The issue has been accepted by the responsible development-team. If the issue is a bugreport, the team has decided that it should be fixable and accepts the responsibility. If the issue is a feature request, the team thinks it should be implemented as described.
nb: **Akseptert**: Problemet er godtatt av det ansvarlige utviklingslaget. Hvis problemet er en feilrapport, har laget bestemt at det skal være løst og aksepterer ansvaret. Hvis problemet er en funksjonsforespørsel, mener laget at det skal implementeres som beskrevet.
pl: **Zaakceptowany**: problem został zaakceptowany przez odpowiedzialny zespół ds. Rozwoju. Jeśli problem dotyczy zgłoszenia błędu, zespół zdecydował, że powinien on zostać naprawiony i akceptuje odpowiedzialność. Jeśli problem jest prośbą ulepszenie, zespół uważa, że należy go wdrożyć zgodnie z opisem.
ru: **Accepted** - **Принято**: запрос принят командой разработчиков. Если в запросе содержится сообщение об ошибке, то разработчики решили, что баг нужно исправить и взяли его в работу. Если это запрос функции, то считается, что её нужно реализовать согласно описанию.
zh_hans: **Accepted** ：该问题已被其所负责的开发团队接受。 如果问题是错误报告，团队已决定它应该是可修复的并对其负责。 如果这个问题是一个特殊要求，那么团队认为应该按照描述来实施。
zh_hant: **接受** ：負責任的發展團隊已接受這一問題。如果問題是一個錯誤，那回報團隊已經決定它應該是可修復的，並接受責任。如果問題是功能請求，團隊認為應該按照所述方式實現該問題。

source: **In Development**: A patch is in development. Usually means that a developer is assigned to the issue.
ca: **In Development**: En desenvolupament - S'està desenvolupant un pegat. Usualment vol dir que s'ha assignat un desenvolupador al problema.
de: **In Development**: Eine Korrektur ist in Entwicklung. In der Regel heißt das, dass ein Entwickler sich dem Problem zugewiesen hat.
es: **En desarrollo**: un parche está en desarrollo. Normalmente significa que un desarrollador ha sido asignado al problema.
nb: **Under utvikling**: En oppdatering er under utvikling. Betyr vanligvis at en utvikler er tilordnet problemet.
pl: **W rozwoju**: łatka jest w fazie rozwoju. Zwykle oznacza to, że programista jest przypisany do problemu.
ru: **In Development** - **В работе**: готовится патч с исправлениями. Обычно это значит, что проблемой занимается специально назначенный программист.
sq: ** Në Zhvillim **: Një korrigjim është në zhvillim. Kjo zakonisht do të thotë se një zhvillues i ka caktuar problemit.
tr: **Geliştirme Aşamasında**: Geliştirme aşamasında bir düzeltme paketi var. Genellikle konuyla ilgili bir geliştiricinin atandığı anlamına gelir.
zh_hans: **In Development** ：补丁正在开发中。 通常意味着开发人员已被分配到该问题。
zh_hant: **開發中** ：一個補丁正在開發中，通常意味著開發人員被分配到該問題。

source: **Quality Assurance**: The patch is completed and has passed initial testing. The QA team will now review it and provide feedback. If problems are found, the issue is moved back to "Accepted".
nb: **Kvalitetssikring**: Feilrettingen er ferdig og har bestått innledende testing. Kvalitetstestingslaget vil nå vurdere det og gi sin tilbakemelding. Hvis det blir funnet problemer, flyttes problemet tilbake til "Godtatt".
pl: **Zapewnienie jakości**: łatka została ukończona i przeszła wstępne testy. Zespół ds. Kontroli jakości przejrzy ją teraz i przekaże opinię. Jeśli zostaną znalezione problemy, sprawa jest przenoszona z powrotem do "Zaakceptowano".
ru: **Quality Assurance** -**Контроль качества**: патч подготовлен и прошел первоначальное тестирование. Теперь группа контроля качества (QA) протестирует его и предоставит отзыв. Если были выявлены ошибки, проблема возвращается к состоянию «Принята».
