Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: Put the library's source code at ``libs/LIBNAME`` (replacing ``LIBNAME`` by the library's name), because this is where clickable will look for it by default. If the dependency source code is available as a git repository, it is a good idea to add it as a `git submodule <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_. Otherwise add a script to download the sources.
de: Legen Sie den Quellcode der Bibliothek unter ``libs/LIBNAME`` ab (ersetzen Sie dabei ``LIBNAME`` durch den Namen der Bibliothek), da Clickable standardmäßig dort nach ihm sucht. Wenn der Quellcode der Abhängigkeit als Git-Repository verfügbar ist, ist es eine gute Idee, ihn als `git submodule <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_ hinzuzufügen. Andernfalls fügen Sie ein Skript zum Herunterladen der Quellen hinzu.
ru: Скопируйте исходный код библиотеки в папку ``libs/LIBNAME``. Эта папка по умолчанию установлена в clickable. Если исходный код нужных библиотек есть в репозиториях git, можно добавить эту библиотечку как `модуль git <https://git-scm.com/book/de/v1/Git-Tools-Submodule>`_. В противном случае придётся добавить скрипт для скачивания исходных кодов.

source: Add a `libraries section <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ to your clickable.json, like this:
de: Fügen Sie einen "Bibliotheken"-Abschnitt <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ zu Ihrer clickable.json hinzu, etwa so:
ru: Добавьте `раздел с библиотечками <http://clickable.bhdouglass.com/en/latest/clickable-json.html#libraries>`_ в файл clickable.json, как это показано в примере:

source: If the library does not contain a CMake configuration, you need to use the `qmake` or `custom` template instead.
de: Wenn die Bibliothek keine CMake-Konfiguration enthält, müssen Sie stattdessen die Vorlage `qmake` oder `custom` verwenden.
ru: Если библиотека не содержит конфигурации CMake , вместо этого можно использовать шаблоны `qmake` или `custom`. Если Вы выбираете `custom`, нужно добавить команду `build`.

source: Optionally, configure the compilation by adding ``build_args``, which may look like this:
de: Optional können Sie die Kompilierung konfigurieren, indem Sie ``build_args`` hinzufügen, die wie folgt aussehen können:
ru: Дополнительно настройте процесс компиляции - добавьте опцию ``build_args``. Это будет выглядеть так:

source: Most build arguments are project specific. Therefore, study the library's build instructions and also look for ``option`` settings in its ``CMakeLists.txt`` .
de: Die meisten Build-Argumente sind projektspezifisch. Studieren Sie daher die Build-Anweisungen der Bibliothek und suchen Sie auch nach ``Optionseinstellungen`` in deren ``CMakeLists.txt``.
ru: Подбор аргументов обычно зависит от настроек проекта. Поэтому изучите инструкции по сборке библиотеки, а также посмотрите настройки параметра `` option`` в файле `` CMakeLists.txt`` (если используется CMake). По умолчанию, директория для сборки ``build/LIBNAME/ARCHITECTURE``. Поэтому сборки для разных архитектур могут существовать параллельно.

source: To actually build the library for all architectures run ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` and ``clickable build-libs --arch amd64``. Don't forget to mention this step in your README, so that others can reproduce the build process.
de: Um die Bibliothek tatsächlich für alle Architekturen zu bauen, führen Sie ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` und ``clickable build-libs --arch amd64`` aus. Vergessen Sie nicht, diesen Schritt in Ihrer README zu erwähnen, damit andere den Build-Prozess nachvollziehen können.
ru: Чтобы фактически построить библиотеку для всех архитектур, запустите процесс командой ``clickable build-libs --arch armhf``, ``clickable build-libs --arch arm64`` и ``clickable build-libs --arch amd64``. Не забудьте упомянуть этот шаг в README, чтобы другие могли воспроизвести процесс сборки.

source: See how `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>`_ uses the libraries feature to build its dependency tdlib.
de: Sieh wie `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L21>`_die Bibliotheksmerkmale zur Erstellung seiner Abhängigkeiten tdlib nutzt.
ru: Посмотрим, как `Teleports clickable.json <https://gitlab.com/ubports/apps/teleports/blob/master/clickable.json#L14>`_ использует библиотеки для сборки файла зависимостей tdlib.

source: Pre-built
de: Vorkompiliert
ru: Предустановленные библиотеки

source: If you compiled your library as described above, skip this step.
de: Überspringe den Schritt, wenn du deine Bibliothek wie oben beschrieben kompiliert hast.
ru: Если Вы скомпилировали библиотеку, как описано выше, пропустите этот шаг.

source: A pre-built library is usually only available as a shared object that needs to be linked dynamically. Furthermore, it may contain components that you don't need, resulting in a bloated app. It may even miss something that you could achieve by compiling it yourself. Sometimes, a library is available in the Ubuntu Repositories, but is not installable for the architecture you need (likely ``armhf`` or ``arm64``). In this case you have to compile the library as described above.
de: Eine vorgefertigte Bibliothek ist meist nur als gemeinsam genutztes Objekt verfügbar, das dynamisch verlinkt werden muss. Außerdem kann sie Komponenten enthalten, die du nicht benötigst, was zu einer aufgeblähten App führt. Möglicherweise kann die Bibliothek für deine Zwecke auch unvollständig sein, was du durch eigenständiges Kompilieren verhindern kannst. Manchmal ist eine Bibliothek in den Ubuntu Repositories verfügbar, aber nicht für deine Architektur (wahrscheinlich ``armhf`` oder ``arm64``). In diesem Fall muss du die Bibliothek wie oben beschrieben kompilieren.
ru: Предустановленная библиотека обычно доступна только как общий объект, который необходимо динамически связывать. Кроме того, она может содержать лишние компоненты, что приводит к увеличению размера программы. Также в системе могу быть старые версии библиотек, где отсутствую необходимые функции. Иногда библиотека доступна в репозиториях Ubuntu, но ее нельзя установить для требуемой архитектуры (например, для архитектуры ``armhf``). В этом случае нужно скомпилировать библиотеку, как описано выше.

source: If the library is available in the Ubuntu Repositories, you can add it to the dependencies list, like this:
de: Falls die Bibliothek in den Ubuntu Repositories verfügbar ist, kannst du sie wie folgt der Abhängigkeitsliste hinzufügen:
ru: Если библиотека есть в официальных репозиториях Ubuntu, можно добавить ее в список файлов зависимостей:

source: Clickable will install the specified package automatically for the target architecture inside the build container. An example can be found in `Guitar Tools' clickable.json <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.
de: Clickable installiert das angegebene Paket automatisch für die Zielarchitektur innerhalb des Build-Containers. Ein Beispiel findest du in `Guitar Tools' clickable.json <https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.
ru: Clickable автоматически установит указанный пакет внутри контейнера сборки для нужной архитектуры. Пример можно посмотреть в приложении `Guitar Tools' - вот его json-файл-<https://github.com/t-mon/guitar-tools/blob/master/clickable.json#L4>`_.

source: If the library can be found in a PPA, you can add the PPA to the clickable.json, too. For example:
de: Falls die Bibliothek in einem PPA zu finden ist, kannst du das PPA auch der clickable.json hinzufügen. Zum Beispiel:
ru: Если библиотека отсутствует в официальных репозиториях Ubuntu, но есть в PPA, можно добавить PPA в файл clickable.json. Например:

source: Otherwise add a script to download the pre-built library.
de: Anderenfalls füge zum Download der vorkonfigurierten Bibliothek ein Skript hinzu.
ru: В противном случае нужно будет добавить скрипт для скачивания предустановленной библиотеки.

source: Usage
de: Benutzung
ru: Использование

source: First, you need to specify the include directory where the headers can be found that you include into the app's source code. Second, you need to link the library's binary against your app's binary.
de: Zuerst musst du das Include-Verzeichnis angeben, in dem sich die Header befinden die du in den Quellcode der App einbindenst. Dann musst du die Binärdatei der Bibliothek mit der Binärdatei der App verknüpfen.
ru: Сначала нужно указать директорию, где компилятор будет искать файлы заголовков. Далее нужно связать библиотеку и бинарный файл приложения (если это только не библиотека заголовков, где весь исходный код находится в файлах заголовков).

source: In case the library contains a CMake configuration file, you can use the `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_ command, which provides you with a target to link against or variables pointing to the library's binary and include directories. The additional lines on your CMakeLists.txt then may look like:
de: Falls die Bibliothek eine CMake Konfigurationdatei beinhaltet, kannst du den `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_ Befehl verwenden, welcher dich mit einem Ziel für eine Verlinkung versorgt oder mit Variablen, die auf die Binär- und Includeverzeichnisse zeigen. Dann könnten die zusätzlichen Zeilen deiner CMakeList.txt wie folgt aussehen:
ru: Если библиотека содержит файл конфигурации CMake, можно использовать команду `find_package <https://cmake.org/cmake/help/latest/command/find_package.html>`_ , которая предоставляет вам цель для линковки или переменные указывающие на бинарные файлы библиотеки и include каталоги. Дополнительные строки в файле CMakeLists.txt могут выглядеть следующим образом:

source: The ``find_package`` command usually defines the path to the include directory as ``SOMELIBRARY_INCLUDE_DIRS`` and the library's binaries as ``SOMELIBRARY_LIBS`` (check on the library's documentation on what their CMake configuration provides exactly). Use them with the ``include_directories`` and ``target_link_libraries`` commands. See the `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>`_ for a real world example.
de: Der Befehl ``find_package`` definiert normalerweise den Pfad zum Include-Verzeichnis als ``SOMELIBRARY_INCLUDE_DIRS`` und die Binärdateien der Bibliothek als ``SOMELIBRARY_LIBS`` (überprüfe in der Dokumentation der Bibliothek, was deren CMake-Konfiguration genau liefert). Verwende diese mit den Befehlen ``include_directories`` und ``target_link_libraries``. Siehe `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>`_ für ein Beispiel aus der Praxis.
ru: Команда ``find_package`` определяет путь к каталогу include как ``SOMELIBRARY_INCLUDE_DIRS``, а готовые бинарные файлы библиотеки как ``SOMELIBRARY_LIBS``. Мы используем эти переменные с командами ``include_directories`` и ``target_link_libraries``. Пример того, как это работает можно посмотреть в файле `Camera Scanner ImageProcessing CMakeLists.txt <https://github.com/jonnius/camera-scanner/blob/master/plugins/ImageProcessing/CMakeLists.txt#L23>` _ .

source: At this point you should already be able to test with Clickable's desktop mode running ``clickable desktop``.
de: Nun solltest Du durch die Eingabe von ``clickable desktop`` bereits mit dem Clickable's desktop Modus testen können.
ru: На этом этапе вы уже должны иметь возможность протестировать рабочий стол в режиме ``clickable desktop``.

source: Deployment
de: Bereitstellung
ru: Размещение

source: If you linked the library statically, you can skip this step, as the library's binary is already inside your app's binary.
de: Falls Du die Bibliotheken statisch verlinkt hast, kannst Du diesen Schritt überspringen, da die Bibliothek bereits in der Binärdatei Deine App beinhaltet ist.
ru: Если Вы связали библиотеку статически, то этот шаг можно пропустить, так как бинарный файл библиотеки уже находится внутри бинарного файла приложения.

source: Find out which shared object files (``*.so``) you need to ship. You can do so by starting the app on your device via ``clickable && clickable logs``. You should see an error message telling you which shared object file was missing.
de: Eruiere welche "shared object" Dateien (``*.so``) Du mitliefern musst. Das machst Du indem Du die App auf Deinem Gerät mittels ``clickable && clickable logs`` startest. Du solltest anhand der Fehlermeldung sehen, welche Dateien fehlen.
ru: Узнайте, какие общие файлы объектов (``* .so``) нужно отправить. Это можно сделать, запустив приложение на своем устройстве через ``clickable && clickable logs``. Должно появиться сообщение об ошибке, сообщающее, какой общий файл объекта отсутствует.

source: Find the path to the shared object files. For libraries built via clickable, they are located somewhere in the library's install dir, which is located inside the library's build dir by default (e.g. ``build/arm-linux-gnueabihf/opencv/install``). For pre-built libraries run ``clickable run "find / -name 'libSomething.so'"`` (replacing ``libSomething.so`` by the file your are looking for). This should print the path to the file (along with some error messages you can ignore). In general, ``/usr/lib`` is a good bet when looking for the shared object files.
de: Finde den Pfad zu den Shared Objectfiles. Für Bibliotheken, die mit Clickable erzeugt wurden, sind sie den jeweiligen Installationsverzeichnissen der Bibliotheken zu finden. Die Installationsverzeichnisse sind in den jeweiligen Build-Verzeichnissen der jeweiligen Bibliotheken (z.B. ``build/arm-linux-gnueabihf/opencv/install``) enthalten. Für Pre-Build-Bibliotheken führe den Befehl ``clickable run "find / -name 'libSomething.so'"`` aus (ersetze``libSomething.so`` durch die Datei, die du suchst). Dieser sollte dir den Pfad zu der gesuchten Datei ausgeben (die dabei ausgegebenen Fehler können ignoriert werden). Generell ist ``/usr/lib`` ein guter Anhaltspunkt, wenn du nach Shared Objectfiles suchst.
ru: Найдите путь к файлам общих объектов. Если библиотека создана с помощью clickable, то эти файлы находятся в каталоге установки библиотеки. По умолчанию, папка находится внутри каталога сборки библиотеки (например, ``build/arm-linux-gnueabihf/opencv/install``). Для готовых библиотек запустите команду ``clickable run "find / -name 'libSomething.so'"`` (заменив libSomething.so на файл, который ищете). Это выведет на экранпуть к файлу (вместе с некоторыми сообщениями об ошибках, которые можно игнорировать). В общем, при поиске файлов общих объектов лучше всего использовать ``/usr/lib``.

source: To get the files into the click package, add the `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>`_ key to your clickable.json:
de: Um diese Dateien in das CLicck-Paket zu bekommen fügen Sie den `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>`_ Schlüssel Ihrer clickable.json hinzu:
ru: Чтобы поместить файлы в click-пакет, добавьте ключ `install_lib <http://clickable.bhdouglass.com/en/latest/clickable-json.html#install-lib>` _ в файл clickable.json:

source: The lines above contain two examples. The first one installing a library built with Clickable. The asterisk in ``.so*`` helps to catch symbolic links along with the actual library which are used to point to the current version.
de: Die Zeilen oberhalb beinhalten zwei Beispiele. Die Erste, wie man eine Bibliothek installiert, weche mit "Clickable" erzeugt wurde. Das Asterisk-Symbol in ``.so*`` hilft dabei, auch symbolische Links gemeinsam mit der eigentlichen Bibliothek zu finden, welche auf die aktuelle Version verweisen.
ru: Строки выше содержат два примера. В первом примере устанавливается библиотека созданная с помощью Clickable. Звездочка в названии ``.so*`` помогает перехватывать символические ссылки вместе с самой библиотекой, которая нужна для указания на текущую версию.

source: Depending on the library, you might need to ship some additional data. In that case consult the library's readme or install instructions.
de: Je nach Bibliotek, müssen eventuell weitere Daten mitgeliefert werden. Für diesen Fall ist es hilfreich, in der ReadMe-Datei oder Installationsanletung der Bibliothek, nachzusehen.
ru: В зависимости от библиотеки, может быть потребуется отправить некоторые дополнительные данные. В этом случае обратитесь к файлу readme для библиотеки или инструкциям по установке.

source: You should be set up to build and install your click package on a device connected to your computer now by running ``clickable``.
de: Du solltest nun in der Lage sein durch die Ausführung von ``clickable`` dein Clickpackage zu erzeugen und auf einem an deinem Computer angeschlossenen Gerät zu installieren.
ru: Нужно настроить всё для сборки и установки click-пакета на устройстве, подключенном к компьютеру, запустив ``clickable``.

source: Importing from Content Hub and URLdispatcher
de: Importieren aus Content Hub und URLdispatcher
es: Importar desde el centro de contenido y «URLdispatcher»
ru: Импорт данных из Content Hub и URLdispatcher

source: In the previous guide we have seen a little bit about how Content Hub works. In this guide we will see how ``URLdispatcher`` works and how to handle imported data from the Content Hub.
de: Im vorherigen Guide haben wir ein wenig darüber erfahren, wie Content Hub funktioniert. In diesem Guide werden wir sehen, wie ``URLdispatcher`` funktioniert und wie man mit importierten Daten aus dem Content Hub umgeht.
es: Hemos visto en la guía anterior un poquito sobre como funciona el centro de contenido. En esta guía veremos como funciona ``URLdispatcher` y como manejar los datos importados desde el centro de contenido.
ru: В предыдущем руководстве мы немного узнали о том, как работает Content Hub. В этом руководстве мы увидим, как работает ``URLdispatcher`` и как обрабатывать импортированные данные из Content Hub.

source: Handle data from the Content Hub
de: Verarbeitung von Daten aus dem Content Hub
es: Manejar datos desde el centro de contenido
ru: Обработка данных из Content Hub

source: OpenStore app from open-store.io
de: OpenStore App aus open-store.io
es: Aplicación de OpenStore de open-store.io
ru: Приложение OpenStore с сайта open-store.io

source: One of the easiest ways of testing an app, is to send a test click to yourself on Telegram, and opening that click file with the OpenStore through the Content Hub:
de: Eine der einfachsten Möglichkeiten, eine App zu testen, ist, sich selbst eine Test-Click auf Telegram zu schicken und diese Click-Datei mit dem OpenStore über den Content Hub zu öffnen:
es: Una de las maneras más fáciles de probar una aplicación es enviarse un «click» de prueba a uno mismo usando Telegram y abriendo ese archivo «click» con OpenStore a través del centro de contenido:
ru: Один из самых простых способов тестирования приложения - отправить тестовый click-пакет в свою учётную запись Telegram и открыть этот файл в OpenStore через Content Hub:

source: If we tap on the OpenStore app, it will be opened and it will ask if we want to install the click file. Let’s take a look into `the Main.qml code of the app <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>`_ to see how it is done:
de: Wenn wir auf die OpenStore App tippen, wird sie geöffnet und fragt, ob wir die Click-Datei installieren möchten. Lassen Sie uns einen Blick in den Main.qml-Code der App <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>``_ werfen, um zu sehen, wie es gemacht wird:
es: Si pulsamos en la aplicación de OpenStore, se abrirá y preguntará si queremos instalar el archivo «click». Echémosle un vistazo al `código Main.qml de la aplicación <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85>`_ para ver como se hace:
ru: Если мы попробуем запустить приложение из OpenStore, то система спросит, хотим ли мы установить click-файл. Давайте посмотрим на файл приложения Main.qml <https://github.com/UbuntuOpenStore/openstore-app/blob/master/openstore/Main.qml#L85> `_, чтобы узнать, как это делается:

source: Do you see that Connections element that targets the ContentHub? When it receives the signal onImportRequested, it will take the url of the data sent from the Content Hub (``transfer.items[0].url`` is the url of the first data sent) and open a ``PopUp`` element to let the user install the click.
de: Sehen Sie das Connections-Element, das auf den ContentHub abzielt? Wenn es das Signal onImportRequested empfängt, nimmt es die URL der vom Content Hub gesendeten Daten (``transfer.items[0].url`` ist die URL der ersten gesendeten Datei) und öffnet ein ``PopUp`` Element, damit der Benutzer die Click installieren kann.
es: ¿Ve ese elemento «Connections» que apunta al centro de contenido («ContentHub»)? Cuando recibe la señal «onImportRequested», tomará la url de los datos enviados desde el centro de contenido (``transfer.items[0].url`` es la url de los primeros datos enviados) y abre un elemento ``PopUp`` para permitir al usuario instalar el «click».
ru: Вы видите элементы Connections, которые относятся к ContentHub? Когда приложение получает сигнал onImportRequested, оно ищет url-адрес в данных, полученных от Content Hub (``transfer.items[0].url``- url-адрес первых отправленных пакетов данных) и откроет элемент ``PopUp``, чтобы пользователь смог установить click-пакет.

source: What about the URLdispatcher?
de: Was ist mit dem URL-Dispatcher?
es: ¿Qué ocurre con el «URLdispatcher»?
ru: Что можно сказать об URLdispatcher?

source: The URL dispatcher is a piece of software, similar to the Content Hub, that makes our life easier trying to choose the correct app for a certain protocol. For example: We probably want to open the web browser when tapping on an http protocol. If we tap on a map link it is handy to open it with uNav or to open a twitter link in the Twitter app! How does that work?
de: Der URL-Dispatcher ist eine Software, ähnlich dem Content Hub, die uns das Leben leichter macht, wenn wir versuchen, die richtige App für ein bestimmtes Protokoll auszuwählen. Zum Beispiel: Wir wollen wahrscheinlich den Webbrowser öffnen, wenn wir auf ein http-Protokoll tippen. Wenn wir auf einen Kartenlink tippen, ist es praktisch, ihn mit uNav zu öffnen oder einen Twitter-Link in der Twitter-App zu öffnen! Wie funktioniert das?
es: El distribuidor de URL («URL dispatcher») es una pieza de software, similar al centro de contenido, que nos hace la vida más fácil intentando seleccionar la aplicación correcta para un protocolo determinado. Por ejemplo: probablemente queremos abrir el navegador cuando pulsamos sobre un protocolo http. Si pulsamos en un enlace de un mapa es útil abrirlo con uNav, ¡o abrir un enlace de twitter con la aplicación de Twitter! ¿Cómo funciona esto?
ru: Диспетчер URL - это часть программного обеспечения, похожая на Content Hub, которая облегчает нашу жизнь, пытаясь выбрать правильное приложение для определенного протокола. Например: скорее всего, нужно открыть веб-браузер при нажатии на http-ссылку. Ссылку на карту удобнее открыть с помощью uNav, а ссылку на пост Twitter - в приложении Twitter. Как это работает?
