Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: The content hub - tips and tricks
de: Der Content-Hub - Tipps und Tricks
es: Centro de contenido - consejos y trucos
ru: Content hub - полезные советы

source: Content Hub Share Page
de: Content Hub: Teilen-Seite
es: Página para compartir del centro de contenido
ru: Cтраница для публикации

source: On Ubuntu Touch the apps are confined. The way of sharing files between them is through the Content Hub, a part of the system that takes care of file import, export and sharing.
de: In Ubuntu Touch sind alle Apps eingeschränkt. Um Dateien zwischen ihnen auszutauschen gibt es den Content-Hub, ein Teil des Betriebssystems der sich um Datei-Import, -Export und -Teilen kümmert.
es: Las aplicaciones están confinadas en Ubuntu Touch. La manera de compartir archivos entre ellas es a través del centro de contenido, una parte del sistema que se encarga de importar, exportar y compartir archivos.
ru: В Ubuntu Touch возможности приложении сильно ограничены. Обмен файлами между ними осуществляется через Content Hub, это часть операционной системы, которая занимается импортом, экспортом и совместным использованием файлов.

source: Different ways of sharing the content
de: Verschiedene Möglichkeiten um Inhalte zu teilen
es: Diferentes maneras de compartir contenido
ru: Несколько способов поделиться контентом

source: As we can see in the `Content Hub documentation <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, there are several ways of handling the file to be shared:
de: Wie wir in der `Content Hub-Dokumentation <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_ sehen können, gibt es verschiedene Möglichkeiten, wie die Datei geteilt werden kann:
es: Como podemos ver en la `documentación del centro de contenido <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, existen varias formas de manejar el archivo que se va a compartir:
ru: Как можно узнать из `документации к Content Hub <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Content/ContentHandler.html#detailed-description>`_, есть несколько способов совместного доступа к файлам:

source: ``ContentHandler.Source`` (The selected app will provide a file to be imported)
de: ``ContentHandler.Source`` (Die ausgewählte App stellt eine zu importierende Datei bereit)
ru: ``ContentHandler.Source``(Выбранное приложение будет источником импортируемого файла)

source: ``ContentHandler.Destination`` (The selected app will be the destination for the exported file)
de: ``ContentHandler.Destination`` (Die ausgewählte App ist das Ziel der exportierten Datei)
ru: ``ContentHandler.Destination``(Выбранное приложение будет местом назначения экспортируемого файла)

source: ``ContentHandler.Share`` (The selected app will be the destination for the exported file, which will then be shared externally)
de: ``ContentHandler.Share`` (Die ausgewählte App ist das Ziel der exportierten Datei, welche dann extern freigegeben wird)
ru: ``ContentHandler.Share``(Выбранное приложение будет местом назначения для экспортированного файла, который будет в общем доступе)

source: Importing
de: Importieren
es: Importar
ru: Импортирование

source: Webapp Creator on the OpenStore
de: Webapp Ersteller im OpenStore
es: Webapp Creator en OpenStore
ru: Webapp Creator в OpenStore

source: Looking into the code of Webapp Creator, we’ll find the code to import an image to be used as icon. Tapping on the place holder will open the Content Hub that will let us choose from where to import the image (`see the Webapp Creator source code <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)
de: Wenn wir uns den Code von Webapp Creator ansehen, finden wir den Code zum Importieren eines Bildes, das als Symbol verwendet werden soll. Wenn Sie auf den Platzhalter tippen, öffnet sich der Content Hub, über den wir auswählen können, woher das Bild importiert werden soll (siehe Quellcode des Webapp Creators <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>``_)
es: Mirando en el código de Webapp Creator, encontraremos el código para importar una imagen para usarla como icono. Pulsando en el marcador de posición se abrirá el centro de contenido que nos permitirá elegir desde dónde importar la imagen (`ver el código fuente de Webapp Creator <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)
ru: Мы изучим исходный текст Webapp Creator и найдём участок кода, отвечающий за импорт изображения, которое используется в качестве иконки. Движение с нажатой клавишей мышки откроет Content Hub, где мы сможем выбрать откуда импортировать изображение (`смотрите исходный код Webapp Creator <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_)

source: ``ContentPeerPicker`` is the element that shows the apps.
de: ``ContentPeerPicker`` ist das Element, das die App zeigt.
es: ``ContentPeerPicker`` es el elemento que muestra las aplicaciones.
ru: ``ContentPeerPicker`` - элемент, который показывает приложения.

source: ``contentType`` is passed in `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ as ContentType.Pictures. So, we will only see apps from which we only can import images. ``handler`` is passed in the same line as ContentHandler.Source. As we want to import an image from the app selected in the Content Hub.
de: ``contentType`` wird in `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ als ContentType.Pictures übergeben. Wir werden also nur Apps sehen, aus denen wir nur Bilder importieren können. ``handler`` wird in der gleichen Zeile wie ContentHandler.Source übergeben. Da wir ein Bild aus der im Content Hub ausgewählten App importieren wollen.
es: ``contentType`` se pasa en `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ como ContentType.Pictures. Así, solo veremos aplicaciones desde las que solo podemos importar imágenes. ``handler`` se pasa en la misma línea como ContentHandler.Source. Ya que queremos importar una imagen desde la aplicación seleccionada en el centro de contenido.
ru: ``contentType`` передаётся в `Main.qml <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/Main.qml#L118>`_ как ContentType.Pictures. Таким образом, мы увидим только те приложения, из которых мы можем импортировать только изображения. ``handler`` передаётся в той же строчке, что и ContentHandler.Source потому, что мы хотим импортировать изображение из приложения, выбранного в Content Hub.

source: Exporting
de: Exportieren
es: Exportar
ru: Экспорт

source: Gelek in the OpenStore
de: Gelek im OpenStore
es: Gelek en OpenStore
ru: Gelek в OpenStore

source: In Gelek, we are going to end with some saved games that we want to save in our device or share with ourselves (in Telegram and then save them to our computer).
de: In Gelek werden wir mit einigen gespeicherten Spielen enden, die wir auf unserem Gerät speichern oder mit uns selbst teilen wollen (in Telegram und dann auf unserem Computer speichern).
es: En Gelek, vamos a terminar con algunos juegos salvados que queremos guardar en nuestro dispositivo o compartir con nosotros mismos (en Telegram y después guardarlos en nuestro ordenador).
ru: В Gelek мы будем работать с некоторыми сохраненными играми, которые нужно хранить в нашем устройстве или поделиться с пользователями (через Telegram, а затем перенести их на десктоп).

source: Tapping on the download icon we will get a Content Hub to *save* the game file (which is actually an export).
de: Wenn Sie auf das Download-Symbol tippen, erhalten Sie einen Content Hub zum *Speichern* der Spieldatei (das eigentlich ein Export ist).
es: Pulsando en el icono de descarga obtendremos un gestor de contenido para *guardar* el archivo del juego (que en realidad es una exportación).
ru: Удерживая курсор на иконке "Download" мы заставим Content Hub *сохранить* файл игры (и он же предназначен для экспорта).

source: The game file is a file of type ``glksave``. We will tell Content Hub that we are sending a file of type ``All`` (`see the Install Page code <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).
de: Die Spieldatei ist eine Datei vom Typ ``glksave``. Wir werden Content Hub mitteilen, dass wir eine Datei vom Typ ``Alle`` senden (``Siehe den Code der Installationsseite <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>``_).
es: El archivo de juego es un archivo del tipo ``glksave``. Diremos al centro de contenido que estamos enviando un archivo del tipo ``All`` (`ver el código de la página de instalación <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).
ru: Файл игры относится к типу ``glksave``. Мы сообщим Content Hub, что мы собираемся отправить файл типа ``All`` (`смотрите коды на странице инсталляции <https://gitlab.com/cibersheep/gelek/blob/master/app/InstallPage.qml#L38>`_).

source: ``contentType`` is ``ContentType.All``, so we will only see apps which are able to receive unmarked file types. ``handler`` is ``ContentHandler.Destination``, so the app selected should store the saved game.
de: ``contentType`` ist ``ContentType.All``, daher werden wir nur Anwendungen sehen, die in der Lage sind, nicht markierte Dateitypen zu empfangen. ``handler`` ist ``ContentHandler.Destination``, daher sollte die ausgewählte App das gespeicherte Spiel speichern.
es: ``contentType`` es ``ContentType.All``, así que solo veremos aplicaciones que pueden recibir tipos de archivos sin marcar. ``handler`` es ``ContentHandler.Destination``, así que la aplicación seleccionada debería almacenar el juego guardado.
ru: ``contentType`` - это``ContentType.All``, поэтому мы увидим только приложения, которые могут получать файлы с неуказанными типами. ``handler`` - это ``ContentHandler.Destination``, поэтому выбранное приложение должно сохранять файл игры.

source: Tapping on the File Manager we will save the saved game in the folder we choose.
de: Wenn wir auf den Dateimanager tippen, speichern wir das gespeicherte Spiel in dem von uns gewählten Ordner.
es: Pulsando en el gestor de archivos guardaremos los juegos guardados en la carpeta que elijamos.
ru: Нажатие вкладки "File Manager" переместит сохраненную игру в папку, которую мы выберем.

source: Sharing
de: Teilen
es: Compartir
ru: Sharing (Общий доступ)

source: Similarly, tapping on the share icon will allow us to send the saved game through Telegram to ourselves (`see the Webapp Creator Import Page source code <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_). Sharing is similar to exporting, except the destination app may share the content externally (for example, over Telegram or text message).
de: Ebenso können Sie das gespeicherte Spiel per Telegram an uns senden (siehe Quellcode der Webapp Creator Import Page <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>``_). Das Teilen ist gleichbedeutend dem Exportieren, außer dass die Ziel-App den Inhalt möglicherweise extern freigibt (über Telegram oder Textnachricht, zum Beispiel).
ru: Точно так же, нажатие на иконку "share" отправит сохранённую игру другим пользователям через мессенджер Telegram (`подробнее смотрите страничку с исходным кодом Webapp Creator Import Page <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_). Шаринг - то же самое, что и экспорт, за исключением того, что приложение может обмениваться контентом извне (например, через Telegram или текстовое сообщение).

source: The only difference between this and the previous code is that ``handler`` is ``ContentHandler.Share``.
de: Der einzige Unterschied zwischen diesem und dem vorherigen Code besteht darin, dass ``handler`` jetzt ``ContentHandler.Share`` ist.
ru: Разница между этим и предыдущим участком кода только в том, что ``handler`` - это ``ContentHandler.Share``.

source: Wait a minute. Why the different apps?
de: Warte einen Moment. Warum die verschiedenen Apps?
es: Espera un momento. ¿Por qué aplicaciones diferentes?
ru: Подождите, почему приложения разные?

source: Content Hub: Export vs Share
de: Content Hub: Exportieren vs. Teilen
es: Centro de contenido: Exportar frente a compartir
ru: Content Hub: Экспорт или Общий доступ

source: Each developer can decide the rules each app would follow in relation to the Content Hub. Why the OpenStore is shown as the destination of an export?
de: Jeder Entwickler kann die Regeln festlegen, die jede App in Bezug auf den Content Hub befolgen würde. Warum wird der OpenStore als Ziel eines Exports angezeigt?
es: Cada desarrollador puede decidir las normas que cada aplicación seguirá en relación con el centro de contenido. ¿Por qué aparece OpenStore como el destino de una exportación?
ru: Каждый разработчик может самостоятельно решить правила, по которым каждое приложение взаимодействует с Content Hub.Почему OpenStore показывается как место для экспорта?

source: Let’s check its manifest.json
de: Schauen wir uns die manifest.json an
es: Comprobemos su manifest.json
ru: Давайте проверим manifest.json для этого приложения

source: The above code defines that the hooks for the app named ``"openstore"`` in relation to the ``"content-hub"`` should follow the rules defined in ``openstore-contenthub.json``
de: Der obige Code definiert, dass die Hooks für die App mit dem Namen ``"openstore"``` in Bezug auf den ``"content-hub"``` die Regeln befolgen sollen, die in ``openstore-contenthub.json`` definiert sind
es: El código anterior define que los ganchos para la aplicación llamada ``«openstore»`` en relación al ``«content-hub»`` debería de seguir las reglas definidas en ``openstore-contenthub.json``
ru: Приведённый выше код показывает, что в приложении есть hooks ``"openstore"``связанные с ``"content-hub"``, и они должны работать по правилам, заданным в файле ``openstore-contenthub.json``

source: This means, the OpenStore will be the destination for *all* ``ContentTypes``.
de: Das bedeutet, dass der OpenStore das Ziel für *alle* ``ContentTypes`` ist.
es: Esto significa que OpenStore será el destino para *todos* los ``ContentTypes``.
ru: Это значит, что OpenStore будет местом назначения для *всех* ``ContentTypes``.

source: What about uMatriks? Let’s see its ``content-hub.json``
de: Was ist mit uMatriks? Betrachten wir das ``content-hub.json``
es: ¿Qué ocurre con uMatriks? Veamos su ``content-hub.json``
ru: А что с приложением uMatriks? Давайте посмотрим его файл ``content-hub.json``

source: So, with this example, uMatriks will be able to be the destination, source and share app for all kinds of ``ContentType``. What about the other hooks in the ``manifest.json``? That is discussed in the next guide.
de: Mit diesem Beispiel können uMatriks also das Ziel, die Quelle und die Freigabe der App für alle Arten von "ContentType" sein. Was ist mit den anderen Haken in der ``manifest.json``? Das wird im nächsten Guide erläutert.
es: Así, con este ejemplo, uMatriks podrá ser el destino, origen y aplicación para compartir para toda clase de ``ContentType``. ¿Qué ocurre con los otros ganchos en el ``manifest.json``? Eso se analiza en la siguiente guía.
ru: Так, в этом примере uMatriks может быть местом назначения, исходной точкой и приложением для общего доступа для всех типов ``ContentType``. Что можно сказать о других hooks в файле ``manifest.json``? Об этом рассказывается в следующей части руководства.

source: App development cookbook
de: Kochbuch für die APP–Entwicklung
es: Recetario de desarrollo de aplicaciones
ru: Справочник по созданию приложений

source: Unofficial resources
de: Weiterführende Ressourcen
es: Recursos no oficiales
ru: Неофициальные источники

source: In this section you will find links to external resources about creating applications for Ubuntu Touch.
de: In diesem Bereich befinden sich Links zu externen Ressourcen über die Erstellung von Anwendungen für Ubuntu Touch.
es: En esta sección encontrará enlaces a recursos externos sobre creación de aplicaciones para Ubuntu Touch.
ru: В этом разделе содержатся ссылки на внешние источники, где можно найти информацию о создании приложений для Ubuntu Touch.

source: Playground
de: Spielplatz
es: Zona para jugar
ru: "Песочница"

source: In a completely free and open source community, it is natural to have community members exploring the limits of the platform in many many directions. In this section you will find links to external resources that do exactly that: Explore. The purpose of this list is to show the unlimited possibilities of an open platform like Ubuntu Touch.
de: In einer Community mit komplett freien und offenen Quellen, ist es normal, dass es Community–Mitglieder gibt, die die Limits der Plattform in alle Richtungen austesten. In diesem Abschnitt findet man die Links zu den externen Resourcen, die genau dieses Entdecken unterstützen. Das Ziel dieser Liste ist es die unbegrenzten Möglichkeiten einer offenen Plattform wie Ubuntu Touch zu zeigen.
es: En una comunidad de código abierto completamente libre, es natural que haya miembros de la comunidad explorando los límites de la plataforma en muchísimas direcciones. En esta sección encontrará enlaces a recursos externos que hacen exactamente eso: explorar. El propósito de esta lista es mostrar las posibilidades ilimitadas de una plataforma abierta como Ubuntu Touch.
ru: В полностью свободном и открытом сообществе совершенно естественным кажется, что найдутся пользователи, которым станет интересно изучить систему со всех сторон. В этом разделе Вы найдёте ссылки на внешние источники, специально предназначенные для исследований. Цель списка - показать неограниченные возможности открытых платформ.

source: The resources listed here do not necessarily represent the officially endorsed way of developing applications for Ubuntu Touch, but are interesting experiments.
de: Die aufgeführten Ressourcen zeigen nicht unbedingt den offiziell anerkannten Weg um Anwendungen für Ubuntu Touch zu entwickeln, können aber für Experimentierfreudige interessant sein.
es: Los recursos listados aquí no representan necesariamente la forma oficialmente respaldada de desarrollar aplicaciones para Ubuntu Touch, pero son experimentos interesantes.
ru: Перечисленные здесь ресурсы не обязательно представляют официально одобренный способ разработки приложений для Ubuntu Touch, но будут интересны для экспериментов.

source: `Free Pascal development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
de: `Free Pascal Entwicklungsinformation für Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
es: `Desarrollo en Free Pascal para Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__
ru: `Free Pascal разработка под Ubuntu Touch <http://kriscode.blogspot.tw/2016/09/freepascal-development-for-ubuntu-phone.html>`__

source: `Lazarus development for Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
de: `Lazarus Entwicklunginformation für Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
es: `Desarrollo en Lazarus para Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__
ru: `Lazarus разработка под Ubuntu Touch <http://kriscode.blogspot.tw/2016/10/lazarus-development-for-ubuntu-phone.html>`__

source: `Geany on Ubuntu Touch device as text editor, source code editor, debugger and compiler for multiple languages <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
de: `Geany für Ubuntu Touch Geräte als Text–Editor, Source–Code Editor, Debugger und Compiler für unterschiedliche Sprachen <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
es: `Geany en un dispositivo Ubuntu Touch como editor de texto, editor de código fuente, depurador y compilador para múltiples lenguajes <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__
ru: `Geany на устройстве Ubuntu Touch как текстовый редактор, редактор исходного кода, отладчик и компилятор для множества языков программирования <http://kriscode.blogspot.tw/2017/10/geany-on-ubuntu-touch-device-as-text.html>`__

source: `Publish your existing Qt QML app to Ubuntu Touch using QMake (Video) <https://youtu.be/ehqlwRNrfO0>`__
de: `Benutzen Sie QMake (Video) um Ihre existierende Qt QML App an Ubuntu Touch zu übermitteln <https://youtu.be/ehqlwRNrfO0>`__
ru: `Publish your existing Qt QML app to Ubuntu Touch using QMake (Видео) <https://youtu.be/ehqlwRNrfO0>`__

source: `Publish your existing Qt QML app to Ubuntu Touch using CMake (Video) <https://youtu.be/c2sq6aLeGec>`__
de: `So benutzen Sie CMake um Ihre existierende Qt QML App an Ubuntu zu übermitteln (Video) <https://youtu.be/c2sq6aLeGec>`__
ru: `Publish your existing Qt QML app to Ubuntu Touch using CMake (Видео) <https://youtu.be/c2sq6aLeGec>`__

source: `Getting started with Clickable (Video) <https://youtu.be/TE-s5522v0Y>`__
de: `Beginne mit deiner ersten App (Video) <https://youtu.be/TE-s5522v0Y>`__
ru: `Getting started with Clickable (Видео) <https://youtu.be/TE-s5522v0Y>`__

source: `Content Hub overview (Video) <https://youtu.be/AihwC2sPIk0>`__
de: `Übersicht von Content Hub (Video) <https://youtu.be/AihwC2sPIk0>`__
ru: `Content Hub overview (Видео) <https://youtu.be/AihwC2sPIk0>`__

source: `Import files to your app with Content Hub (Video) <https://youtu.be/q6zzM16jw1U>`__
de: `Importieren Sie Dateien in Ihre App mit Content Hub (Video) <https://youtu.be/q6zzM16jw1U>`__
ru: `Import files to your app with Content Hub (Видео) <https://youtu.be/q6zzM16jw1U>`__

source: Handle C++ dependencies with Clickable
de: Behandeln Sie C ++ - Abhängigkeiten mit Clickable
ru: Работа с библиотеками и зависимыми файлами C++ с помощью Clickable

source: If an app depends on a library that is not pre-installed in Ubuntu Touch, the app needs to ship it inside the click package. This guide shows how this can be done with Clickable.
de: Wenn eine App von einer Bibliothek abhängt, die in Ubuntu Touch nicht vorinstalliert ist, muss die App diese im Click-Paket mitliefern. Diese Anleitung zeigt, wie dies mit Clickable geschehen kann.
ru: Если работа приложения зависит от библиотеки, по умолчанию не установленной в Ubuntu Touch, то приложение должно взять его из click-пакета. В этой статье рассказывается, как с помощью Clickable создать такой пакет.

source: Building
de: Erstellung
ru: Сборка

source: Sometimes libraries are available pre-built, allowing you to skip the build step. Compiling your dependency is recommended though, as it gives you more control over the whole process and may lead to better results (e.g. better performance or smaller package sizes).
de: Manchmal sind Bibliotheken vorkompiliert verfügbar, so dass Sie den Kompilierschritt überspringen können. Das Kompilieren Ihrer Abhängigkeit wird jedoch empfohlen, da Sie dadurch mehr Kontrolle über den gesamten Prozess haben und möglicherweise bessere Ergebnisse erzielen (z. B. eine bessere Leistung oder kleinere Paketgrößen).
ru: Иногда в наличии есть уже готовые библиотеки, что позволяет пропустить этап сборки. Однако рекомендуется компилировать файлы зависимостей, так как это дает больше контроля над всем процессом и может привести к лучшим результатам (например, лучшая производительность или меньшие размеры пакетов).

source: Compilation
de: Kompilierung
ru: Компиляция
