Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: The ``URLdispatcher`` selects which app (according to their ``manifest.json``) will open a certain link.
de: Der ``URLdispatcher`` wählt aus, welche App (entsprechend ihrer ``manifest.json``) einen bestimmten Link öffnen soll.
es: El ``URLdispatcher`` selecciona que aplicación (de acuerdo con su ``manifest.json``) abrirá un enlace determinado.
ru: ``URLdispatcher`` (Диспетчер URL) выбирает, какое приложение (согласно файлу ``manifest.json``) откроет определенную ссылку.

source: Let’s see how our navigation app looks inside. uNav’s manifest shows special hooks for the ``URLdispatcher`` in its `manifest.json code <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:
de: Schauen wir uns an, wie unsere Navigations-App im Inneren aussieht. uNavs Manifest zeigt spezielle Hooks für den ``URLdispatcher`` in seinem `manifest.json Code <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:
es: Veamos como se ve el interior de nuestra aplicación de navegación. El manifiesto de uNav muestra unos ganchos especiales para ``URLdispatcher`` (distribuidor de URL) en su `código en el manifest.json <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9>`_:
ru: Давайте посмотрим, как устроено навигационное приложение. В файле файле manifest.json приложения uNav показаны специальные хуки для `` URLdispatcher`` <https://bazaar.launchpad.net/~unav-devs/unav/trunk/view/head:/manifest.json#L9> `_:

source: This means that a link that looks like http://map.unav.me/xxxxx,xxxxx will be opened in uNav. And that’s defined in lines 2 and 3, where it looks for protocol http followed by map.unav.me.
de: Das bedeutet, dass ein Link, der wie http://map.unav.me/xxxxx,xxxxx aussieht, in uNav geöffnet wird. Und das ist in den Zeilen 2 und 3 definiert, wo es nach dem Protokoll http sucht, gefolgt von map.unav.me.
es: Esto significa que un enlace que se parece a http://map.unav.me/xxxxx,xxxxx se abrirá en uNav. Y eso se define en las líneas 2 y 3, donde busca el protocolo http seguido de map.unav.me.
ru: Это означает, что ссылка в формате http://map.unav.me/xxxxx ,xxxxx будет открыта в приложении uNav. Это определено в строках 2 и 3, где указан протокол http и приложение map.unav.me.

source: Also, a URI formatted geo:xxx,xxx should open in uNav, as it’s defined in line 11.
de: Außerdem sollte sich ein URI-formatierter geo:xxx,xxx,xxx in uNav öffnen, wie es in Zeile 11 definiert ist.
es: Además, una URI formateada así geo:xxx,xxx debería abrirse en uNav, y se define en la línea 11.
ru: Кроме того, geo: xxx, xxx в формате URI должны открываться в uNav, как это определено в строке 11.

source: And how do we manage the received URL?
de: Und wie verwalten wir die empfangene URL?
es: ¿Y cómo gestionamos la URL recibida?
ru: И как мы управляем полученным URL?

source: After the ``URLdispatcher`` sends the link to the correspondent app, we need to handle that URL or URI in the targeted app. Let’s see how to do that:
de: Nachdem der ``URLdispatcher`` den Link zur entsprechenden App sendet, müssen wir diese URL oder URI in der Ziel-App behandeln. Mal sehen, wie man das macht:
es: Después de que ``URLdispatcher`` envía el enlace a la aplicación correspondiente, necesitamos gestionar esa URL o URI en la aplicación objetivo. Veamos cómo hacer eso:
ru: После того, как `` URLdispatcher`` отправит ссылку соответствующему приложению, нам нужно обработать этот URL или URI в целевом приложении. Давайте посмотрим, как это сделать:

source: In the main qml file, we need to add some code to know what to do with the dispatched URL. Let's check how Linphone app manages this adding a `connection to the URI Handler <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>`_ with a Connections element setting ``UriHandler`` as a target.
ru: В основной файл qml необходимо добавить код, чтобы знать, что делать с отправленным URL-адресом. Давайте проверим, как приложение Linphone управляет этим добавлением `подключение к обработчику URI <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L212>`_ с элементом Connections, задающим в качестве цели ``UriHandler``.

source: This code will manage an URI in the form ``linphone://sip:xxx@xxx.xx`` when the app is opened. But what do we need to do to handle this link when the app is closed?
de: Wenn die App geöffnet ist, verwaltet dieser Code eine URI in der Form``linphone://sip:xxx@xxx.xx``. Aber wie gehen wir mit dem Link um, wenn die App geschlossen ist?
ru: Этот код при открытии приложения будет передаваться URI в формате ``linphone://sip:xxx@xxx.xx``. Но что нужно сделать, чтобы обработать эту ссылку, когда приложение закрыто?

source: We need to add a little bit `extra code <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L76>`_ that will cover two cases: 1) We receive one URL 2) We receive more than one URL
de: Wir müssen ein wenig `Zusatzcode <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L69>`_ hinzufügen, der zwei Fälle abdeckt: 1) Wir erhalten eine URL 2) Wir erhalten mehr als eine URL
ru: Нам нужно добавить в исходный файл участок `дополнительного кода <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L69>`_, который будет описывать два случая: 1) получен один URL 2) Получено более одного URL

source: Let's check if ``Qt.application.arguments`` is not empty and if not, if any argument matches our URI format.
ru: Давайте проверим, не пустой ли параметр ``Qt.application.arguments``, и если нет, то соответствует ли какой-либо аргумент нашему формату URI.

source: Remember to check that %u (to receive 1 URL) or %U (to receive 1 or more URLs) is present under the ``Exec`` line in the `.desktop <https://gitlab.com/ubports-linphone/linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ file of the app.
ru: Не забудьте проверить, что% u (для получения 1 URL-адреса) или% U (для получения 1 или более URL-адресов) присутствует в строке ``Exec`` в файла приложения `.desktop <https://gitlab.com/ubports-linphone/linphone-simple/-/blob/master/linphone.desktop.in#L7>`_ .

source: What happens if more than one app has the same URL type defined?
de: Was passiert, wenn mehr als eine App den gleichen URL-Typ definiert hat?
es: ¿Qué ocurre si más de una aplicación tiene definido el mismo tipo de URL?
ru: Что произойдет, если для нескольких приложений определен один и тот же тип URL?

source: A very good question. What happens if we tap on a Twitter link? How is such a URL handled by the ``URLdispatcher`` as protocol ``http`` or the protocol ``http://twitter``?
de: Eine sehr gute Frage. Was passiert, wenn wir auf einen Twitter-Link tippen? Wie wird eine solche URL vom ``URLdispatcher`` als Protokoll ``http`` oder das Protokoll ``http://twitter``` behandelt?
es: Una pregunta muy buena. ¿Qué ocurre si pulsamos en un enlace de Twitter? ¿Cómo se maneja tal URL por el ``URLdispatcher``? ¿Cómo protocolo ``http`` o cómo el protocolo ``http://twitter``??
ru: Очень хороший вопрос. Что произойдет, если мы нажмем на ссылку в Twitter? Как такой URL будет обрабатывать `` URLdispatcher``? Она будет воспринята как обычная ссылка `` http`` или как ссылка для приложения`` http: // twitter``?

source: What happens if two apps have the same defined protocol?
de: Was passiert, wenn zwei Apps das gleiche definierte Protokoll haben?
es: ¿Qué ocurre si dos aplicaciones tienen definido el mismo protocolo?
ru: Что произойдет, если один протокол определен для двух приложений?

source: Now it’s time to do some tests and share the results in the next guide.
de: Jetzt ist es an der Zeit, einige Tests durchzuführen und die Ergebnisse im nächsten Guide zu veröffentlichen.
es: Ahora es el momento de hacer algunas pruebas y compartir los resultados en la siguiente guía.
ru: Теперь пришло время сделать несколько тестов и обсудить результаты в следующей главе.

source: Developer guides
de: Entwickler-Guides
es: Guías para desarrolladores
ru: Инструкции для разработчика

source: We are currently working on expanding our list of developer guides. In the mean time we recommend the `Ubuntu Touch Programming Course <https://mimecar.gitbook.io/qt-course/>`__.
de: Wir arbeiten derzeit daran, unsere Liste der Entwickler-Guides zu erweitern. In der Zwischenzeit empfehlen wir den `Ubuntu Touch Programming Kurs <https://mimecar.gitbook.io/qt-course/>`__.
es: Estamos trabajando actualmente en expandir nuestra lista de guías para desarrolladores. Mientras tanto recomendamos el `curso de programación de Ubuntu Touch <https://mimecar.gitbook.io/qt-course/es>`__.
ru: В настоящее время мы работаем над расширением нашего списка руководств для разработчиков. Пока рекомендуем изучить книгу `Курс программирования Ubuntu Touch <https://mimecar.gitbook.io/qt-course/>` __.

source: If you are interested in helping create developer guides check out our `GitLab Project <https://gitlab.com/ubports/apps/development-resources>`__.
ru: Если вы хотите помочь в создании руководств для разработчиков, ознакомьтесь со страничкой проекта в `GitLab <https://gitlab.com/ubports/apps/development-resources> `__.

source: Push notifications
de: Push-Benachrichtigungen
es: Envío de notificaciones
ru: Push-уведомления

source: Let's assume that you have an app created with Clickable and published on the OpenStore. But now you want to be able to send Push Notifications to your users. First of all, you need to understand how this is working:
ru: Предположим, у Вас есть приложение, созданное с помощью Clickable и размещенное в OpenStore. Но теперь Вы хотите отправлять Push-уведомления своим пользователям. Прежде всего, нужно понять, как это работает:

source: Every app which uses push notifications has got a unique token. This token identifies the user, the device and the app itself. The token is generated by the UBports Push Service.
ru: Каждое приложение, которое использует push-уведомления, имеет уникальный токен. Этот токен идентифицирует пользователя, устройство и само приложение. Маркер генерируется службой UBports Push.

source: You will need the token to send a push notification. So the app sends its token to the app developer's server.
ru: Для отправки push-уведомления потребуется токен. Таким образом, приложение отправляет свой токен на сервер разработчика приложения.

source: With the token you can send a HTTP request to the UBports Push Server which will forward the notification the user's device.
ru: С помощью токена можно отправить HTTP-запрос на UBports Push Server, а он перенаправит уведомление на устройство пользователя.

source: Let's practice this step-by-step.
ru: Давайте попробуем повторить этот алгоритм шаг за шагом.

source: In the following example we will not implement a server. Also the communication between your app and your server is up to you. Please inform the user about the communication with your server by providing a privacy policy!
ru: В следующем примере мы не будем заниматься настройками сервера. Связь между приложением и сервером зависит от вас. Пожалуйста, сообщите пользователю о соединении с сервером и попросите у него согласие с политикой конфиденциальности!

source: Make the app ready for push notifications
ru: Подготовьте приложение к работе с push-уведомлениями

source: Implementing the PushClient
ru: Настройка PushClient

source: First we need to add the policy group "push-notification-client". Your apparmor file could look like this:
ru: Сначала нам нужно добавить группу политик «push-messages-client». Ваш файл для apparmor может выглядеть так:

source: In the next step we need to modify the Qml parts. We need to add a pushclient component:
ru: Далее нам нужно внести изменения в Qml. Добавляем компонент pushclient:

source: You need to set the correct appId! If the app name in your manifest file is myapp.yourname and the name of the main hook (the one which handles the .desktop file) is hookname, then the appId is: myapp.yourname_hookname. When we now start the app, it will get a token and print this token in the logs. With clickable logs we will be able to copy this token out of the terminal. But the app is not yet ready to receive a push notification. For this we need something called a pushhelper!
ru: Необходимо указать правильный appId! Если имя приложения в файле манифеста - myapp.yourname, а имя основного обработчика (которое обрабатывает файл .desktop) - это имя_хука, тогда appId будет такой: myapp.yourname_hookname. Когда мы запустим приложение, оно получит токен и запишет его в лог-файл. Из лог-файлов для clickable можно скопировать этот токен в терминале. Но приложение еще не готово для получения push-уведомления. Для этого нам понадобится pushhelper!

source: Implementing the pushhelper
ru: Реализация pushhelper

source: The pushhelper is a part of the app which will receive all push notifications and process them before sending them to the system notification center. It will receive a json-file and must output another json-file in the correct format. The pushhelper is seperated from the app. So we need a new hook in the manifest. It could look like this:
ru: Pushhelper - это часть приложения, которая будет получать все push-уведомления и обрабатывать их перед отправкой в центр системных уведомлений. Pushhelper получит json-файл и должен вывести другой json-файл в правильном формате. Pushhelper отделен от приложения. Итак, нам нужен новый hook в файле manifest. Это может выглядеть так:

source: It should be clear that we now need a different apparmor file and a different executable file. The **push-apparmor.json** file must only contain the policy group push-notification-client and should look like this:
ru: Должно быть понятно, что теперь нужен другой файл apparmor и другой исполняемый файл. Файл ** push-apparmor.json ** должен содержать только группу политик push-messages-client и должен выглядеть следующим образом:

source: The **push.json** is for redirecting to the executable file:
ru: Файл ** push.json ** предназначен для перенаправления в исполняемый файл:

source: In our tutorial we will use python to create a executable named **pushexec** which will forward the notification without changing anything:
ru: В нашем уроке используется python для создания исполняемого файла ** pushexec **. Файл будет пересылать уведомление без каких-либо изменений:

source: We also need to add this new files to the **CMakeLists.txt** and make the pushexec executable::
ru: Нам также нужно добавить новые файлы в ** CMakeLists.txt ** и сделать исполняемый файл pushexec::

source: Now the app is ready to receive and process push notifications!
ru: Теперь приложение готово для получения и обработки push-уведомлений!

source: Using the Push Service API
ru: Использование API сервиса Push

source: So now you have the token and the app is ready to receive and process push notifications. To send a notification, you need to send a HTTP request to this address: https://push.ubports.com/notify The content-type must be application/json and it must fit in the correct format. A example in javascript could look like this:
ru: Теперь у нас есть токен, и приложение готово для получения и обработки push-уведомлений. Чтобы отправить уведомление, нужно отправить HTTP-запрос по этому адресу: https://push.ubports.com/notify. Тип содержимого должен быть application/json в соответствующем формате. Пример в javascript может выглядеть так:

source: Push Notification Object
ru: Объект Push Notification

source: Parameter
ru: Параметр

source: Type
ru: Тип

source: Description
de: Beschreibung
ru: Описание

source: appid
ru: appid (идентификатор приложения)

source: string
ru: строка

source: Required. ID of the application that will receive the notification,
ru: Обязательный параметр. ID приложения, которое получит уведомление,

source: as described in the client side documentation.
ru: как это описано в документации для клиентской части.

source: expire_on
ru: expire_on (истечение срока действия)

source: Required. Expiration date/time for this message, in
ru: Обязательный параметр. Срок (время и дата) истечения для этого сообщения, в

source: `ISO8601 Extendendformat <https://www.w3.org/TR/NOTE-datetime>`_.
ru: формате `ISO8601 Extendendformat <https://www.w3.org/TR/NOTE-datetime>`_.

source: token
ru: токен

source: Required. The token identifying the user+device to which the message is
ru: Обязательный параметр. Токен, идентифицирующий пользователя и устройство, которому предназначено сообщение

source: directed, as described in the client side documentation.
ru: как это описано в клиентской части документации.

source: clear_pending
ru: clear_pending (очистка незавершенного)

source: Discards all previous pending notifications. Usually in response to
ru: Отменяет все предыдущие ожидающие уведомления. Обычно в ответ на

source: getting a "too-many-pending" error. Defaults to false.
ru: ошибку "too-many-pending". По умолчанию отключена.

source: replace_tag
ru: replace_tag (заменить тэг)

source: If there's a pending notification with the same tag, delete it before
ru: Если есть ожидающее уведомление с тем же тегом, удалите его

source: queuing this new one.
ru: в очереди появится это новое сообщение.

source: data
ru: данные

source: Data
ru: Данные

source: A JSON object. The contents of the data field are arbitrary. We can use
ru: Объект JSON. Содержимое поля данных является произвольным. Мы можем использовать

source: it to send any data to the app.
ru: его для отправки любых данных в приложение.

source: notification
ru: уведомление

source: Notification
ru: Уведомление

source: A JSON object which defines how this notification will be presented.
ru: Объект JSON, который определяет, как будет представлено это уведомление.

source: message
de: Nachricht
ru: сообщение

source: object
de: Objekt
ru: объект

source: A JSON object that is passed as-is to the application via PopAll.
ru: Объект JSON, который передается приложению в состоянии "как есть" через PopAll.

source: tag
ru: tag (тэг)

source: The tag of the push notification.
de: der "Tag" der Push-Benachrichtigungen.
ru: Тэг push-уведомления.

source: sound
de: Klang
ru: звук

source: bool or string
de: Bool oder String
ru: логическая опция или путь к объекту

source: This is either a boolean (play a predetermined sound) or the
ru: Эта опция или задается логически (воспроизведение предустановленной мелодии), или

source: path to a sound file. The user can disable it, so don't rely
ru: путь к звуковому файлу. Пользователь может выключить опцию, поэтому не доверяйте

source: on it exclusively. Defaults to empty (no sound). The path is
ru: этой опции полностью. По умолчанию отключена (звука нет). Путь

source: relative, and will be looked up in (a) the application's
ru: относительный, и будет задаваться (a) в разделе настроек приложения

source: ``.local/share/<pkgname>``, and (b) standard xdg dirs.
de: ``.local/share/<pkgname>``, und (b) standard xdg Verzeichnisse.
ru: ``.local/share/<pkgname>``, и (b) в стандартных директориях xdg.

source: vibrate
ru: вибрация

source: bool or Vibrate
de: Bool oder vibrate
ru: bool или Вибрация

source: The notification can contain a vibrate field, causing haptic
ru: В уведомлении может содержаться поле для вибрации, вызывающей тактильную

source: feedback, which can be either a boolean (if true, vibrate a
ru: обратную связь, опция может быть логической (если активирована, идет вибрация

source: predetermined way) or an Vibrate object.
ru: в заранее заданном режиме) или может быть выбран готовый объект.

source: emblem-counter
ru: еmblem-счетчика

source: Emblem-counter
ru: Еmblem-счетчика

source: A JSON object, which defines how to display the emblem
ru: Объект JSON, который определяет, как отображать эмблему

source: counter.
de: Zähler.
ru: счетчика.

source: card
ru: карточка

source: Card
ru: Карточка

source: A JSON object with information about the notification card.
ru: Объект JSON с информацией о карточке уведомления.

source: summary
ru: краткое резюме

source: Required. A title. The card will not be presented if this is
ru: Обязательно к заполнению. Карточка не будет видна, если это поле

source: missing.
ru: не заполнено.

source: body
ru: содержание

source: Longer text, defaults to empty.
ru: Более длинный текст, пустой по умолчаниюю.

source: actions
ru: действия

source: array
ru: массив

source: If empty (the default), a bubble notification is
ru: Если пустое (по умолчанию), нажатие на bubble notification

source: non-clickable. If you add a URL, then bubble notifications
ru: не даёт ничего. Если Вы добавите адрес URL, то bubble notifications

source: are clickable and launch that URL. One use for this is using
ru: становятся активными и позволяют открыть этот URL. Один из способов это использовать -

source: a URL like ``appid://com.ubuntu.developer.ralsina.hello``
ru: настроить URL как``appid://com.ubuntu.developer.ralsina.hello``,

source: which will switch to the app or launch it.
ru: это позволит переключиться на приложение или запустит его.

source: icon
ru: иконка

source: An icon relating to the event being notified. Defaults to
ru: Иконка относится к событию, к которому относится уведомление. По умолчанию,

source: empty (no icon); a secondary icon relating to the application
ru: значение пустое (иконка отсутствует); дополнительная иконка относится к приложению

source: will be shown as well, regardless of this field.
ru: будет также отображаться, независимо от настроек этого поля.

source: timestamp
ru: Метка времени (timestamp)

source: integer
ru: integer - целое число

source: Seconds since the unix epoch, only used for persist for now.
ru: Секунды, прошедшие с начала эпохи Unix, пока используются только для сохранения.

source: If zero or unset, defaults to current timestamp.
ru: Если значение не задано или нулевое, то используется текущая временная отметка.

source: persist
ru: сохраняться

source: Whether to show in notification centre; defaults to false.
ru: показывать ли в центре уведомлений; по умолчанию отключено.

source: popup
ru: всплывающее окно

source: Whether to show in a bubble. Users can disable this, and can
ru: Показывать ли в bubble notification. Пользователи могут отключить это, и могут

source: easily miss them, so don't rely on it exclusively. Defaults
ru: легко отключить их, поэтому не нужно полагаться на эту опцию. Значения по умолчанию -

source: to false.
ru: опция отключена.

source: Vibrate
ru: Вибрация

source: pattern
ru: модель

source: A list of integers describing a vibration pattern (duration of alternating
ru: Список переменных, описывающих схемы вибрации (длительность периодов

source: vibration/no vibration times, in milliseconds).
ru: вибраций или её отсутствие - время в милисекундах).

source: repeat
ru: повторения

source: Number of times the pattern has to be repeated (defaults to 1, 0 is the
ru: Сколько раз будет повторяться выбранняя модель (по умолчанию установлен 1 раз, 0 -

source: same as 1).
ru: тоже самое, что и 1).

source: Emblem-Counter
ru: Emblem-счетчика

source: count
ru: число

source: A number to be displayed over the application's icon in the launcher.
ru: Число, отображаемое над значком приложения в панели запуска (launcher).

source: visible
ru: видимо

source: Set to true to show the counter, or false to hide it.
ru: Установите значение true, чтобы показать счетчик, или false, чтобы скрыть его.

source: User Metrics
ru: Пользовательские метрики

source: What are User Metrics?
ru: Что такое "Пользовательские метрики"?
