Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: ``ContentHandler.Source`` (The app selected is going to be the source of the file imported)
es: ``ContentHandler.Source`` (La aplicación seleccionada va a ser el origen del archivo importado)

source: ``ContentHandler.Destination`` (The app selected is going to be the destination of the file exported)
es: ``ContentHandler.Destination`` (La aplicación seleccionada va a ser el destino del archivo exportado)

source: ``ContentHandler.Share`` (The app selected is going to be the app from witch the file is going to be shared from)
es: ``ContentHandler.Share`` (La aplicación seleccionada va a ser la aplicación desde la que se va a compartir el archivo)

source: Similarly, tapping on the share icon will allow us to send the saved game through Telegram to ourselves (`see the Webapp Creator Import Page source code <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_).
es: De manera similar, pulsando en el icono para compartir nos permitirá enviar el juego guardado a través de Telegram a nosotros mismos (`ver el código fuente de la página de importación de Webapp Creator <https://gitlab.com/cibersheep/webapp-creator/blob/master/webapp-creator/app/ImportPage.qml#L38>`_).

source: The only difference between this and the previous code is that ``handler`` is ``ContentHandler.Share``
es: La única diferencia entre esto y el código previo es que ``handler`` es ``ContentHandler.Share``

source: In the main qml file, we need to add some code to know what to do with the dispatched URL. First add an `Arguments element <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L189>`_ that holds the URL, as is done, for example, in the `Linphone app <https://open-store.io/app/linphone.cibersheep>`_. Also, we add `connection to the URI Handler <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L200>`_ with a Connection element with ``UriHandler`` as a target.
es: Necesitamos añadir en el archivo qml principal algo de código para saber qué hacer con la URL enviada. Primero añada un `elemento «Arguments» <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L189>`_ que sostenga la URL, como se hace por ejemplo en la `aplicación Linphone <https://open-store.io/app/linphone.cibersheep>`_. Además, añadimos `una conexión al manipulador de la URI <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L200>`_ con un elemento «Connection» con ``UriHandler`` como objetivo.

source: This code will manage a URI in the form ``linphone://sip:xxx@xxx.xx`` when the app is opened. But what do we need to do to handle this link when the app is closed?
es: Este código manejará una URI en forma de ``linphone://sip:xxx@xxx.xx`` cuando se abre la aplicación. Pero ¿qué necesitamos hacer para manejar este enlace cuando se cierra la aplicación?

source: We need to add a little bit `extra code <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L69>`_ that will cover two cases: 1) We receive one URL 2) We receive more than one URL
es: Necesitamos añadir un poco de `código extra <https://gitlab.com/ubports-linphone/linphone-simple/blob/master/qml/Main.qml#L69>`_ que cubrirá dos casos: 1) Recibimos una URL 2) Recibimos más de una URL

source: The Qt header ``QStandardPaths`` provides the app's writable locations:
es: La cabecera de Qt ``QStandardPaths``proporciona las ubicaciones editables de la aplicación:

source: The Qt module `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ provides the QStandardPaths in QML. Unfortunately it is not available on Ubuntu Touch, yet. Probably you don't want to ship that module with your app. Instead, you could simply let your C++ plugin provide the paths to your QML part. Therefore, add these methods to your plugin class:
es: El módulo de Qt `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ proporciona el «QStandardPaths» en QML. Por desgracia aún no está disponible en Ubuntu Touch. Posiblemente no querrá enviar ese módulo con su aplicación. En su lugar, puede dejar simplemente que su extensión de C++ proporcione las rutas a su parte de QML. Por lo tanto, añada estos métodos a su clase de extensiones («plugin class»):

source: Assuming the name of your plugin is MyPlugin, you can access these paths in QML:
es: Suponiendo que el nombre de su extensión es «MyPlugin», puede acceder estas rutas en QML:

source: Welcome to an open source and free platform under constant scrutiny and improvement by a vibrant global community, whose energy, connectedness, talent and commitment is unmatched. Ubuntu is also the third most deployed desktop OS in the world.
es: Bienvenida/o a una plataforma de fuente abierta y gratuita bajo escrutinio y mejora constantes por parte de una vibrante comunidad global, cuya energía, conectividad, talento y compromiso no tienen comparación. Ubuntu es también el tercer sistema operativo de escritorio más implementado en el mundo.

source: Get started
es: Comenzar

source: Ubuntu Touch is a fun and vibrant platform for development. Whether you're a new developer or an experienced one, we have several resources to help you get started.
es: Ubuntu Touch es una plataforma vibrante y divertida para el desarrollo. Tanto si es un desarrollador nuevo como uno experimentado, tenemos varios recursos para ayudarle a comenzar.

source: Ubuntu Touch supports several different types of apps. :ref:`Native apps <nativeapp>` are apps with interfaces made using QML or HTML with their behavior defined in JavaScript, C++, Python, or Go. :ref:`Web apps <webapp>` are special containers to run websites in.
es: Ubuntu Touch soporta varios tipos diferentes de aplicaciones. :ref:`Aplicaciones nativas <nativeapp>` son aplicaciones con interfaces hechas usando QML o HTML, con su comportamiento definido en JavaScript, C++, Python o Go. :ref:`Aplicaciones web <webapp>` son contenedores especiales donde se ejecutan sitios web.

source: Community
es: Comunidad

source: Have questions that aren't answered in the docs or want to chat with other Ubuntu Touch developers? Join our `app dev Telegram group <https://t.me/UbuntuAppDevEN>`_ or chat with us on the `UBports app dev forum <https://forums.ubports.com/category/35/app-development>`_.
es: ¿Tiene preguntas que no son contestadas en la documentación o quiere charlar con otros desarrolladores de Ubuntu Touch? Únase a nuestro `grupo en Telegram de desarrollo de aplicaciones <https://t.me/UbuntuAppDevEN>`_ o charle con nosotros en el `foro de desarrollo de aplicaciones en UBports <https://forums.ubports.com/category/35/app-development>`_.

source: Tools
es: Herramientas

source: More Documentation
es: Más documentación

source: content_exchange
es: «content_exchange» (intercambio de contenido)

source: content_exchange_source
es: «content_exchange_source» (fuente de intercambio de contenido)

source: document_files
es: «document_files» (archivos de documentos)

source: push-notification-client
es: «push-notification-client» (cliente de envío de notificaciones)

source: video_files
es: «video_files» (archivos de vídeo)

source: All Ubuntu apps and scopes are confined respecting AppArmor access control mechanism (see `Application Confinement <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_) , meaning they only have access to their own resources and are isolated from other apps and parts of the system. The developer must declare which policy groups are needed for the app or scope to function properly with an apparmor ``.json`` file.
es: Todas las aplicaciones y «scopes» de Ubuntu están confinadas respetando el mecanismo de control de acceso de «AppArmor» (vea `Confinamiento de aplicaciones <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_) , esto significa que solo tienen acceso a sus propios recursos y están aisladas de otras aplicaciones y partes del sistema. El desarrollador debe declarar que grupos de políticas se necesitan para la aplicación o «scope» para funcionar correctamente con un archivo ``.json`` de «apparmor».

source: Tip: Make sure to fully specify the subdomain in your starting URL, that is, use http://www.ubuntu.com instead of www.ubuntu.com. Not specifying the subdomain would create an ambiguous URL and thus introduces security concerns. More complex wildcard patterns
es: Consejo: asegúrese de especificar completamente el subdominio en su URL de inicio, esto es, use http://www.ubuntu.com en vez de www.ubuntu.com. No especificar el subdominio podría crear una URL ambigua y así introducir problemas de seguridad. Patrones comodín más complejos

source: Many URLs have one or more subdomains. (For example, in the following, “developer” is the subdomain: developer.ubuntu.com.) You can allow access to a single subdomain (and all of its subpages) with a pattern like this:::
es: Muchas URLs tienen uno o más subdominios. (Por ejemplo, en lo siguiente, «developer» es el subdominio: developer.ubuntu.com). Puede permitir acceso a un solo subdominio (y a todas sus sub-páginas) con un patrón como este:::

source: The webapp experience is contained and isolated from the browser data point of view. That is webapps do not access data from any other installed browser, such as history, cookies and so on. Other browser on the system do not access the webapp’s data. Storage
es: La experiencia de la aplicación web está contenida y aislada desde el punto de vista de los datos del navegador. Esto es, las aplicaciones web no acceden a los datos desde ningún otro navegador instalado, como historial, «cookies» y así. Otro navegador en el sistema no accede a los datos de la aplicación web. Almacenamiento
