Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: You can still install the SDK IDE in Ubuntu 16.04, but it is not guaranteed to work correctly. You can use the following commands to install::
de: Sie können die SDK-IDE weiterhin in Ubuntu 16.04 installieren, aber es wird nicht garantiert, dass sie korrekt funktioniert. Sie können die folgenden Befehle zur Installation verwenden::
es: Aún puede instalar el «SDK IDE» en Ubuntu 16.04 pero no está garantizado que funcione correctamente. Puede usar las siguientes órdenes para instalarlo::
ru: Можно заниматься разработкой программ в среде IDE SDK в Ubuntu 16.04, но это не гарантирует правильной работы. Используйте следующие команды для установки:

source: Guides
de: Handbücher
es: Guías
ru: Руководства

source: Get started building your first app or learn about advanced concepts with our :ref:`Developer guides <devguides>`.
de: Beginnen Sie mit dem Bau Ihrer ersten App oder lernen Sie mehr über fortgeschrittene Konzepte mit unseren :ref:`Developer Guides <devguides>`.
es: Comience a construir su primera aplicación o aprenda sobre conceptos avanzados con nuestras :ref:`guías para desarrolladores <devguides>`.
ru: Начните создавать свое первое приложение или подробно изучите :ref:`Руководство разработчика <devguides>` для опытных программистов.

source: Publishing
de: Veröffentlichung
es: Publicación
ru: Публикация приложения

source: After you are done building your app, distribute it on the `OpenStore <https://open-store.io/>`__ with our :ref:`Publishing guides <publishing>`.
de: Nachdem Sie mit dem Erstellen Ihrer App fertig sind, veröffentlichen Sie sie auf dem `OpenStore <https://open-store.io/>`__ mit unseren :ref:`Publishing Guides <publishing>`.
es: Después de finalizar la construcción de su aplicación, distribúyala en `OpenStore <https://open-store.io/>`__ con nuestras :ref:`guías de publicación <publishing>`.
ru: После того как приложение будет скомпилировано, опубликуйте его в магазине приложений `OpenStore <https://open-store.io/> `_ согласно рекомендациям :ref:`Руководства по публикации <publishing> `.

source: Documentation
de: Dokumentation
es: Documentación
ru: Документация

source: It is possible to develop cross-platform apps that don't depend on Ubuntu specific APIs, although this is not the official way of developing apps for Ubuntu Touch. If running on other operating systems is an requirement for your app, you can refer to this APIs instead:
ru: Можно создавать кроссплатформенные приложения, которые не зависят от конкретных API-интерфейсов Ubuntu, хотя это не является официальным способом разработки приложений для Ubuntu Touch. Если приложение должно работать в других операционных системах, используйте следующие API:

source: Platform
de: Plattform
es: Plataforma
ru: Платформа

source: Sample apps
de: Beispiel-Apps
es: Aplicaciones de muestra
ru: Примеры приложений

source: Learn more about app development by digging into our :ref:`Sample apps <sampleapps>`.
de: Erfahren Sie mehr über die Entwicklung von Apps, indem Sie sich in unsere :ref:`Beispiel-Apps <sampleapps>` einarbeiten.
es: Aprenda más sobre desarrollo de aplicaciones investigando en nuestras :ref:`aplicaciones de muestra <sampleapps>`.
ru: Подробнее узнать о создании приложений можно в главе :ref:`Демонстрационные программы <sampleapps>`.

source: Preinstalled apps
de: Vorinstallierte Apps
es: Aplicaciones pre-instaladas
ru: Предустановленные приложения

source: The :doc:`/contribute/preinstalled-apps` page has information on developing the apps which are included with Ubuntu Touch.
de: Die Seite :doc:`/contribute/preinstalled-apps` enthält Informationen zur Entwicklung der Apps, die in Ubuntu Touch enthalten sind.
es: La página :doc:`/contribute/preinstalled-apps` contiene información sobre el desarrollo de aplicaciones que están incluidas con Ubuntu Touch.
ru: В разделе :doc:`/contribute/preinstalled-apps` содержится информация о разработке и работе приложений, поставляющихся с ОС Ubuntu Touch.

source: Native applications
de: Native Anwendungen
es: Aplicaciones nativas
ru: Нативные приложения

source: The recommended way to build a native application on Ubuntu Touch is to use the `Qt <https://doc.qt.io/>`__ framework ( current version shipped on Ubuntu Touch 16.04 is Qt 5.9.5 ). You do not have to stick with the traditional C++<->QML Qt model, you can use also Python, Go, Rust or even Javascript for your backend.
ru: Для создания нативных приложений в Ubuntu Touch рекомендуется использовать инфраструктуру `Qt <https://doc.qt.io/>` __ (в Ubuntu Touch 16.04 поставляется с версией Qt 5.9.5). при создании своего приложения не нужно придерживаться традиционной модели C ++ <-> QML Qt, можно использовать Python, Go, Rust или даже Javascript.

source: Ubuntu Touch provides a subset of Qt QML components to ease the development of your app : `QML API <https://api-docs.ubports.com/sdk/apps/qml/index.html>`__ and Icons: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/>`__, but you can also ship your cross platform app using standard Qt QML QtQuick2 components.
ru: Для упрощения разработки в Ubuntu Touch уже есть множество компонентов Qt QML: `QML API <https://api-docs.ubports.com/sdk/apps/qml/index.html>` __ и набор иконок: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/> `__. Но можно так же создавать кроссплатформенное приложение, используя стандартные компоненты Qt QML QtQuick2.

source: You can use `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ to facilitate Packaging, deploying, publishing and tests .
de: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ Kommandozeilenprogramm.
ru: Для сборки, тестирования и распространения программы можно использовать `Clickable <http://clickable.bhdouglass.com/en/latest/>` _ .

source: Check out informations about the platform and confinement model in :ref:`Platform <platform>` section
ru: Ознакомьтесь с информацией о платформе и модели ограничения в разделе: ref: `Платформа <platform>`

source: AppArmor Policy Groups
de: AppArmor-Richtliniengruppen
es: Grupos de políticas de «AppArmor»
ru: Политики групп AppArmor

source: This document contains a full list of Ubuntu Touch's available policy groups and a description of what they give your app permission to access.
de: Dieses Dokument enthält eine vollständige Liste der verfügbaren Richtliniengruppen von Ubuntu Touch und eine Beschreibung, was sie Ihrer App die Berechtigung zum Zugriff geben.
es: Este documento contiene una lista completa de los grupos de políticas disponibles en Ubuntu Touch y una descripción de a qué dan permiso para acceder a su aplicación.
ru: В этом документе содержится полный список доступных групп политик Ubuntu Touch и описание того, что они дают приложению при запросе прав доступа к устройству.

source: Each entry follows this format
de: Jeder Eintrag folgt diesem Format
es: Cada entrada sigue este formato
ru: Каждая запись соответствует этому формату

source: Policy usage affects whether your app will be accepted by the OpenStore. Apps containing policies with common usage are generally accepted immediately, while reserved usage policies will need to be manually reviewed.
de: Die Verwendung von Richtlinien beeinflusst, ob Ihre App vom OpenStore akzeptiert wird. Apps, die Richtlinien mit allgemeiner Nutzung enthalten, werden im Allgemeinen sofort akzeptiert, während reservierte Nutzungsrichtlinien manuell überprüft werden müssen.
es: El uso de la política afecta a si su aplicación será aceptada o no por OpenStore. Las aplicaciones que contienen políticas de uso común son aceptadas generalmente de inmediato, mientras que las políticas de uso reservado necesitarán ser revisadas manualmente.
ru: Использование политики влияет на то, будет ли приложение опубликовано в OpenStore. Приложения, работающие с политиками общего пользования, обычно размещаются немедленно. Приложения без политик необходимо будет проверять вручную.

source: Coding tip: Everytime you change your apparmor policy file you need to update your app's version for this to be taken into account.
ru: Совет: каждый раз, когда выиз меняете файл политики apparmor, необходимо обновлять версию приложения, чтобы политика заработала корректно.

source: accounts
de: Konten
es: cuentas
ru: accounts (учётные записи)

source: Description: Can use Online Accounts.
de: Beschreibung: Kann Online-Konten verwenden.
es: Descripción: puede usar cuentas en línea.
ru: Описание: Можно использовать онлайн-аккаунты.

source: Usage: common
de: Verwendung: häufig
es: Uso: común
ru: Использование: на общих основаниях

source: The accounts policy gives your app the permissions it needs to access the `Online Accounts API`_.
de: Die Richtlinie accounts gibt Ihrer App die Berechtigungen, die sie benötigt, um auf die `Online Accounts API`_ zuzugreifen.
es: La política de cuentas otorga a su aplicación los permisos que necesita para acceder a la `Online Accounts API`_ (API de cuentas en línea).
ru: Политика учетных записей дает приложению разрешения, необходимые для доступа к `API онлайн-аккаунтов`_.

source: audio
es: sonido
ru: audio (аудио)

source: Description: Can play audio (allows playing remote content via media-hub)
de: Beschreibung: Kann Audio wiedergeben (ermöglicht die Wiedergabe von Remote-Inhalten über den Media-Hub)
es: Descripción: puede reproducir sonido (permite la reproducción de contenido remoto vía «media-hub»)
ru: Описание: Возможность воспроизведения аудио (позволяет воспроизводить удаленный контент через медиа-хаб)

source: The audio policy is needed for your app to play audio via pulseaudio or media-hub. The permission also gives it the ability to send album art to the thumbnailer service, which is then shown on the sound indicator.
de: Die Richtlinie audio wird benötigt, damit Ihre App Audio über Pulsaudio oder Media-Hub wiedergeben kann. Die Berechtigung gibt ihm auch die Möglichkeit, Albumcover an den Thumbnailer-Dienst zu senden, der dann auf der Tonanzeige angezeigt wird.
es: La política de sonido la necesita su aplicación para reproducir sonido vía «pulseaudio» o «media-hub». El permiso también concede la habilidad de enviar carátulas de álbum al servicio de imágenes en miniatura, que luego se muestran en el indicador de sonido.
ru: Аудио политика позволяет приложению корректно воспроизводить аудио-потоки а через pulseaudio или медиа-хаб. Так же приложение сможет отправлять фотографии обложки альбомов в службу thumbnailer и показывать их на экране аудиоплеера.

source: Description: Use bluetooth (bluez5) as an administrator.
de: Beschreibung: Verwenden Sie Bluetooth (bluez5) als Administrator.
es: Descripción: use bluetooth (bluez5) como administrador.
ru: Описание: Использовать интерфейс bluetooth (bluez5) с правами администратора.

source: Usage: reserved
de: Verwendung: reserviert
es: Uso: reservado
ru: Использование: зарезервировано

source: This policy grants unrestricted access to Bluetooth devices. It is provided for administration of bluetooth and as a stepping stone towards developing a safe bluetooth API all apps can access.
de: Diese Richtlinie gewährt uneingeschränkten Zugriff auf Bluetooth-Geräte. Es wird für die Administration von Bluetooth und als Sprungbrett zur Entwicklung einer sicheren Bluetooth-API zur Verfügung gestellt, auf die alle Apps zugreifen können.
es: Esta política otorga acceso ilimitado a los dispositivos Bluetooth. Se proporciona para la administración de bluetooth y como un trampolín para el desarrollo de una API de bluetooth segura que puedan acceder todas las aplicaciones.
ru: Эта политика предоставляет неограниченный доступ к устройствам Bluetooth. Она предназначена для администрирования bluetooth и может использоваться как основа для разработки безопасного API bluetooth, к которому могут получить доступ все приложения.

source: calendar
de: Kalender
es: calendario
ru: calendar (календарь)

source: Description: Can access the calendar.
de: Beschreibung: Kann auf den Kalender zugreifen.
es: Descripción: puede acceder al calendario.
ru: Описание: доступ к календарю.

source: Calendar grants access to the Evolution dataserver's calendar and alarms APIs. It also grants access to sync-monitor.
de: Calendar gewährt Zugriff auf die Kalender- und Alarm-APIs des Evolution Datenserver. Es gewährt auch Zugriff auf den Sync-Monitor.
es: El calendario otorga acceso al servidor de datos del calendario y las APIs de alarmas de Evolution. También concede acceso a «sync-monitor».
ru: Предоставляется доступ к API-интерфейсу календаря, сигнализации Evolution, а также к монитору синхронизации.

source: This policy is reserved since it grants free access to all calendars on the device at any time. The legacy bug about this situation is `LP #1227824`_ .
de: Diese Richtlinie ist reserviert, da sie jederzeit freien Zugriff auf alle Kalender auf dem Gerät gewährt. Der alte Fehler in dieser Situation ist `LP #1227824`_ .
es: Esta política está reservada ya que concede acceso libre a todos los calendarios en el dispositivo en cualquier momento. El informe del error heredado de esta situación es `LP #1227824`_ .
ru: Эта политика зарезервирована, так как она всегда предоставляет свободный доступ ко всем календарям на устройстве. Ошибка старая, номер баг-репорта -`LP # 1227824`_.

source: camera
de: Kamera
es: cámara
ru: camera (камера)

source: Description: Can access the camera(s)
de: Beschreibung: Kann auf die Kamera(s) zugreifen
es: Descripción: puede acceder a la(s) cámara(s)
ru: Описание: доступ к камере устройства

source: The camera policy grants access to device cameras.
de: Die Richtlinie camera gewährt Zugriff auf Gerätekameras.
es: La política de la cámara permite acceder a las cámaras del dispositivo.
ru: Эта политика устанавливает правила предоставления доступа к камерам устройства.

source: connectivity
de: Konnektivität
es: conectividad
ru: connectivity (подключаемость)

source: Description: Can access coarse network connectivity information
de: Beschreibung: Kann auf grobe Netzwerkverbindungsinformationen zugreifen
es: Descripción: puede acceder a información de conectividad de red
ru: Описание: Может давать доступ к информации о связи устройств в сети

source: The connectivity policy allows apps to determine rough information about the device's connectivity. This includes whether the device is connected to the Internet and whether it is connected via a Wi-Fi or mobile data connection.
de: Die Richtlinie connectivity ermöglicht es Apps, grobe Informationen über die Konnektivität des Geräts zu ermitteln. Dazu gehört, ob das Gerät mit dem Internet verbunden ist und ob es über eine Wi-Fi- oder mobile Datenverbindung verbunden ist.
es: La política de conectividad permite a las aplicaciones determinar información aproximada sobre la conectividad del dispositivo. Esto incluye tanto si el dispositivo está conectado a Internet como si está conectado vía wifi o conexión de datos móviles.
ru: Политика по связи позволяет приложениям получать приблизительную информацию о подключенных устройствах - есть ли у устройства доступ к Интернету и подключено ли оно через Wi-Fi или мобильную сеть.

source: contacts
es: contactos
ru: contacts (адресная книга)

source: Description: Can access contacts.
de: Beschreibung: Kann auf Kontakte zugreifen.
es: Descripción: puede acceder a contactos.
ru: Описание: доступ к адресной книге.

source: The contacts policy allows apps to access the device user's contacts list. It is marked as reserved because it allows access to sync-monitor and unfettered access to the address book.
de: Die Richtlinie contacts erlaubt es Apps, auf die Kontaktliste des Gerätebenutzers zuzugreifen. Er ist als reserviert gekennzeichnet, da er den Zugriff auf den Sync-Monitor und den ungehinderten Zugriff auf das Adressbuch ermöglicht.
es: La política de contactos permite a las aplicaciones acceder a la lista de contactos en el dispositivo del usuario. Está marcado como reservado porque permite el acceso a «sync-monitor» (monitor de sincronización) y acceso sin restricciones a la agenda de direcciones.
ru: Политика работы с адресной книгой позволяет приложениям получать доступ к адресной книге пользователя устройства. Политика зарезервирована, так как имеет доступ к службе синхронизации sync-monitor и адресной книге.

source: Description: Can request/import data from other applications
de: Beschreibung: Kann Daten aus anderen Anwendungen anfordern/importieren
es: Descripción: puede solicitar o importar datos de otras aplicaciones
ru: Описание: может запрашивать/импортировать данные из других приложений

source: Using the content_exchange policy allows your app to be a consumer of content on content-hub.
de: Die Verwendung der Richtlinie content_exchange ermöglicht es Ihrer App, ein Verbraucher von Inhalten auf dem Content-Hub zu sein.
es: Usar la política de «content_exchange» (intercambio de contenido) permite a su aplicación usar el contenido en el «content-hub» (centro de contenido).
ru: Использование политики content_exchange позволяет приложению потреблять контент на контент-хабе.

source: Description: Can provide/export data to other applications
de: Beschreibung: Kann Daten für andere Anwendungen bereitstellen/exportieren
es: Descripción: puede suministrar o exportar datos a otras aplicaciones
ru: Описание: может экспортировать/предоставлять данные другим приложениям

source: The content_exchange_source policy allows your app to provide content on content-hub.
de: Die Richtlinie content_exchange_source ermöglicht es Ihrer App, Inhalte auf dem Content-Hub bereitzustellen.
es: La política de «content_exchange_source» (fuente de intercambio de contenido) permite a su aplicación proporcionar contenido al «content-hub» (centro de contenido).
ru: Политика content_exchange_source позволяет приложению предоставлять свой контент на контент-хаб.

source: debug
es: depuración
ru: debug (режим отладки)

source: Description: Use special debugging tools. This should only be used in development and not for production packages. Note: use of this policy group provides significantly different confinement than normal and is not considered secure. You should never run untrusted programs using this policy group.
de: Beschreibung: Verwenden Sie spezielle Debugging-Tools. Dies sollte nur in der Entwicklung und nicht für Produktionspakete verwendet werden. Hinweis: Die Verwendung dieser Richtliniengruppe führt zu einer deutlich anderen Einschränkung als normal und gilt als nicht sicher. Sie sollten nicht vertrauenswürdige Programme niemals über diese Richtliniengruppe ausführen.
es: Descripción: uso de herramientas especiales de depuración. Esto debería usarse solo para desarrollo, no para paquetes en producción. Nota: el uso de este grupo de políticas proporciona un confinamiento significativamente diferente del normal y no se considera seguro. Nunca debería ejecutar programas que no sean de confianza usando esta grupo de políticas.
ru: Описание: использование средств для отладки. Должно использоваться только при разработке, а не для установки готовых пакетов. Примечание: использование этой группы политик снимает множество ограничений и поэтому не считается безопасным. Не следует запускать ненадежные программы с использованием этой группы политик.

source: Description: Can read and write to document files. This policy group is reserved for certain applications, such as document viewers. Developers should typically use the content_exchange policy group and API to access document files instead.
de: Beschreibung: Kann in Dokumenten lesen und schreiben. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. für Dokumentenbetrachter. Entwickler sollten stattdessen typischerweise die Richtliniengruppe content_exchange und die API verwenden, um auf Dokumente zuzugreifen.
es: Descripción: puede leer y escribir a archivos de documentos. Este grupo de políticas está reservado para determinadas aplicaciones, tales como visores de documentos. Los desarrolladores deberían usar habitualmente el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de documentos.
ru: Описание: чтение и запись файлов с документацией. Эта группа политик зарезервирована для определенных приложений, таких как средства просмотра документов. Разработчикам для доступа к файлам документации лучше использовать группу политик content_exchange и API.

source: This policy allows apps to read and write to the "Documents" folders in the user's home directory and external media.
de: Diese Richtlinie erlaubt es Apps, den Ordner "Documents" im home-Verzeichnis des Benutzers und in externen Medien zu lesen und zu schreiben.
es: Esta política permite a las aplicaciones leer y escribir a la carpeta «Documents» (documentos) en el directorio principal del usuario y en la unidad externa.
ru: Эта политика даёт приложению права на чтение и запись в папку «Документы», которая находится в домашнем каталоге пользователя или на внешних носителях.

source: document_files_read
es: «document_files_read» (leer archivos de documentos)
ru: document_files_read (чтение файлов документов)

source: Description: Can read all document files. This policy group is reserved for certain applications, such as document viewers. Developers should typically use the content_exchange policy group and API to access document files instead.
de: Beschreibung: Kann alle Dokumente lesen. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. für Dokumentenbetrachter. Entwickler sollten stattdessen typischerweise die Richtliniengruppe content_exchange und die API verwenden, um auf Dokumente zuzugreifen.
es: Descripción: puede leer todos los archivos de documentos. Este grupo de políticas está reservado para determinadas aplicaciones, tales como visores de documentos. Los desarrolladores deberían usar habitualmente el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de documentos.
ru: Описание: политика даёт возможность все файлы документов. Эта группа политик зарезервирована для определенных приложений - например, для просмотра документов. Разработчикам следует использовать для доступа к файлам документов группу политик content_exchange и API.

source: This policy allows apps to read the "Documents" folders in the user's home directory and external media.
de: Diese Richtlinie erlaubt es Apps, den Ordner "Documents" im home-Verzeichnis des Benutzers und in externen Medien zu lesen.
es: Esta política permite a las aplicaciones leer la carpeta «Documents» (documentos) en el directorio principal del usuario y en la unidad externa.
ru: Эта политика даёт приложениям права доступа в папку «Документы» в домашнем каталоге пользователя и на внешних носителях.

source: history
es: historial
ru: history (история действий пользователя)

source: Description: Can access the history-service. This policy group is reserved for vetted applications only in this version of the policy. A future version of the policy may move this out of reserved status.
de: Beschreibung: Kann auf den history-Service zugreifen. Diese Richtliniengruppe ist nur in dieser Version der Richtlinie für geprüfte Anwendungen reserviert. Eine zukünftige Version der Richtlinie kann diese aus dem reservierten Status herausführen.
es: Descripción: puede acceder a «history-service» (servicio de historial). Este grupo de políticas está reservado solo para aplicaciones revisadas en esta versión de la política. Una versión futura de la política podría mover esto fuera del estado reservado.
ru: Описание: дает доступ к сервису истории действий пользователя. Эта группа политик зарезервирована для проверенных приложений (актуально только для текущей версии политики). В будущем резервный статус может быть снят.

source: keep-display-on
es: «keep-display-on» (mantener la pantalla encendida)
ru: keеp-display-on
