Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: If you look on the lock screen, you will see a circle. Inside the circle is text. Look closer, and you’ll notice that the text contains data regarding the user’s activity. Double tap on the middle of the circle, and you will see more "metrics" about the user.
ru: Если вы посмотрите на экран блокировки, вы увидите круг. Внутри этого круга есть текст. Посмотрите внимательнее, и вы заметите, что текст содержит данные об активности пользователя. Дважды нажмите на середину круга, и увидите больше «метрик» о пользователе.

source: This shows "7 text messages sent today." How did it know?
ru: Там есть уведомление: "Сегодня было отправлено 7 текстовых сообщений." Откуда это известно?

source: This is from a 3rd-party application (`nCounter <https://gitlab.com/joboticon/ncounter/>`_) that makes use of the User Metrics feature.
ru: Информация поступает из стороннего приложения (`nCounter <https://gitlab.com/joboticon/ncounter/>`_), которая используется для работу функцию "User Metrics".

source: For the most part, these messages are quite clearly state what they are counting, and which app is related. But where do these metrics come from?
ru: По большей части в этих сообщениях достаточно четко указано, что какие данные они используют и какое приложение этим связано. Но откуда берутся эти метрики?

source: How can I use User Metrics in my application?
ru: Как я могу использовать пользовательские метрики в своём приложении?

source: All of the following information will be based on the code for `nCounter`_.
ru: Вся следующая информация будет основана на коде для приложения `nCounter`_.

source: Your app's apparmor file must include ``usermetrics`` in the policy:
ru: Файл apparmor приложения должен включать в политику параметр ``usermetrics`` :

source: Next, you will need to import the module in the QML file that will handle the User Metrics:
ru: Далее нужно будет импортировать в файл QML модуль для обработки метрики пользователя:

source: (There may be updated versions of this above 0.1)
ru: (Могут быть доступны обновленные версии выше 0.1)

source: Next, the specific Metric must be defined in the code as an object:
ru: Далее, выбранную Метрику нужно настроить в программном коде как объект:

source: Now that the metric is created, we can update the "format" or "emptyFormat" when an event takes place by referencing the variables in the Metric object.
ru: Теперь, когда метрика создана, можно обновить «format» или «emptyFormat», когда происходит событие, ссылаясь на переменные в объекте метрики.

source: Here we assign a new value to the circleMetric string variable that’s inside the Metric object:
ru: Здесь мы присваиваем новое значение строковой переменной circleMetric, которая находится внутри объекта метрики:

source: (Remember that circleMetric is the variable value assigned to format)
ru: (Помните, что circleMetric - это значение переменной, задаваемое в формате)

source: Metric Id [dot] Variable Name [equals] New variable information
ru: Metric Id [dot] Имя переменной [equals] Новые данные для переменной

source: ``metric.circleMetric = "New Metric Message"``
ru: ``metric.circleMetric = "Новое сообщение метрики"``

source: We then tell the lock screen to update the metric.
ru: Затем мы сообщаем экрану блокировки о том, что необходимо обновить метрику.

source: Metric ID [dot] update (specific amount to set if included in the format)
ru: Обновление Metric ID [dot] (определённое количество, которое необходимо установить, если оно включено в формат)

source: (Note: In this example, ``0`` is arbitrary since the metric value doesn't include a counter)
ru: (Примечание: в этом примере ``0``является произвольным значением, поскольку значение метрики не включает в себя счетчик)

source: We have now updated the metric for today. When the time rolls over to tomorrow, the metric will be reset to whatever is in ``emptyFormat``.
ru: Мы только что обновили метрику по состоянию на сегодня. Когда настанут следующие сутки, метрика будет сброшена к состоянию, указанному в опции `` emptyFormat``.

source: For most apps, this defaults to 0 counts for messages, calls, etc.
ru: Для сообщений, звонков и большинства приложений значение этой опции по умолчанию - 0.

source: How do User Metrics work?
ru: Как работает пользовательская метрика?

source: User Metrics are made up of two "formats":
ru: Пользовательская метрика состоит из двух "форматов":

source: metrics/messages for today (``format``)
ru: метрики/сообщения для текущих суток (``format``)

source: metrics/messages for tomorrow (``emptyFormat``)
ru: метрики сообщения для следующих суток (``emptyFormat``)

source: The value of ``emptyFormat`` is what displays on the lock screen when no value has been stored in ``format``. In order to display a new value of ``format`` the metric must be updated.
ru: Значение ``emptyFormat`` - это то, что отображается на экране блокировки, если в `` format`` не было сохранено никакого значения. Чтобы отобразить новое значение `` format``, метрику нужно обновить с помощью ``metric.update (x) `` (где x - это количество миллисекунд до обновления). Метрика будет сбрасываться каждый день обратно к значению, хранящемуся в ``emptyFormat``.

source: There are two options for updating the metric:
ru: Есть два способа обновления метрики:

source: Set the metric to a specific amount:
ru: Задайте в метрике определённое значение:

source: ``metricID.update(x)`` (where x is a number of type `double` to set for a counter value). ``metricID`` is the ``id:`` specified in the Metric item. The counter value can be included in the ``format`` setting by using ``%1``. e.g. ``format: "%1 buttons pressed today"``
ru: metricID.update (x) (где x - это число типа double, устанавливаемое для значения счетчика). metricID - это идентификатор, указанный в элементе Metric. Значение счетчика можно включить с помощью опции``format``с помощью переменной ``%1``. Например ``format: "% 1 кнопки, которые были нажаты сегодня" ``

source: Increment the metric:
ru: Увеличьте метрику:

source: ``metricID.increment(x)`` (where x is the amount to add to the current counter)
ru: ``metricID.increment(x)`` (где x - количество, которое нужно добавить к текущему счетчику)

source: The metric will reset back to the value stored in ``emptyFormat`` each day.
ru: Показатель будет сбрасываться до значения, сохраняемого в ``emptyFormat`` каждый день.

source: Applications make use of User Metrics by setting and updating the "formats" whenever a certain event takes place. e.g. When you press send in Telegram, or when you receive a phone call. The application may store the data for manipulation, but generally the data is stored in the system (`/var/lib/usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>`_).
ru: Приложения используют эту систему, но устанавливают и обновляют «форматы» метрик пользователя, выполняя определенный код всякий раз, когда происходит определенное событие. Например, когда вы отправляете сообщение в Telegram, или когда вы получаете телефонный звонок. Приложение может хранить данные для манипуляции, но обычно данные хранятся в системе (`/var/lib/usermetrics <https://github.com/ubports/libusermetrics/tree/xenial/doc/pages>` _) .

source: (See this `blog post <https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>`_ for a simple example)
ru: (Простой пример можно посмотреть `в этой статье <https://daker.me/2013/11/adding-usermetrics-to-your-app-on-ubuntu-touch.html>`_)

source: Limitations and wonders
ru: Ограничения и особенности

source: Once a metric is registered, it remains on the lock screen even after the app has been uninstalled. A database file (db) is stored in `/var/lib/usermetrics`, which can be deleted by root (but not with sudo). Deleting this file and rebooting will remove all stored metrics. Presumably, the db file could be edited instead of deleted.
ru: После регистрации метрика остается на экране блокировки даже после удаления приложения. Файл базы данных (db) хранится в папке `/var/lib/usermetrics`, который можно удалить только с правами root (команда sudo не поможет). Удаление этого файла и перезагрузка удалит все сохраненные метрики. Предположительно, файл db можно редактировать, а не удалять.

source: Based on how the "formats" are set up, it seems that it is difficult to maintain a running tally beyond one day (though not impossible. See `FluffyChat <https://gitlab.com/ChristianPauly/fluffychat>`_).
ru: Исходя из того, как настроены "форматы", кажется, что трудно поддерживать текущее состояние более одного дня (хотя и невозможно. Подробнее см. главу `FluffyChat <https://gitlab.com/ChristianPauly/fluffychat>`_).

source: In the case of the `nCounter`_ app. I wanted to count the number of days, but since the metric "resets" each day, that presents a problem. I created a workaround that updates the metric every time the application is opened. Thus, the ``emptyFormat`` (default) tells the user to open the application. This, however, nearly defeats the purpose of the metric entirely, other than having a neat stat reminder for the day.
ru: Особенность приложения `nCounter`_. Хочется посчитать количество дней, но поскольку метрика «сбрасывается» каждый день, это представляет проблему. Можно создать workaround, который обновляет метрику каждый раз, когда приложение открывается. Таким образом, ``emptyFormat`` (по умолчанию) говорит пользователю открыть приложение. Это, однако, почти полностью противоречит цели метрики пользователя, за исключением аккуратного напоминания о статистике за день.

source: There must be a way for a process to run independently in the background (e.g. cron) to retrieve data from a specific app code. One lead is the Indicator Weather app. This runs a process every X minutes to update the weather indicator automatically without having to open the app.
ru: Процесс должен запускаться независимо в фоновом режиме (например, cron) для извлечения данных из определенного кода приложения. Например, есть приложение Индикатор погоды. Оно запускает процесс каждые X минут для автоматического обновления индикатора погоды без необходимости открывать приложение.

source: Writable directories
de: Schreibbare Verzeichnisse
es: Directorios editables
ru: Каталоги для записи

source: App confinement is part of the Ubuntu Touch security concept. Data can be exchanged between apps only according to the AppArmor policies, mainly using the :ref:`ContentHub <contenthub>`. This being said, apps can only read and write files that are located in one of three app specific directories explained in this guide.
de: App confinement ist Teil des Ubuntu Touch Sicherheitskonzepts. Der Datenaustausch zwischen Apps kann nur gemäß den AppArmor-Richtlinien erfolgen, hauptsächlich über den :ref:`ContentHub <contenthub>`. Allerdings können Apps nur Dateien lesen und schreiben, die sich in einem von drei app-spezifischen Verzeichnissen befinden, die in diesem Guide erläutert werden.
es: El confinamiento de las aplicaciones es parte del concepto de seguridad de Ubuntu Touch. Se pueden intercambiar datos entre aplicaciones solo de acuerdo con las políticas de «AppArmor», principalmente usando el :ref:`gestor de contenido <contenthub>`. Dicho esto, las aplicaciones solo pueden leer y escribir archivos que están ubicados en alguno de los tres directorios específicos para aplicaciones explicados en esta guía.
ru: Ограничение доступа к приложениям является частью концепции безопасности Ubuntu Touch. Обмен данными между приложениями возможен только в соответствии с политиками AppArmor, в основном с использованием :ref:`ContentHub <contenthub>`. При этом приложения могут только читать и записывать файлы, расположенные в одном из трех каталогов, определенных для приложения, которые описаны в этом руководстве.

source: Standard Paths
de: Standardpfade
es: Rutas estándar
ru: Стандартные каталоги

source: Besides the write access to the app directories explained below, the app can write debug messages into the app log file located at ``/home/phablet/.cache/upstart/application-click-<fullappname>_<appname>_<version>.log``. To append messages to the log file, use the `Qt debug <https://doc.qt.io/qt-5/qdebug.html>`_ functions.
de: Neben dem Schreibzugriff auf die unten beschriebenen App-Verzeichnisse kann die App Debug-Meldungen in die App-Logdatei schreiben, die sich unter ``/home/phablet/.cache/upstart/application-click-<fullappname>_<appname>_<appname>_<version>.log`` befindet. Um Meldungen an die Protokolldatei anzuhängen, verwenden Sie die Funktionen `Qt debug <https://doc.qt.io/qt-5/qdebug.html>`_.
es: Además del acceso de escritura a los directorios de la aplicación explicados más adelante, la aplicación puede escribir mensajes de depuración en el archivo de registro ubicado en ``/home/phablet/.cache/upstart/application-click-<nombrecompletoaplicación>_<nombreaplicación>_<version>.log``. Para agregar mensajes al archivo de registro, use las funciones de `depuración de Qt <https://doc.qt.io/qt-5/qdebug.html>`_.
ru: Кроме записи файлов в каталоги, приложение так же может записывать сообщения отладки в файл журнала приложения, расположенный по адресу ``/home/phablet/.cache/upstart/application-click-<fullappname>_<appname>_<version>.log``. Чтобы добавить сообщения в файл журнала, используйте функции `Qt debug <https://doc.qt.io/qt-5/qdebug.html>` _.

source: Config
de: Konfiguration
es: Configuración
ru: Файлы конфигурации

source: Path: ``/home/phablet/.config/<fullappname>/``
de: Pfad: ``/home/phablet/.config/<fullappname>/``
es: Ruta: ``/home/phablet/.config/<nombrecompletoaplicación>/``
ru: Каталог: ``/home/phablet/.config/<fullappname>/``

source: This is the place to store configurations files to. The music app for example stores its configuration to ``/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.
de: Dies ist der Ort, an dem Sie Konfigurationsdateien speichern können. Die Musik-App speichert beispielsweise ihre Konfiguration unter ``/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.
es: Este es el lugar donde guardar los archivos de configuración. La aplicación de música, por ejemplo, guarda su configuración en ``/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.
ru: Это место для хранения файлов конфигурации. Например, музыкальное приложение сохраняет свои настройки в файле````/home/phablet/.config/com.ubuntu.music/com.ubuntu.music.conf``.

source: Cache
es: Caché
ru: Кэш

source: Path: ``/home/phablet/.cache/<fullappname>/``
de: Pfad: ``/home/phablet/.cache/<fullappname>/``
es: Ruta: ``/home/phablet/.cache/<nombrecompletoaplicación>/``
ru: Путь: ``/home/phablet/.cache/<fullappname>/``

source: This is the place to cache data for later use. The cache is also used by the Content Hub. Files that have been shared with the music app for example can be found in ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.
de: Dies ist der Ort, an dem Daten für die spätere Verwendung zwischengespeichert werden können. Der Cache wird auch vom Content Hub verwendet. Dateien, die beispielsweise mit der Musik-App geteilt wurden, finden Sie unter ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.
es: Este es el lugar para los datos de la caché que se van a usar más tarde. También la usa el gestor de contenidos. Los archivos que han sido compartidos con la aplicación de música, por ejemplo, se pueden encontrar en ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.
ru: Это место для кэширования данных, которые будут использоваться в ближайшее время. Кэш также используется в Content Hub. Например, файлы, которые открыты в музыкальном плеере, можно найти в каталоге ``/home/phablet/.cache/com.ubuntu.music/HubIncoming/``.

source: App data
de: App-Daten
es: Datos de la aplicación
ru: Данные приложений

source: Path: ``/home/phablet/.local/share/<fullappname>/``
de: Pfad: ``/home/phablet/.local/share/<fullappname>/``
es: Ruta: ``/home/phablet/.local/share/<nombrecompletoaplicación>/``
ru: Каталог:``/home/phablet/.local/share/<fullappname>/``

source: This is where your app stores any data. The music app for example stores its data bases to ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.
de: Hier speichert Ihre App alle Daten. Die Musik-App speichert beispielsweise ihre Datenbanken unter ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.
es: Aquí es donde su aplicación guarda cualquier dato. La aplicación de música, por ejemplo, almacena sus bases de datos en ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.
ru: Здесь приложение хранит любые данные. Например, музыкальное плеер хранит свои базы данных в каталоге ``/home/phablet/.local/share/com.ubuntu.music/Databases/``.

source: Using Standard Paths in C++
de: Verwendung von Standardpfaden in C++
es: Usando rutas estándar en C++
ru: Используются стандартные каталоги для C++

source: The Qt header ``QStandardPaths`` provides the app's writable locations in C++:
ru: В Qt-заголовке ``QStandardPaths` описываются каталоги приложения для записи данных:

source: Since the value of the QStandardPaths strings are decided by the `Qt application name <https://doc.qt.io/qt-5/qcoreapplication.html#applicationName-prop>`_, this needs to be the same as the clickable application name.
ru: Так как значение строк QStandardPaths определяется `названием приложения Qt <https://doc.qt.io/qt-5/qcoreapplication.html#applicationName-prop>`_ оно должно быть таким же, как и название приложения для clickable.

source: Using Standard Paths in QML
de: Verwendung von Standardpfaden in QML
es: Usando rutas estándar en QML
ru: Использование стандартных каталогов в QML

source: The Qt module `Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ provides the app's writable locations in QML:
ru: Модуль`Qt.labs.platform <https://doc.qt.io/archives/qt-5.10/qml-qt-labs-platform-standardpaths.html>`_ предоставляет записываемые локации приложения в QML:

source: App development
de: App-Entwicklung
es: Desarrollo de aplicaciones
ru: Создание приложений

source: Great!, you'd like to develop an app for Ubuntu Touch. Here are some resources that we hope help you get started.
ru: Если Вы хотите разрабатывать приложения для Ubuntu Touch, то вот некоторые ресурсы, которые помогут в этом.

source: If you have questions that aren't answered in the docs or want to chat with other Ubuntu Touch developers? Join our `app dev Telegram group <https://t.me/UbuntuAppDevEN>`_ or chat with us on the `UBports app dev forum <https://forums.ubports.com/category/35/app-development>`_.
ru: Если у Вас есть вопросы, на которые нет ответов в документации, или Вы хотите пообщаться с другими разработчиками Ubuntu Touch, присоединяйтесь к `группе разработчиков приложений в Telegram <https://t.me/UbuntuAppDevEN>`_ или пишите на `форум разработчиков приложений UBports <https://forums.ubports.com/category/35/app-development>`_.

source: Getting Started
ru: Начало работы

source: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ is a meta-build system for Ubuntu Touch applications that allows you to compile, build, test and publish ``click`` packages and provides various templates to get you started with app development. It is currently the easiest and most convenient way of building click packages for Ubuntu Touch. You can use any code editor or IDE that you choose and build your apps from the commandline with Clickable.
de: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ ist ein Meta-Build-System für Ubuntu Touch-Anwendungen, mit dem Sie ``Click``-Pakete kompilieren, erstellen, testen und veröffentlichen können, und das verschiedene Vorlagen für den Einstieg in die App-Entwicklung bietet. Es ist derzeit der einfachste und bequemste Weg, Click-Pakete für Ubuntu Touch zu erstellen. Sie können jeden beliebigen Code-Editor oder jede beliebige IDE verwenden, die Sie auswählen, und Ihre Anwendungen über die Befehlszeile mit Clickable erstellen.
es: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ es un sistema de meta-construcción de aplicaciones para Ubuntu Touch que le permite compilar, construir, probar y publicar paquetes ``click`` y proporciona varias plantillas para que comience con el desarrollo de aplicaciones. Es actualmente el más sencillo y conveniente modo de construir paquetes «click» para Ubuntu Touch. Puede utilizar cualquier editor de código o IDE de su elección y construir sus aplicaciones desde la línea de órdenes con Clickable.
ru: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ - это система сборки приложений Ubuntu Touch, которая позволяет компилировать, создавать, тестировать и публиковать пакеты ``click``. Этот комплекс утилит содержит различные шаблоны для начала разработки приложений. В настоящее время это самый простой и удобный способ создания пакетов click для Ubuntu Touch. Вы можете использовать любой редактор или среду разработки, и создавать свои приложения из командной строки с помощью Clickable.

source: Ubuntu Touch supports two kind of apps. :ref:`Native apps <nativeapp>` are apps with interfaces made using QML or HTML with their behavior defined in JavaScript, C++, Python, Rust or Go. :ref:`Web apps <webapp>` are special containers to run websites in.
ru: Ubuntu Touch поддерживает два вида приложений. :ref:`Нативные приложения <nativeapp>` - это приложения с интерфейсом, созданным с использованием QML или HTML и работающими по правилам JavaScript, C ++, Python, Rust или Go. :ref:`Веб-приложения <webapp>` - это специальные контейнеры для запуска веб-сайтов.

source: Applications are shipped as a :ref:`Click <click>` package and can be publicly shared on the official app store `OpenStore <https://open-store.io>`__
ru: Приложения поставляются в виде :ref:`Click <click>`-пакетов и могут размещаться в официальном магазине приложений `OpenStore <https://open-store.io>`__

source: Code Editor Integrations
ru: Интеграция редактора кода

source: You can use clickable with the `Atom Editor <https://atom.io>`__ by installing the `atom-clickable-plugin <https://atom.io/packages/atom-clickable-plugin>`__. This provides some common clickable tools needed to build and run click packages for Ubuntu Touch from within Atom editor.
ru: Вы можете работать с clickable при помощи утилиты`Atom Editor <https://atom.io>` __, установив пакет `atom-clickable-plugin <https://atom.io/packages/atom-clickable-plugin>` __. В нем есть интерактивные инструменты для создания и запуска click-пакетов системы Ubuntu Touch.

source: Alternatively there is the old `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__. Be aware that it is no longer supported by Canonical, and UBports has chosen to not support it either due to lack of manpower.
de: Alternativ gibt es die alte `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__. Beachten Sie, dass es nicht mehr von Canonical unterstützt wird, und UBports hat sich entschieden, es auch aus Mangel an Arbeitskräften nicht zu unterstützen.
es: Alternativamente está el antiguo `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__ . Tenga en cuenta que ya no está soportado por Canonical y UBports ha decidido no soportarlo tampoco debido a la falta de mano de obra.
ru: Можно так же создавать приложения в старом пакете для разработки `Ubuntu SDK IDE <https://docs.ubuntu.com/phone/en/platform/sdk>`__. Но нужно иметь ввиду, что этот комплект программ больше не поддерживается фирмой Canonical, а UBports перестала поддерживать его из-за нехватки квалифицированных программистов.
