Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: Each application can expose content outside its sandbox, giving the user precise control over what can be imported, exported or shared with the world and other apps.
de: Jede Anwendung kann Inhalte aus ihrer Sandbox freigeben und erlaubt dabei dem Nutzer zu kontrollieren, was mit der Welt und anderen Apps importiert, exportiert oder geteilt werden kann.
es: Cada aplicación puede mostrar contenido fuera de su entorno aislado, dando al usuario un control preciso sobre lo que puede ser importado, exportado o compartido con el mundo y con otras aplicaciones.
ru: Каждое приложение может предоставлять контент за пределами "песочницы", предоставляя пользователю полный контроль над тем, что можно импортировать, экспортировать или делиться с другими приложениями и пользователями.

source: By using a push server and a companion client, instantly serve users with the latest information from their network and apps.
de: Indem ein Push-Server und ein entsprechender Client genutzt werden, können Nutzer sofort die neusten Infos aus ihrem Netzwerk und ihren Apps erhalten.
es: Al usar un servidor de envío («push») y un cliente complementario, sirve instantáneamente a los usuarios con la última información de su red y aplicaciones.
ru: с помощью push-сервер (севера уведомлений) и соответствующего клиента можно мгновенно предоставлять пользователям самую свежую информацию из сети и приложений.

source: URL dispatcher
de: URL-Zuteiler
es: Distribuidor de URL
ru: URL-диспетчер

source: Help users navigate between your apps and drive their journey with the URL dispatcher.
de: Hilft den Nutzern beim Navigieren zwischen den Apps und erledigt die Interaktion über URLs.
es: Ayude a los usuarios a navegar entre sus aplicaciones y conduzca su travesía con el distribuidor de URL.
ru: Помогает пользователям перемещаться между приложениями и сетью с помощью диспетчера URL.

source: Online accounts
de: Online-Konten
es: Cuentas en línea
ru: Online-аккаунты (учётные записи)

source: Simplify user access to online services by integrating with the online accounts API. Accounts added by the user on the device are registered in a centralized hub, allowing other apps to re-use them.
de: Vereinfache den Zugriff auf die Online-Dienste des Nutzer durch Integration der entsprechenden API. Konten, die der Nutzer auf dem Gerät hinzufügt, werden zentral gespeichert, sodass sie auch von anderen Apps verwendet werden können.
es: Simplifique el acceso del usuario a los servicios en línea con la integración de la API de cuentas en línea. Las cuentas añadidas en el dispositivo por el usuario se registran en un concentrador centralizado, permitiendo a otras aplicaciones reusarlas.
ru: Можно упростить пользователям доступ к онлайн-сервисам за счет интеграции с API онлайн-аккаунтов. Учетные записи, добавленные пользователем на устройство, регистрируются в централизованном хабе, и это позволяет другим приложениям использовать их повторно.

source: `Read the docs <https://docs.ubuntu.com/phone/en/platform/>`__
es: `Lea la documentación <https://docs.ubuntu.com/phone/en/platform/>`__
ru: `Подробнее читайте в документации <https://docs.ubuntu.com/phone/en/platform/>`__

source: Packaging your app
ru: Формирование пакета приложения

source: Here you will get some informations about the confinment model and the packaging system:
ru: Здесь можно найти информацию о модели ограничений и системе сборки пакетов:

source: App publishing guides
de: App-Veröffentlichungleitfäden
es: Guías de publicación de aplicaciones
ru: Инструкции по публикации приложения

source: We are currently working on expanding our list of publishing guides. In the mean time you can get started over at the `OpenStore's submission page <https://open-store.io/submit>`__.
de: Wir arbeiten derzeit daran, unsere Liste der Veröffentlichungsleitfäden zu erweitern. In der Zwischenzeit können Sie auf der Einreichungsseite des OpenStore <https://open-store.io/submit>`__ einsteigen.
es: Estamos trabajando en la actualidad para expandir nuestra lista de guías de publicación. Mientras tanto puede comenzar en la `página de envío de OpenStore <https://open-store.io/submit>`__.
ru: В настоящее время мы работаем над дополнением списка руководств по дистрибуции приложений. Пока всю доступную информацию можно прочитать в разделе `OpenStore's submission page <https://open-store.io/submit>`__.

source: If you are interested in helping create developer guides check out our `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
de: Wenn Sie daran interessiert sind, bei der Erstellung von Entwickler-Guides zu helfen, besuchen Sie unser `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
es: Si tiene interés en ayudar a crear guías para desarrolladores, vea nuestro `proyecto en GitLab <https://gitlab.com/ubports/ux/development-resources>`__.
ru: Если Вы хотите принять участие в создании руководств для разработчиков, ознакомьтесь с нашим проектом на GitLab <https://gitlab.com/ubports/ux/development-resources> `__.

source: Sample Apps
de: Beispiel-Apps
es: Aplicaciones de muestra
ru: Демонстрационные приложения

source: We are currently working on expanding our list of sample apps. In the mean time many apps on the `OpenStore <https://open-store.io/>`__ are open source and can be used as a reference.
de: Wir arbeiten derzeit daran, unsere Liste der Beispiel-Apps zu erweitern. Inzwischen sind viele Apps auf dem `OpenStore <https://open-store.io/>`__ Open Source und können als Referenz verwendet werden.
es: Estamos trabajando en la actualidad para expandir nuestra lista de aplicaciones de muestra. Mientras tanto, muchas aplicaciones en `OpenStore <https://open-store.io/>`__ son de código abierto y se pueden usar como referencia.
ru: В настоящее время мы работаем над расширением списка демонстрационных приложений. В то же время многие приложения в OpenStore <https://open-store.io/> `__ имеют открытый исходный код и могут использоваться в качестве справочного материала.

source: If you are interested in helping create sample apps check out our `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
de: Wenn Sie daran interessiert sind, bei der Erstellung von Beispiel-Apps zu helfen, besuchen Sie unser `GitLab Project <https://gitlab.com/ubports/ux/development-resources>`__.
es: Si está interesado en ayudar a crear aplicaciones de muestra, vea nuestro `proyecto en GitLab <https://gitlab.com/ubports/ux/development-resources>`__.
ru: Если Вам интересно создавать демо-приложения, ознакомьтесь с нашим проектом на GitLab <https://gitlab.com/ubports/ux/development-resources> `__.

source: Guide
de: Anleitung
es: Guía
ru: Инструкция

source: How the webapp fits into the shell
de: Wie die Web-Apps in die Oberfläche kommen
es: Como la aplicación web encaja en el intérprete de órdenes («shell»)
ru: Как веб-приложение встраивается в оболочку

source: A web app displays in a webview inside a webapp-container that runs as an Ubuntu app in the Ubuntu/Unity shell.
de: Eine Web-App wird in WebView in einem Web-App-Container dargestellt, der als Ubuntu-App in der Ubuntu-/Unity-Shell läuft.
es: Una aplicación web se muestra en una vista web dentro de un contenedor de aplicación web que se ejecuta como una aplicación en el intérprete de órdenes («shell») de Ubuntu/Unity.
ru: Веб-приложение представлено в формате в веб-контейнера, который запускается как приложение Ubuntu в оболочке Ubuntu/Unity.

source: Taking a closer look:
de: Schauen wir genauer hin:
es: Echando un vistazo más cerca:
ru: Рассмотрим поближе:

source: At the innermost level, there is a website that the developer identifies by URL. The website is rendered and runs in an Oxide webview. Oxide is a Blink/Chrome webview that is customized for Ubuntu. The Oxide webview runs and displays in the webapp-container. The webapp-container is the executable app runtime that is integrated with the Ubuntu/unity shell.
de: Auf der untersten Ebene, gibt es eine Webseite, die der Entwickler anhand ihrer Internetadresse bestimmt. Die Webseite wird gerendert (das Bild wird aufgebaut) und läuft in Oxide WebView. Oxide ist eine für Ubuntu angepasste Blink/Chrome WebView. Oxide WebView läuft im Web-App-Container und zeigt dort alles an. Der Web-App-Container ist eine ausführbare App-Laufzeitumgebung, die in Ubuntu-/Unity-Shell integriert ist.
es: Al nivel más interno, hay un sitio web que el desarrollador identifica con una URL. El sitio web es reproducido y ejecutado en una vista web de Oxide. Oxide es una vista web de Blink/Chrome personalizada para Ubuntu. La vista web de Oxide se ejecuta y muestra en el contenedor de la aplicación web. El contenedor de la aplicación web es el tiempo de ejecución de la aplicación ejecutable que está integrada en el intérprete de órdenes («shell») de Ubuntu/Unity.
ru: На самом внутреннем уровне находится веб-сайт, который разработчик идентифицирует по URL. Сайт открывается и работает в веб-браузере Oxide. Oxide - это веб-просмотр на основе ядра Blink/Chrome, адаптированный для Ubuntu. Веб-приложение Oxide запускается и отображается в веб-контейнере. Контейнер webapp - это интегрированная для работы с оболочкой среда исполняемого приложения Ubuntu/Unity.

source: Launching
de: Starten
es: Lanzamiento
ru: Запуск

source: You can launch a webapp from the terminal with:::
de: So startest du eine Web-App vom Terminal:::
es: Puede iniciar una aplicación web desde la terminal con:::
ru: Можно запустить веб-приложение из терминала командой:::

source: For example:::
de: Beispielsweise:::
es: Por ejemplo:::
ru: Например:::

source: This simple form works, but almost every webapp also uses other features, such as URL containment with URL patterns as described below.
de: Diese einfache Vorlage funktioniert, jedoch nutzt fast jede Web-App auch andere Funktionen, wie beispielsweise Internetadressenbeschränkung mit Adressmustern, wie unten beschrieben.
es: Esta sencilla forma funciona, pero casi cada aplicación web también usa otras características, tal y como la contención de la URL con patrones de URL como los que se describen más abajo.
ru: Эта простая форма работает, но почти каждое веб-приложение также использует другие функции. Например, ограничение URL-адресов шаблонами URL-адресов, как описано ниже.

source: User interface
de: Benutzeroberfläche
es: Interfaz de usuario
ru: Пользовательский интерфейс

source: A webapp generally fills the entire app screen space, without the need of the UI controls generally found on standard browsers.
de: Eine Web-App füllt im Allgemeinen die komplette App-Bildschirm Fläche, ohne Navigationselemente zu benötigen, wie sie sonst bei Standart-Browsern gefunden wird.
es: Una aplicación web generalmente llena todo el espacio de la aplicación en pantalla, sin necesidad de los controles de la interfaz de usuario que se encuentran en los navegadores estándar.
ru: Веб-приложение обычно разворачивается на все рабочее пространство на экране устройства без необходимости использования элементов управления пользовательского интерфейса стандартных браузеров.

source: In some cases some navigation controls are appropriate, such as Back and Forward buttons, or a URL address bar. These are added as command line arguments:
de: In einigen Fällen können Navigationselemente, wie ein Vor-/Zurück-Knopf oder eine Adressleiste erforderlich sein. Diese werden mit Kommandozeilenparametern hinzugefügt:
es: En algunos casos algunos controles de navegación son adecuados, tales como los botones de «Retroceder» y «Avanzar», o una barra de direcciones. Estos se añaden como argumentos de la línea de órdenes:
ru: В некоторых случаях подходят некоторые элементы навигации, например кнопки «Назад» и «Вперед» или адресная строка URL. Они добавляются в качестве аргументов командной строки:

source: ``--enable-back-forward`` Enable the display of the back and forward buttons in the toolbar (at the bottom of the webapp window)
de: ``--enable-back-forward`` Aktiviere die Anzeige der Vor- und Zurück-Knöpfe in der Werkzeugleiste (Am unteren Rand des Web-App Fensters)
es: ``--enable-back-forward`` habilita que se muestren los botones de retroceder y avanzar en la barra de herramientas (en la parte inferior de la ventana de la aplicación web)
ru: ``--enable-back-forward``. Включение отображение кнопок «назад» и «вперед» на панели инструментов (в нижней части окна веб-приложения)

source: ``--enable-addressbar`` Enable the display of the address bar (at the bottom of the webapp window)
de: ``--enable-addressbar`` Aktiviere die Anzeige der Adressleiste (Am unteren Rand des Web-App Fensters)
es: ``--enable-addressbar`` habilita que se muestre la barra de direcciones (en la parte inferior de la ventana de la aplicación web)
ru: ``--enable-addressbar``. Включение отображение адресной строки (внизу окна веб-приложения)

source: URL patterns
de: Adressmuster
es: Patrones de URL
ru: URL-шаблоны

source: Webapp authors often want to contain browsing to the target website. That is, the developer wants to control the URLs that can be opened in the webapp (all other URLs are opened in the browser). This is done with URL patterns as part of the webapp command line.
de: Web-App-Ersteller wollen oft den Zugang auf die Zielwebseite beschränken. D.h., der Entwickler möchte die Kontrolle darüber haben, welche Internetadressen in der Web-App geöffnet werden können (alle anderen Internetadressen werden im Browser geöffnet). Dies wird über Adressmuster als Teil der Web-App-Kommandozeile realisiert.
es: Los autores de aplicaciones web a menudo quieren contener la navegación solo al sitio web objetivo. Esto es, el desarrollador quiere controlar las URLs que pueden abrirse en la aplicación web (todas las otras URLs se abren en el navegador). Esto se consigue con los patrones de URL como parte de la línea de órdenes de la aplicación web.
ru: Разработчики веб-приложений часто хотят ограничить доступ к сайту-источнику. То есть разработчик хочет контролировать URL-адреса, которые можно открыть в веб-приложении (все остальные URL-адреса открываются в браузере). Это делается с помощью URL-шаблонов в командной строке через ключи для запуска webapp.

source: However, many web apps use pages that are hosted over multiple sites or that use external resources and pages.
de: Jedoch werden die Inhalte viele Web-Apps über mehrere Webseiten verteilt gehostet oder sie betten externe Resourcen und Seiten ein.
es: Sin embargo, muchas aplicaciones web usan páginas que están alojadas en múltiples sitios o que usan recursos y páginas externas.
ru: Однако многие веб-приложения используют страницы, размещенные на нескольких сайтах или внешних ресурсах.

source: However, both containment and access to specified external URLs are implemented with URL patterns provided as arguments at launch time. Let’s take a closer look.
de: Allerdings werden sowohl die Eindämmung als auch der Zugriff auf angegebene externe URLs mit URL-Mustern implementiert, die zum Startzeitpunkt als Argumente bereitgestellt werden. Lassen Sie uns einen genaueren Blick darauf werfen.
es: Sin embargo, tanto el confinamiento como el acceso a URLs específicas externas se implementan con patrones de URL suministradas como argumentos en el momento del inicio. Echemos un vistazo más de cerca.
ru: Ограничение или доступ к указанным внешним URL-адресам реализуется с помощью шаблонов URL-адресов, предоставляемых в качестве аргументов во время запуска. Давайте посмотрим поближе.

source: Uncontained by default
de: Standartmäßig uneingeschränkt
es: Sin contener por defecto
ru: По умолчанию - нет контейнера

source: By default, there is no URL containment. Suppose you launch a webapp without any patters and only a starting URL like this:::
de: Standartmäßig werden Adressen nicht eingeschränkt. Vorausgesetzt wird, dass die Web-App ohne Muster und nur mit einer Startseite wie hier gestartet wird:::
es: Por defecto, no hay confinamiento de URL. Suponga que inicia una aplicación web sin patrones y solo una URL de comienzo como esta:::
ru: По умолчанию, URL отсутствует. Предположим, Вы запускаете веб-приложение без каких-либо шаблонов, и в нём есть только URL-адрес, например:::

source: The user can navigate to any URL without limitation. For example, if they click the Developer button at the top, they navigate to developer.ubuntu.com, and it displays in the webapp.
de: Der Nutzer kann zu jeder Adresse ohne Einschänkungen navigieren. Wenn beispielsweise oben auf den Developer-Knopf gedrückt wird, wird zu developer.ubuntu.com navigiert und die Webseite in der Web-App angezeigt.
es: El usuario puede navegar a cualquier URL sin limitación. Por ejemplo, si pulsan en el botón Desarrollador en la parte de arriba, irán a developer.ubuntu.com y se mostrará en la aplicación web.
ru: Пользователь может перейти на любой сайт без ограничений. Например, если нажать на кнопку «Developer» ( «режим разработчика») вверху, то откроется сайт developer.ubuntu.com.

source: Tip: You can see the URL of the current page by enabling the address bar with ``--enable-addressbar``.
de: Tipp: Du kannst die Adresse der aktuellen Seite sehen, wenn du die Adressleiste mit ``--enable-addressbar`` aktivierst.
es: Consejo: puede ver la URL de la página actual habilitando la barra de direcciones con ``--enable-addressbar``.
ru: Примечание: можно увидеть URL-адрес, если включить адресную строку командой ``--enable-addressbar``.

source: Simple containment to the site
de: Einfache Beschränkungen auf die Seite
es: Confinamiento simple para el sitio
ru: Простые методики ограничения пользовательской активности на сайте

source: One often wants to contain users to the site itself. That is, if the website is www.ubuntu.com, it may be useful to contain webapp users only to subpages of www.ubuntu.com. This is done by adding a wildcard URL pattern to the launch command, as follows:::
de: Oft möchte man Nutzer auf die Seite selbst beschränken. Daher, falls die Seite www.ubuntu.com ist, wäre es hilfreich, wenn Web-App-Nutzer nur Zugriff auf Unterseiten von www.ubuntu.com hätten. Dies wird wie folgend mit einem, dem Startbefehl hinzugefügten, Wildcard-Adressmuster erreicht:::
es: A menudo uno quiere contener a los usuarios dentro del sitio. Esto es, si el sitio web es www.ubuntu.com, puede ser útil contener a los usuarios de la aplicación web solo a sub-páginas de www.ubuntu.com. Esto se hace añadiendo un patrón comodín de URL a la orden de inicio, como el que sigue:::
ru: Часто хочется ограничить активность пользователя только одним сайтом. Например, веб-сайт www.ubuntu.com не пускает пользователей своего веб-приложения дальше домена ubuntu.com. Это можно сделать, если добавить шаблонURL-адреса с подстановочными символами в команду запуска, как показано ниже :::

source: ``--webappUrlPatterns=`` indicates a pattern is next
de: ``--webappUrlPatterns=`` weist auf ein darauf folgendes Muster hin
es: ``--webappUrlPatterns=`` indica que un patrón es lo siguiente
ru: ``--webappUrlPatterns=`` указывает на то, что шаблон следующий

source: http://www.ubuntu.com/* is the pattern The asterisk is a wildcard that matches any valid sequence of trailing (right-most) characters in a URL
de: http://www.ubuntu.com/* ist das Muster. Das Sternchen ist ein Platzhalter, der mit jeder gültigen Folge von nachfolgenden (ganz rechts) Zeichen in einer URL übereinstimmt
es: http://www.ubuntu.com/* es el patrón. El asterisco es un comodín que coincide con cualquier secuencia válida de caracteres finales (más a la derecha) en una URL
ru: http://www.ubuntu.com/* - в этом случае звездочка - это подстановочный знак, после него может идти любая последовательность символов в URL-адресе

source: With this launch command and URL pattern, the user can navigate to and open in the webapp any URL that starts with http://www.ubuntu.com/. For example, they can click on the Phone button (http://www.ubuntu.com/phone) in the banner and it opens in the webapp, or the Tablet button (http://www.ubuntu.com/tablet). But, clicking Developer opens the corresponding URL in the browser.
de: Mit diesem Startbefehl und Adressmuster, kann der Nutzer zu jeder Seite navigieren und sie öffnen, die mit http://www.ubuntu.com/ beginnt. Beispielsweise kann er im Banner auf Phone tippen (http://www.ubuntu.com/phone) und die Seite wird in der Web-App geöffnet, oder auch das gleiche mit dem Tablet-Knopf (http://www.ubuntu.com/tablet). Klickt er jedoch auf den Entwickler-Knopf, öffnet sich die entsprechende Seite im Browser.
es: Con esta orden de inicio y patrón de URL, el usuario puede navegar y abrir en la aplicación web cualquier URL que comience con http://www.ubuntu.com/. Por ejemplo, pueden pulsar en el botón «Teléfono» (http://www.ubuntu.com/phone) en la cabecera y se abre en la aplicación web, o el botón «Tableta» (http://www.ubuntu.com/tablet). Pero pulsando «Desarrollador» abre la URL correspondiente en el navegador.
ru: С помощью этой команды и шаблона URL пользователь может перейти и открыть в веб-приложении любой URL-адрес, начинающийся с http://www.ubuntu.com/. Например, клик по кнопке «Телефон» (http://www.ubuntu.com/phone) или «Планшет» (http://www.ubuntu.com/tablet) на баннере откроет соответствующие страницы в веб-приложении. Но, если кликнуть на клавишу «Разработчик», то страничка откроется в браузере.

source: Tip: Make sure to fully specify the subdomain in your starting URL, that is, use http://www.ubuntu.com instead of www.ubuntu.com. Not specifying the subdomain would create an ambiguous URL and thus introduces security concerns.
ru: Примечание: необходимо полностью указать имя домена. Например, http://www.ubuntu.com, а не www.ubuntu.com. Если не будет указан субдомен, это приведет к неправильному URL-адресу и, следовательно, к проблемам безопасности.

source: More complex wildcard patterns
ru: Более сложные шаблоны

source: You might want to limit access to only some subpages of your site from within the webapp. This is easy with wildcard patterns. (Links to other subpages are opened in the browser.) For example, the following allows access to www.ubuntu.com/desktop/features and www.ubuntu.com/phone/features while not allowing access to www.ubuntu.com/desktop or www.ubuntu.com/phone::
de: Eventuell möchtest du nur den Zugriff auf einige Unterseiten der Seite innerhalb der Web-App gestatten. Auch dies entspricht einem Wildcard-Muster. (Links zu anderen Unterseiten werden im Browser geöffnet.) Zum Beispiel wird im Folgenden nur der Zugang zu www.ubuntu.com/desktop/features und www.ubuntu.com/phone/features gestattet, jedoch nicht auf www.ubuntu.com/desktop oder www.ubuntu.com/phone::
es: Podría querer limitar el acceso solo a algunas sub-páginas de su sitio desde dentro de la aplicación web. Esto es fácil con patrones comodín. (Los enlaces a otras sub-páginas se abre en el navegador). Por ejemplo, lo siguiente permite acceso a www.ubuntu.com/desktop/features y www.ubuntu.com/phone/features mientras que no permite el acceso a www.ubuntu.com/desktop o www.ubuntu.com/phone::
ru: Может возникнуть необходимость ограничить доступ к некоторым разделам сайта из веб-приложения. Это легко делается с помощью подстановочных шаблонов (wildcards). Ссылки на другие под-домены открываются в браузере. Например, вот как получить доступ к страницам www.ubuntu.com/desktop/features и www.ubuntu.com/phone/features, но при этом запретить открывать страницы www.ubuntu.com/desktop или www.ubuntu.com/phone::

source: Multiple patterns
de: Mehrere Muster
es: Patrones múltiples
ru: Использование нескольких шаблонов одновременно
