Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: Description: Can request keeping the screen on
de: Beschreibung: Kann anfordern, den Bildschirm eingeschaltet zu lassen
es: Descripción: puede solicitar mantener la pantalla encendida
ru: Описание: запрос оставить включенным экран устройства

source: location
de: Standort
es: ubicación
ru: location (местоположение)

source: Description: Can access Location
de: Beschreibung: Zugriff auf den Standort möglich
es: Descripción: puede acceder a la ubicación
ru: Описание: может запрашивать доступ к местоположению пользователя

source: Allows an app to request access to the device's current location.
de: Ermöglicht es einer App, den Zugriff auf den aktuellen Standort des Geräts zu erhalten.
es: Permite a una aplicación solicitar acceso a la ubicación actual del dispositivo.
ru: Приложение сможет запрашивать доступ к текущему местоположению устройства.

source: microphone
de: Microphon
es: micrófono
ru: microphone (микрофон)

source: Description: Can access the microphone
de: Beschreibung: Zugriff auf das Mikrofon möglich
es: Descripción: puede acceder al micrófono
ru: Описание: получение доступа к микрофону

source: music_files
es: «music_files» (archivos de música)
ru: music_files (музыкальные файлы)

source: Description: Can read and write to music files. This policy group is reserved for certain applications, such as music players. Developers should typically use the content_exchange policy group and API to access music files instead.
de: Beschreibung: Kann Musikdateien lesen und schreiben. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. für Musik-Player. Entwickler sollten stattdessen typischerweise die Gruppe der Richtlinien content_exchange und die API verwenden, um auf Musikdateien zuzugreifen.
es: Descripción: puede leer y escribir a los archivos de música. Este grupo de políticas está reservado para determinadas aplicaciones, como los reproductores de música. Los desarrolladores deberían usar normalmente el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de música.
ru: Описание: возможность читать и записывать музыкальные файлы. Эта группа политик зарезервирована для определенных приложений - например, для музыкальных проигрывателей. Обычно, разработчикам для доступа к музыкальным файлам следует использовать группу политик content_exchange и API.

source: The music_files policy group allows an app to read or write to the Music directories in the user's home folder or on external media.
de: Die Richtliniengruppe music_files ermöglicht es einer App, das Music-Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen oder zu schreiben.
es: El grupo de políticas de «music_files» (archivos de música) permite a una aplicación leer o escribir a los directorios de música en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик music_files позволяет приложению читать или записывать файлы в каталог Music в домашней папке пользователя или на внешнем носителе.

source: music_files_read
es: «music_files_read» (lectura de archivos de música)
ru: music_files_read (чтение музыкальных файлов)

source: Description: Can read all music files. This policy group is reserved for certain applications, such as music players. Developers should typically use the content_exchange policy group and API to access music files instead.
de: Beschreibung: Kann alle Musikdateien lesen. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. für Musik-Player. Entwickler sollten stattdessen typischerweise die Gruppe der Richtlinien content_exchange und die API verwenden, um auf Musikdateien zuzugreifen.
es: Descripción: puede leer todos los archivos de música. Este grupo de políticas está reservado para ciertas aplicaciones, como los reproductores de música. Los desarrolladores deberían normalmente usar el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de música.
ru: Описание: чтение всех музыкальных файлов. Эта группа политик зарезервирована для определенных приложений - например, для музыкальных проигрывателей. Обычно, разработчикам для доступа к музыкальным файлам следует использовать группу политик content_exchange и API.

source: The music_files_read policy group allows an app to read the Music directories in the user's home folder or on external media.
de: Die Richtliniengruppe music_files_read ermöglicht es einer App, das Music-Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen.
es: El grupo de políticas de «music_files_read» (lectura de archivos de música) permite a una aplicación leer los directorios de música en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик music_files_read позволяет приложению читать каталоги музыки в домашней папке пользователя или на внешнем носителе.

source: networking
de: Netzwerk
es: «networking» (redes)
ru: networking (доступ к сети)

source: Description: Can access the network
de: Beschreibung: Zugriff auf das Netzwerk möglich
es: Descripción: puede acceder a la red
ru: Описание: возможность получения доступа к сети

source: The networking policy group allows an app to contact network devices and use the `download manager`_.
de: Die Richtliniengruppe networking ermöglicht es einer App, Netzwerkgeräte zu kontaktieren und den `Download-Manager`_ zu verwenden.
es: El grupo de políticas de «networking» (redes) permite a una aplicación contactar dispositivos en red y usar el `download manager`_ (gestor de descargas).
ru: Группа сетевых политик позволяет приложению связываться с сетевыми устройствами и использовать диспетчер загрузки - `download manager`_.

source: picture_files
es: «picture_files» (archivos de imágenes)
ru: picture_files (файлы изображений)

source: Description: Can read and write to picture files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access picture files instead.
de: Beschreibung: Kann Bilddateien lesen und schreiben. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. Galerieanwendungen. Entwickler sollten stattdessen typischerweise die Gruppe der Richtlinien content_exchange und die API verwenden, um auf Bilddateien zuzugreifen.
es: Descripción: puede leer y escribir a archivos de imágenes. Este grupo de políticas está reservado para ciertas aplicaciones, como las aplicaciones de galería. Los desarrolladores deberían usar normalmente el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de imágenes.
ru: Описание: запись и чтение файлов с изображениями. Эта группа политик зарезервирована для определенных приложений, таких как "Галерея". Разработчикам следует использовать группу политик content_exchange и API для доступа к файлам изображений.

source: The picture_files policy group allows an app to read and write to the Pictures directories in the user's home folder or on external media.
de: Die Richtliniengruppe picture_files ermöglicht es einer App, das Pictures-Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen und zu schreiben.
es: El grupo de políticas de «picture_files» (archivos de imágenes) permite a una aplicación leer y escribir a los directorios de «Pictures» (imágenes) en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик picture_files даёт приложению права на запись и чтение в каталог Pictures в домашней папке пользователя или на внешнем носителе.

source: picture_files_read
es: «picture_files_read» (lectura de archivos de imágenes)
ru: picture_filеs_read

source: Description: Can read all picture files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access picture files instead.
de: Beschreibung: Kann alle Bilddateien lesen. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. Galerieanwendungen. Entwickler sollten stattdessen typischerweise die Gruppe der Richtlinien content_exchange und die API verwenden, um auf Bilddateien zuzugreifen.
es: Descripción: puede leer todos los archivos de imágenes. Este grupo de políticas está reservado para ciertas aplicaciones, como las aplicaciones de galería. Los desarrolladores deberían usar normalmente el grupo de políticas de «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de imágenes.
ru: Описание: доступ на чтение всех файлов изображений. Эта группа политик зарезервирована для определенных приложений, например для "Галереи". Разработчикам следует использовать группу политик content_exchange и API для доступа к файлам изображений.

source: The picture_files_read policy group allows an app to read the Pictures directories in the user's home folder or on external media.
de: Die Richtliniengruppe picture_files_read ermöglicht es einer App, das Pictures -Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen.
es: El grupo de políticas de «picture_files_read» (lectura de archivos de imágenes) permite a una aplicación leer los directorios de «Pictures» (imágenes) en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик picture_files_read дает приложению приложению права на чтение каталога Pictures в домашней папке пользователя или на внешнем носителе.

source: Description: Can use push notifications as a client
de: Beschreibung: Kann Push-Benachrichtigungen als Client verwenden
es: Descripción: puede usar el envío de notificaciones como cliente
ru: Описание: возможность использовать push-уведомления в качестве клиента

source: sensors
de: Sensoren
es: «sensors» (sensores)
ru: sensors (сенсоры)

source: Description: Can access the sensors
de: Beschreibung: Zugriff auf die Sensoren möglich
es: Descripción: puede acceder a los sensores
ru: Описание: доступ к сенсорам

source: Allows apps to access `device sensors`_
de: Ermöglicht Apps den Zugriff auf `Gerätesensoren`_
es: Permite a las aplicaciones acceder a `device sensors`_
ru: Дает приложениям доступ к `сенсорам устройства`_

source: usermetrics
de: Benutzermetriken
es: «usermetrics» (métricas de usuario)
ru: usermetrics (пользовательская метрика)

source: Description: Can use UserMetrics to update the InfoGraphic
de: Beschreibung: Kann UserMetrics verwenden, um die InfoGraphic zu aktualisieren
es: Descripción: puede usar «UserMetrics» (métricas de usuario) para actualizar «InfoGraphic» (infografía)
ru: Описание: можно использовать UserMetrics для обновления InfoGraphic

source: Allows an app to write metrics to the UserMetrics service so they can be displayed on the InfoGraphic.
de: Ermöglicht es einer App, Messwerte in den UserMetrics-Dienst zu schreiben, damit sie in der InfoGraphic angezeigt werden können.
es: Permite a una aplicación escribir métricas al servicio «UserMetrics» (métricas de usuario) para que puedan ser mostradas en el «InfoGraphic» (infografía).
ru: Даёт приложению права на запись данных метрики в сервис UserMetrics, которые затем отображаются на InfoGraphic.

source: video
es: «video» (vídeo)
ru: video (видео)

source: Description: Can play video (allows playing remote content via media-hub)
de: Beschreibung: Kann Videos abspielen (ermöglicht die Wiedergabe von Remote-Inhalten über den Media-Hub)
es: Descripción: puede reproducir vídeo (permite la reproducción de contenido remoto vía «media-hub» (centro multimedia)
ru: Описание: возможность воспроизведения видео (возможно просматривать видео, расположенное на других серверах через медиа-хаб)

source: Description: Can read and write to video files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access video files instead.
de: Beschreibung: Kann Videodateien lesen und schreiben. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. Galerieanwendungen. Entwickler sollten stattdessen in der Regel die Richtliniengruppe content_exchange und die API verwenden, um auf Videodateien zuzugreifen.
es: Descripción: puede leer y escribir a los archivos de vídeo. Este grupo de políticas está reservado para ciertas aplicaciones, como las aplicaciones de galería. Los desarrolladores deberían normalmente usar el «content_exchange» (intercambio de contenido) y la API para acceder a los archivos de vídeo.
ru: Описание: возможность читать и записывать видео файлы. Эта группа политик зарезервирована для определенных приложений, например для "Галереи". Разработчикам следует использовать группу политик content_exchange и API для доступа к видеофайлам.

source: The video_files policy group allows an app to read and write to the Videos directories in the user's home folder or on external media.
de: Die Richtliniengruppe video_files ermöglicht es einer App, das Videos-Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen und zu beschreiben.
es: El grupo de políticas de «video_files» (archivos de vídeo) permite a una aplicación leer y escribir a los directorios de «Videos» (vídeos) en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик video_files дает приложению права на чтение и запись в каталог «Video» в домашней папке пользователя или на внешнем носителе.

source: video_files_read
es: «video_files_read» (lectura de archivos de vídeo)
ru: video_files_read (чтение видеофайлов)

source: Description: Can read all video files. This policy group is reserved for certain applications, such as gallery applications. Developers should typically use the content_exchange policy group and API to access video files instead.
de: Beschreibung: Kann alle Videodateien lesen. Diese Richtliniengruppe ist für bestimmte Anwendungen reserviert, z. B. Galerieanwendungen. Entwickler sollten stattdessen in der Regel die Richtliniengruppe content_exchange und die API verwenden, um auf Videodateien zuzugreifen.
es: Descripción: puede leer todos los archivos de vídeo. Este grupo de políticas está reservado para ciertas aplicaciones, como las aplicaciones de galería. Los desarrolladores deberían normalmente usar el grupo de políticas de «content_exchange» y la API para acceder a los archivos de vídeo.
ru: Описание: доступ на чтение всех видеофайлов. Эта группа политик зарезервирована для определенных приложений, таких как " галерея". Разработчикам следует использовать группу политик content_exchange и API для доступа к видеофайлам .

source: The video_files_read policy group allows an app to read the Videos directories in the user's home folder or on external media.
de: Die Richtliniengruppe video_files_read ermöglicht es einer App, das Videos-Verzeichnis im home-Ordner des Benutzers oder auf externen Medien zu lesen.
es: El grupo de políticas de «video_files_read» (lectura de archivos de vídeo) permite a una aplicación leer los directorios de «Videos» (vídeos) en la carpeta principal del usuario o en la unidad externa.
ru: Группа политик video_files_read дает приложению права на чтение директорий «Video» в домашней папке пользователя или на внешнем носителе.

source: webview
es: «webview» (vista web)
ru: webview (веб-представление)

source: Description: Can use the UbuntuWebview
de: Beschreibung: Kann die UbuntuWebview verwenden
es: Descripción: puede usar el «UbuntuWebview»
ru: Описание: может использоваться UbuntuWebview

source: The webview policy group allows apps to embed a `web browser view`_.
de: Die Richtliniengruppe webview ermöglicht es Apps, eine `Webbrowser-Ansicht`_ einzubetten.
es: El grupo de políticas «webview» (vista web) permite a las aplicaciones integrar una `vista de navegador web`_.
ru: Группа политик веб-просмотра позволяет приложениям работать как в окне браузера (`web browser view`_).

source: Click package
de: Click-Paket
es: Paquete «click»
ru: Click-пакет

source: Every ``click`` application package must embed at least 3 files:
de: Jedes ``click`` Anwendungspaket muss mindestens 3 Dateien beinhalten:
es: Cada paquete de aplicación ``click`` debe contener al menos 3 archivos:
ru: Каждое приложение, распространяемое в виде ``click``-пакета, должно содержать как минимум 3 файла:

source: ``manifest.json`` file
de: ``manifest.json`` Datei
es: archivo ``manifest.json``
ru: файл ``manifest.json``

source: Contains application declarations such as application name, description, author, framework sdk target, and version.
de: Enthält die Deklarationen der Anwendungen, wie Name, Beschreibung, Autor, Ziel-Framework-SDK und Version.
es: Contiene declaraciones de aplicaciones tales como nombre, descripción, autor, kit de desarrollo de programas (sdk) objetivo y versión.
ru: Здесь содержится описание важных параметров приложения - название, описание, автор, версия и framework sdk target.

source: Example ``manifest.json`` file::
de: Beispiel ``manifest.json`` Datei::
es: Ejemplo de archivo ``manifest.json``::
ru: Пример файла ``manifest.json``::

source: AppArmor profile policy file
de: AppArmor-Profilrichtlinien-Datei
es: Archivo de política del perfil de «AppArmor»
ru: Файл политики профиля AppArmor

source: Contains which policy the app needs to work properly. See `Security and app isolation`_ below for more information on this file.
de: Enthält die Rechte, die eine App benötigt, um zu funktionieren. Für mehr Informationen über diese Datei, lies unter `Sicherheit und App-Abschottung`_ weiter.
es: Contiene la política que la aplicación necesita para funcionar correctamente. Vea `Security and app isolation`_ (seguridad y aislamiento de aplicaciones) más adelante para obtener más información sobre este archivo.
ru: Здесь указано, с какой политикой приложение должно работать правильно. См. ниже раздел`Безопасность и изоляция приложения`_ для получения дополнительной информации об этом файле.

source: ``.desktop`` file
de: ``.desktop`` Datei
es: archivo ``.desktop``
ru: файл ``.desktop`

source: The launcher file will tell UT how to launch the app, which name and icon to display on the home screen, and some other properties.
de: Der Starter enthält Informationen für UT, wie die App gestartet werden soll, welcher Name und welches Icon auf dem Startbildschirm gezeigt werden sollen und einige weitere Angaben.
es: El archivo lanzador dirá a UT como lanzar la aplicación, que nombre e icono mostrar en la pantalla principal y otras propiedades.
ru: Файл лаунчера сообщит UT, как запускать приложение, какое название и значок отобразить на домашнем экране, а также некоторые другие свойства.

source: Example of ``app.desktop``::
de: Beispiel für ``app.desktop``::
es: Ejemplo de ``app.desktop``::
ru: Пример файла ``app.desktop``::

source: Non exhaustive list of properties:
de: Unvollständige Liste der Optionen:
es: Lista no exhaustiva de propiedades:
ru: Неполный список свойств:

source: Name: Application title has shown in the dash
de: Name: Anwendungsname, der im Starter angezeigt wird
es: «Name» (nombre): título que la aplicación muestra en el tablero
ru: Name:заголовок приложения показан в графе "-"

source: Exec: Path to the executable file
de: Exec: Pfad zur ausführbaren Datei
es: «Exec» (ejecutable): ruta al archivo ejecutable
ru: Exec: путь к исполняемому файлу

source: Icon: Path to the icon to display
de: Icon: Pfad zum angezeigten Symbol
es: «Icon» (icono): ruta al icono que mostrar
ru: Icon: Путь к иконке для вывода на экран устройства

source: Terminal: ``false`` if will not run in terminal window
de: Terminal: ``false``, falls das Programm nicht im Terminal ausgeführt wird
es: «Terminal» (terminal): ``false`` (falso) si no se ejecutará en una ventana de terminal
ru: Terminal: если установлено значение ``false``, то приложение не будет запускаться в окне терминала

source: Type: Specifies the type of the launcher file. The type can be Application, Link or Directory.
de: Type: Art des Starters. Möglich sind Application (Anwendung), Link oder Directory (Verzeichnis).
es: «Type» (tipo): especifica el tipo de archivo lanzador. El tipo puede ser aplicación, enlace o directorio.
ru: Type:Определяет тип исполняемого файла. Это может быть приложение, ссылка или каталог.

source: X-Ubuntu-Touch: ``true`` to make the app visible
de: X-Ubuntu-Touch: ``true``, damit die App angezeigt wird
es: «X-Ubuntu-Touch»: ``true`` (verdadero) para hacer la aplicación visible
ru: X-Ubuntu-Touch: должно быть установлено значение ``true``, чтобы сделать приложение видимым

source: X-Ubuntu-XMir-Enable: ``true`` if your app is built for X
de: X-Ubuntu-XMir-Enable: ``true``, wenn deine App X11 benutzt
es: «X-Ubuntu-XMir-Enable»: ``true`` (verdadero) si su aplicación está hecha para X
ru: X-Ubuntu-XMir-Enable: должно быть установлено значение ``true``, если приложение скомпилировано для X

source: X-Ubuntu-Supported-Orientations: ``landscape`` or ``portrait`` to force your app start in landscape mode and portrait mode respectively.
ru: X-Ubuntu-Supported-Orientations: опции ``landscape`` или ``portrait`` отвечают за запуск приложения в ландшафтном или портретном режимах соответственно.

source: Security and app isolation
de: Sicherheit und App-Abschottung
es: Seguridad y aislamiento de las aplicaciones
ru: Безопасность и изоляция приложения

source: All Ubuntu apps are confined respecting AppArmor access control mechanism (see `Application Confinement <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_) , meaning they only have access to their own resources and are isolated from other apps and parts of the system. The developer must declare which policy groups are needed for the app or scope to function properly with an apparmor ``.json`` file.
ru: Работа всех приложений Ubuntu ограничена соблюдением механизма контроля доступа AppArmor (подробнее смотрите раздел `Application Confinement <https://wiki.ubuntu.com/SecurityTeam/Specifications/ApplicationConfinement#App_confinement_with_AppArmor>`_). Это значит, что они имеют доступ только к своим ресурсам и изолированы от других приложений и частей системы. Разработчик должен указать, какие группы политик необходимы для правильной работы приложения в файле политики apparmor с расширением ``.json``.

source: Example ``apparmor.json`` file::
de: Beispielhafte ``apparmor.json`` Datei::
es: Ejemplo de archivo ``apparmor.json``::
ru: Пример файла ``apparmor.json``::

source: For a full list of available policy groups, see :doc:`apparmor`.
de: Eine vollständige Liste der verfügbaren Richtliniengruppen finden Sie in :doc:`apparmor`.
es: Para una lista completa de grupos de políticas disponibles, vea :doc:`apparmor`.
ru: Полный список доступных групп политик см. в разделе :doc: `apparmor`.

source: Here are Ubuntu Touch platforms key topics when you want to extend your app with Ubuntu Touch ecosystem:
ru: Список ключевых вопросов о платформе Ubuntu Touch, которые необходимо изучить, если планируется расширить работу приложения с помощью экосистемы Ubuntu Touch:

source: Content Hub
es: Centro de contenido
ru: Content Hub (Центр содержимого)
