Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/appdev.po
Languages: de, es, ru

source: You can use multiple patterns by separating them with a comma. For example, the following allows access only to www.ubuntu.com/desktop/features and www.ubuntu.com/phone/features:::
de: Du kannst mehrere Muster in einer komma-separierten Liste eintragen. Im Beispiel wird nur der Zugriff auf www.ubuntu.com/desktop/features und www.ubuntu.com/phone/features erlaubt:::
es: Puede usar patrones múltiples separándolos con una coma. Por ejemplo, lo siguiente permite el acceso solo a www.ubuntu.com/desktop/features y www.ubuntu.com/phone/features:::
ru: Можно использовать несколько шаблонов, разделяя их запятой. Например, в этом примере разрешим доступ только к страницам www.ubuntu.com/desktop/features и www.ubuntu.com/phone/features:::

source: Tip: Multiple patterns are often necessary to achieve the intended containment behavior.
de: Tipp: Verschiedene Muster sind oft nötig um das gewünschte Blockierverhalten zu erreichen.
es: Consejo: a menudo son necesarios los patrones múltiples para conseguir el deseado comportamiento de confinamiento.
ru: Примечание: использование нескольких шаблонов обычно необходимо, чтобы корректно работала необходимая политика ограничения доступа к ресурсам.

source: Adding a specific subdomain
de: Hinzufügen eine spezifischen Subdomain
es: Añadiendo un subominio específico
ru: Добавление определенного под-домена

source: Many URLs have one or more subdomains. (For example, in the following, "developer" is the subdomain: developer.ubuntu.com.) You can allow access to a single subdomain (and all of its subpages) with a pattern like this:::
ru: У многих URL-адресов имеется один или несколько поддоменов. (Например, в дальнейших примерах «developer» - это поддомен сайта developer.ubuntu.com). Можно разрешить доступ к одному поддомену (и всем его подстраницам) с помощью шаблона:::

source: However, one usually wants the user to be able to navigate back to the starting URL (and its subpages). So, if the starting URL is http://www.ubuntu.com, a second pattern is needed:::
de: Jedoch, wenn der Nutzer zurück zur Startseite navigieren können soll (sowie ihre Unterseiten), wird, wenn die Startseite http://www.ubuntu.com ist, ein zweites Muster benötigt:::
es: Sin embargo, uno normalmente quiere que el usuario pueda navegar de vuelta a la URL de inicio (y sus sub-páginas). Así que, si la URL de inicio es http://www.ubuntu.com, se necesita un segundo patrón:::
ru: Обычно требуется, чтобы пользователь легко мог вернуться к начальному URL-адресу. Например, если начальный URL-адрес http://www.ubuntu.com, то нужен второй шаблон:::

source: Putting these together, here’s an example that starts on http://www.ubuntu.com and allows navigation to http://developer.ubuntu.com and subpages and back to http://www.ubuntu.com and subpages:::
de: Mit allem Zusammen, ist hier ein Beispiel, welches auf http://www.ubuntu.com startet und das Navigieren auf http://developer.ubuntu.com und dessen Unterseiten erlaubt, sowie das Zurücknavigieren zu http://www.ubuntu.com und dessen Unterseiten:::
es: Poniendo todo junto, aquí hay un ejemplo que comienza en http://www.ubuntu.com y permite la navegación a http://developer.ubuntu.com y sub-páginas y volver a http://www.ubuntu.com y sub-páginas:::
ru: Теперь объединим всё вместе - со странички http://www.ubuntu.com можно перейти на http://developer.ubuntu.com и вернуться обратно:::

source: Adding subdomains with a wildcard
de: Subdomains mittels Wildcard hinzufügen
es: Añadiendo subdominios con un comodín
ru: Добавление под-доменов с помощью шаблона

source: Some URLs have multiple subdomains. For example, www.ubuntu.com has design.ubuntu.com, developer.ubuntu.com and more. You can add access to all subdomains with a wildcard in the subdomain position:::
de: Einige Adressen haben verschiedene Unterseiten. Zum Beispiel, www.ubuntu.com beinhaltet auch design.ubuntu.com, developer.ubuntu.com und einige weitere. Du kannst den Zugriff auf alle Subdomains mit einer Wildcard anstelle des Namens der Subdomain erlauben:::
es: Algunas URLs tienen múltiples subdominios. Por ejemplo, www.ubuntu.com tiene design.ubuntu.com, developer.ubuntu.com y más. Puede añadir el acceso a todos los subdominios con un comodín en la posición de subdominio:::
ru: В некоторых URL содержится под-доменов. Например, в состав www.ubuntu.com входят также ресурсы design.ubuntu.com, developer.ubuntu.com и другие. Можно разрешить доступ ко всем поддоменам с помощью специального символа-шаблона в строке с под-доменами:::

source: Note: An asterisk in the subdomain position matches any valid single subdomain. This single pattern is sufficient to enable browsing to any subdomain and subpages, including back to the starting URL (http://www.ubuntu.com) and its subpages.
de: Anmerkung: Ein Sternchen anstelle der Subdomain entspricht jeder gültigen Subdomain. Dieses einzelne Muster reicht aus, um den Zugang auf alle Subdomains und Unterseiten zu erlauben, inklusive der Startseite (http://www.ubuntu.com) und deren Unterseiten.
es: Nota: un asterisco en la posición del subdominio iguala cualquier simple subdominio válido. Este patrón único es suficiente para habilitar la navegación a cualquier subdominio y sub-páginas, incluyendo volver a la URL de inicio (http://www.ubuntu.com) y sus sub-páginas.
ru: Примечание. Звездочка (*) в строке субдомена соответствует любому допустимому имени под-домена. Этого символа достаточно, чтобы разрешить просмотр любого под-домена и страниц, в том числе вернуться к начальному URL (http://www.ubuntu.com).

source: Adding https
de: Hinzufügen von https
es: Añadiendo https
ru: Добавление https

source: Sometimes a site uses https for some of its URLs. Here is an example that allows https and https as access within the webapp to www.launchpad.net (and all subpages due to the wildcard):::
de: Manchmal nutzt eine Seite https für einige ihrer Adressen. Hier ist ein Beispiel, welches den Zugriff auf https und http innerhalb der Web-App auf www.launchpad.net erlaubt (und wegen des Wildcards auch alle Unterseiten):::
es: Algunas veces un sitio usa https para alguna de sus URLs. Aquí tiene un ejemplo que permite http y https como acceso dentro de la aplicación web a www.launchpad.net (y todas sus sub-páginas gracias al comodín):::
ru: Иногда некоторые странички сайтов могут работать только по протоколу https. Вот как можно разрешить https и https в веб-приложении для сайта www.launchpad.net (и всем его под-доменам):::

source: Note: the question mark in https?. This means the preceding character (the ‘s’) is optional. If https is always required, omit the question mark.
de: Anmerkung: Siehst du in https? das Fragezeichen? Das bedeutet, dass das vorherige Zeichen (das ‘s’) optional ist. Falls https immer verwendet wird, entferne das Fragezeichen.
es: Nota: ¿qué es el signo de interrogación en https? Esto significa que el carácter precedente (la «s») es opcional. Si se necesita siempre https, omita el signo de interrogación.
ru: Примечание: для чего нужен знак вопроса после https? Это значит, что предыдущий символ («s») является необязательным. Если нужно использовать только https, знак вопроса указывать не нужно.

source: Command line arguments
de: Kommandozeilenparameter
es: Argumentos de la línea de órdenes
ru: Аргументы командной строки

source: The webapp-container accepts many options to fine tune how it hosts various web applications.
de: Der Web-App-Container verwendet viele Parameter, um genau anzupassen, wie er verschiedene Web-Apps startet.
es: El contenedor de la aplicación web acepta muchas opciones para ajustar como aloja varias aplicaciones web.
ru: У контейнера webapp есть множество опций для точной настройки различных веб-приложений.

source: See all help with:::
de: Sieh dir die Hilfe an:::
es: Vea toda la ayuda con:::
ru: Все команды можно посмотреть в справке:::

source: Note: Only the following options apply to converged Ubuntu.::
de: *Anmerkung: Nur die folgenden Optionen funktionieren unter dem konvergierten Ubuntu*.:::
es: Nota: solo las siguientes opciones se aplican a Ubuntu convergente.::
ru: Примечание. К версии Ubuntu с режимом конвергентности применяются только следующие параметры::

source: Chrome options (if none specified, no chrome is shown by default):::
de: Chrome Optionen (Falls nichts davon angegeben, wird Chromes Oberfläche standartmäßig nicht angezeigt):::
es: Opciones de Chrome (si ninguna se especifica, no se muestra ningún chrome por defecto):::
ru: Параметры браузера Chrome (браузер Chrome по умолчанию отключен):::

source: Note: The other available options are specific to desktop webapps. It is recommended to not use them anymore.
de: Anmerkung: Die anderen Optionen sind speziell für Desktop-Web-Apps. Es wird empfohlen, sie nicht mehr zu verwenden.
es: Nota: todas las otras opciones disponibles son específicas para aplicaciones web de escritorio. Se recomienda que no se usen nunca más.
ru: Примечание. Другие доступные параметры относятся только к веб-приложениям для настольных компьютеров. Не рекомендуем их использовать.

source: User-Agent string override
de: Browseridentifikation ändern
es: Ignorar la cadena agente de usuario («User-Agent»)
ru: Изменение строки User-Agent

source: Some websites check specific portions of the web engine identity, aka the User-Agent string, to adjust their presentation or enable certain features. While not a recommended practice, it is sometimes necessary to change the default string sent by the webapp container.
de: Manche Webseiten prüfen spezielle Teile der Anfragen des Browser, auch User-Agent genannt, um Informationen über das genutzte Gerät zu bekommen, nach denen sie die Gestaltung anpassen oder auch Funktionen aktivieren. Während in der Praxis nicht empfohlen, kann es manchmal nötig sein, die Standartinformationen, die vom Web-App-Container gesendet werden, anzupassen.
es: Algunos sitios web comprueban porciones específicas de la identidad del motor web, también conocido como cadena de agente de usuario («User-Agent»), para ajustar su presentación o habilitar ciertas características. Aunque no es una práctica recomendada, algunas veces es necesario cambiar la cadena por defecto que envía el contenedor de la aplicación web.
ru: Некоторые веб-сайты проверяют строку-идентификатора веб-браузер, так называемый «User-Agent», чтобы включить определенные функции или адаптировать дизайн. Иногда требуется изменить User-Agent, отправляемый веб-приложением.

source: To change the string from the command line, use the following option:::
de: Um den User-Agent von der Kommandozeile aus zu ändern, nutze folgenden Parameter:::
es: Para cambiar la cadena en la línea de órdenes, use la siguiente opción:::
ru: Из командной строки это можно сделать с помощью следующей команды:::

source: Browser data containment
de: Browserdaten-Abschottung
es: Confinamiento de los datos del navegador
ru: Хранение данных браузера

source: The webapp experience is contained and isolated from the browser data point of view. That is webapps do not access data from any other installed browser, such as history, cookies and so on. Other browser on the system do not access the webapp’s data.
ru: Работа с веб-приложением ограничивается доступом к данным определенного браузера. То есть веб-приложения не имеют доступа к данным из любого другого установленного браузера, таким как история, файлы cookie и т. д. Другие браузеры в системе не имеют доступа к данным веб-приложения.

source: Storage
ru: Хранилище данных

source: W3C allows apps to use local storage, and Oxide/Webapp-container supports the main standards here: LocalStorage, IndexedDB, WebSQL.
de: Das World Wide Web Consortium (W3C) erlaubt Apps die Nutzung lokalen Speichers und der Oxide WebApps-Container unterstützt die wichtigsten Standarts: LocalStorage, IndexedDB und WebSQL.
es: El W3C permite a las aplicaciones usar almacenamiento local y Oxide/Webapp-container (contenedor de aplicaciones web) soporta el estándar principal aquí: LocalStorage, IndexedDB, WebSQL.
ru: W3C позволяет приложениям использовать локальное хранилище, а Oxide/Webapp-контейнер поддерживает основные стандарты: LocalStorage, IndexedDB, WebSQL.

source: Web applications
de: Internetanwendungen
es: Aplicaciones web
ru: Веб-приложения

source: Ubuntu Webapps are a great way to deliver online web applications into Ubuntu.
de: Ubuntu WebApps sind ein großartiger Weg, Online-Webanwendungen in Ubuntu zu integrieren.
es: Las aplicaciones web de Ubuntu son una gran manera de llevar las aplicaciones web en línea a Ubuntu.
ru: Ubuntu Webapps - отличный способ доставки онлайн-приложений в Ubuntu.

source: The Ubuntu platform provides an advanced web engine container to run online applications on the Ubuntu client devices.
de: Die Ubuntu-Plattform bietet einen fortgeschrittenen Webseiten-Container zur Ausführung von Onlineanwendungen auf Ubuntu-Endgeräten.
es: La plataforma Ubuntu proporciona un contenedor avanzado de motor web para ejecutar aplicaciones en línea en los dispositivos cliente de Ubuntu.
ru: Платформа Ubuntu - это продвинутый механизм веб-контейнеров для запуска онлайн-приложений на клиентских устройствах Ubuntu.

source: Web applications are hosted online. They can be as simple as a website, like an online news site, or they can distribute content like videos. They can also have a rich user interface or use the WebGL extension to deliver games online.
de: Webanwendungen werden online bereitgestellt. Sie sind so einfach als Webseiten, wie eine Online-Nachrichtenseite oder können auch Inhalte wie Videos bereitstellen. Sie können auch eine üppige Benutzeroberfläche haben oder die WebGL-Erweiterung zum Verbreiten von Spielen über das Internet nutzen.
es: Las aplicaciones web son alojadas en línea. Pueden ser tan simples como un sitio web, por ejemplo un sitio de noticias en línea, o pueden distribuir contenido como vídeos. Pueden tener también una rica interfaz de usuario o usar la extensión «WebGL» para proporcionar juegos en línea.
ru: Веб-приложения находятся в онлайне. Они могут быть такими же простыми, как новостной сайт в Интернете, или распространять довольно тяжелый контент - например, видеоролики. Они также могут иметь сложный пользовательский интерфейс или использовать расширение WebGL для доставки онлайн-игр.

source: Note: Ubuntu webapps and Ubuntu HTML5 apps are similar but not identical. The main difference is that the content of a webapp is provided through a URL, whereas HTML5 apps install their content (and usually provide an Ubuntu HTML5 GUI). Webapps also have restricted access to platform APIs.
de: Hinweis: Ubuntu Webapps und Ubuntu HTML5 Apps sind ähnlich, aber nicht identisch. Der Hauptunterschied besteht darin, dass der Inhalt einer Webanwendung über eine URL bereitgestellt wird, während HTML5-Anwendungen ihren Inhalt installieren (und normalerweise eine Ubuntu HTML5-GUI bereitstellen). Webanwendungen haben auch eingeschränkten Zugriff auf Plattform-APIs.
es: Nota: las aplicaciones web de Ubuntu y las aplicaciones HTML5 de Ubuntu son parecidas pero no idénticas. La diferencia principal es que el contenido de una aplicación web se suministra usando una URL, mientras que las aplicaciones HTML5 instalan su contenido (y normalmente aportan una interfaz de usuario gráfica HTML5 de Ubuntu). Las aplicaciones web también tienen limitado el acceso a las APIs de la plataforma.
ru: Примечание. Веб-приложения Ubuntu и приложения Ubuntu HTML5 похожи, но не идентичны. Основное отличие состоит в том, что содержимое веб-приложения предоставляется через URL-адрес, тогда как приложение формата HTML5 устанавливается на устройство (и обычно предоставляет GUI Ubuntu HTML5). Веб-приложения также имеют ограниченный доступ к API платформы.

source: This guide targets webapps for converged Ubuntu, that is, Ubuntu for Devices (phones and tablets). The Ubuntu Desktop has additional webapps support not covered here. Support for webapps on converged Ubuntu will continue to grow, and of course the future of Ubuntu is convergence, so stay tuned.
de: Diese Anleitung hat einen Fokus auf das konvergierte Ubuntu, daher Ubuntu for Devices (Smartphone und Tablets). Der Ubuntu Desktop hat Unterstützung für weitere WebApps, die hier jedoch nicht behandelt werden. Die Unterstützung von WebApps auf dem konvergierten Ubuntu wird weiter zunehmen und natürlich ist die Zukunft für Ubuntu Convergence, also bleib dran.
es: Esta guía está enfocada a las aplicaciones web para un Ubuntu convergente, esto es, Ubuntu para dispositivos (teléfonos y tabletas). El escritorio de Ubuntu tiene soporte adicional para las aplicaciones web que no se cubre aquí. El soporte para las aplicaciones web para Ubuntu convergente continuará creciendo y, por supuesto, el futuro de Ubuntu es la convergencia, así que manténgase sintonizado.
ru: Это руководство предназначено для веб-приложений Ubuntu с режимом конвергентности, то есть Ubuntu для мобильных устройств (телефонов и планшетов). Ubuntu Desktop имеет дополнительную поддержку веб-приложений, которая здесь не рассматривается. Поддержка веб-приложений в конвергентной Ubuntu будет продолжать расти, и, конечно, будущее Ubuntu - это конвергенция, так что следите за обновлениями.

source: Quick start
de: Schnellstart-Anleitung
es: Inicio rápido
ru: Быстрый старт

source: There are several tools to help you package and deploy your webapp to your device:
de: Es gibt viele Entwicklerwerkzeuge, die dir helfen, dein Paket zu erstellen und deine WebApp auf dein Gerät auszuliefern:
es: Existen varias herramientas para ayudarle a empaquetar e implementar su aplicación web en su dispositivo:
ru: Есть несколько инструментов, которые помогут собрать и установить веб-приложение на мобильном устройстве:

source: `Webapp creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ application available from the openstore
de: `Webapp Creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ ist im OpenStore verfügbar.
es: `Creador de aplicaciones web («Webapp creator») <https://open-store.io/app/webapp-creator.jujuyeh>`_ aplicación disponible en openstore
ru: `Webapp creator <https://open-store.io/app/webapp-creator.jujuyeh>`_ приложение доступно в OpenStore

source: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ CLI
de: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ Kommandozeilenprogramm
es: `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ interfaz de la línea de órdenes
ru: `Кликабельное <http://clickable.bhdouglass.com/en/latest/>`_ CLI

source: Debugging your webapp
de: Bereinige Fehler in deiner WebApp (Debugging)
es: Depurando su aplicación web
ru: Отладка веб-приложения

source: This guide give you some tips to help you debug your webapp.
de: Diese Anleitung gibt dir einige Tipps um dir beim Debuggen deiner WebApp zu helfen.
es: Esta guía le da algunos consejos para ayudarle a depurar su aplicación web.
ru: В этой главе описываются некоторые моменты по отладке веб-приложений.

source: Debug web application
de: Webanwendungen debuggen
es: Depurar la aplicación web
ru: Отладка веб-приложения

source: Most web-devs will probably want do most of their coding and debugging in the usual browser environment. The Ubuntu Touch browser is compliant with modern web standards, and most webapps will just work without further changes.
de: Die meisten Webentwickler werden wahrscheinlich einen Großteil ihrer Arbeit und dem Debuggen in ihrer gewohnten Browserumgebung machen wollen. Der Ubuntu Touch Browser unterstützt viele moderne Web-Standarts und die meisten WebApps werden ohne weitere Arbeit funktionieren.
es: La mayoría de los desarrolladores web probablemente querrán escribir la mayoría de su código y depurarlo usando el entorno de navegación habitual. El navegador de Ubuntu Touch se ajusta a los estándares web modernos y la mayoría de las aplicaciones web funcionarán sin necesidad de cambios.
ru: Веб-разработчики большую часть своего времени работают в веб-браузере. Браузер Ubuntu Touch соответствует современным веб-стандартам, и большинство веб-приложений будет работать без каких-либо изменений.

source: For those (hopefully) rare cases where further debugging is needed, there are two ways to gain further information on the failure.
de: Für den (hoffentlich) seltenen Fall, wo weiteres Debugging nötig ist, gibt es zwei Wege weitere Informationen zum Fehler zu bekommen.
es: Para aquellos (esperemos) raros casos donde se necesite más depuración, existen dos maneras de obtener mas información sobre el fallo.
ru: Для редких случаев, когда необходима полная и подробная отладка, есть два способа получить дополнительную информацию о сбое.

source: Watch the logs
de: Log öffnen
es: Ver los registros («logs»)
ru: Просмотрите и изучите лог-файлы

source: If you are comfortable in a CLI environment, most Javascript errors will leave an entry in the app log file::
de: Falls du mit der Kommandozeile zurecht kommst, werden die meisten JavaScript-Fehler einen Eintrag in der Log-Datei der App hinterlassen::
es: Si está cómodo en un entorno de línea de órdenes, la mayoría de los errores de Javascript dejarán una entrada en el archivo de registro de la aplicación::
ru: Если у вас достаточно опыта и знаний для работы в среде CLI, то вы знаете, что большинство ошибок Javascript будут записаны в лог-файле приложения::

source: Debugging in the browser
de: Debuggen im Browser
es: Depurando en el navegador
ru: Отладка в браузере

source: The default Ubuntu Touch browser is based on the Blink technology that is also used in Chrome/Chromium. By starting the browser in a special mode, you have access to the regular Chrome-style debugger.
de: Der Standartbrowser bei Ubuntu Touch basiert auf der Blinktechnologie, die auch von Chrome/Chromium genutzt wird. Indem der Browser in einem speziellem Modus gestartet wird, hast du Zugriff auf den regulären Chrome-artigen debugger.
es: El navegador predeterminado de Ubuntu Touch está basado en la tecnología Blink que también se usa en Chrome/Chromium. Iniciando el navegador en un modo especial, tiene acceso al depurador normal de Chrome.
ru: Штатный браузер Ubuntu Touch основан на технологии Blink, которая также используется в браузерах Chrome/Chromium. Запустив браузер в специальном режиме, можно получить доступ к обычному отладчику Chrome.

source: On your phone, start the browser in inspector mode:::
de: Auf deinem Gerät, starte den Browser im Inspektormodus:::
es: En su teléfono, inicie el navegador en modo inspector:::
ru: Запустите браузер на телефоне в режиме "web-inspector":::

source: Now on your computer, launch Chrome/Chromium browser, and point address to ``http://YOUR_UT_IP_ADDRESS:9221``
de: Jetzt starte Chrome/Chromium auf deinem PC und gehe zur Adresse ``http://DEINE_IP_ADRESSE:9221``
es: Ahora en su ordenador, inicie el navegador Chrome/Chromium, y apunte a la dirección ``http://YOUR_UT_IP_ADDRESS:9221``
ru: Теперь на компьютере запустите браузер Chrome или любой на движке Chromium и введите адрес ``http://YOUR_UT_IP_ADDRESS:9221``

source: `Ubuntu Touch programming book <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__
de: `Ubuntu Touch Progammierhandbuch <https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details>`__
es: `Libro de programación de Ubuntu Touch en español<https://www.gitbook.com/book/mimecar/ubuntu-touch-programming-course/details/es>`__

source: `Application Templates by fulvio <https://github.com/fulvio999/ubports_app_templates>`__
de: `Applikationsvorlage von fulvio <https://github.com/fulvio999/ubports_app_templates>`__

source: `Suru Icons <http://docs.ubports.com/projects/icons/en/latest/>`__
de: `Suru Symbole <http://docs.ubports.com/projects/icons/en/latest/>`__
