Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: Bug reporting
ca: Informació d'errors
de: Fehler melden
es: Informando de errores
nb: Feilrapportering
ru: Подготовка баг-репортов

source: This page contains information to help you help us by reporting an actionable bug for Ubuntu Touch. It does NOT contain information on reporting bugs in apps, most of the time their entry in the OpenStore will specify where and how to do that.
ca: Aquesta pàgina conté informació per ajudar-vos a ajudar-nos a informar sobre un error tractable de l'Ubuntu Touch. NO conté informació sobre avisar d'errors a les aplicacions, en la major part dels casos la seva entrada a l'OpenStore especificarà on i com fer això.
de: Diese Seite enthält Informationen zum Melden von nachvollziehbaren Fehlern in Ubuntu Touch. Es geht hierbei NICHT um das Melden von Fehlern in Apps. In der Regel findet man im OpenStore-Eintrag die Angabe, wo solche Fehler zu melden sind.
es: Esta página contiene información para ayudarnos a informar de un error aplicable a Ubuntu Touch. NO contiene información sobre la notificación de errores en aplicaciones, la mayoría de las veces su entrada en OpenStore especificará dónde y cómo hacerlo.
ru: На этой странице содержится информация, которая поможет вам сообщить об ошибках в Ubuntu Touch. Тут НЕ содержится информации как сообщить об ошибках в приложениях. Об том можно узнать на страничке приложения в OpenStore.

source: Get the latest Ubuntu Touch
ca: Obteniu l'últim Ubuntu Touch
de: Neueste Ubuntu Touch Version installieren
es: Consiga el último Ubuntu Touch
nb: Få den nyeste Ubuntu Touch
ru: Установите последнюю версию Ubuntu Touch

source: This might seem obvious, but it's easy to miss. Go to (Settings - Updates) and make sure that your device doesn't have any Ubuntu updates available. If not, continue through this guide. If so, update your device and try to reproduce the bug. If it still occurs, continue through this guide. If not, do a little dance! The bug has already been fixed and you can continue using Ubuntu Touch.
ca: Això podria semblar obvi, però és fàcil no adonar-se. Aneu a (Configuració del sistema - Actualitzacions) i assegureu-vos que no hi ha cap actualització de l'Ubuntu disponible per al vostre dispositiu. Si no n'hi ha, continueu amb aquesta guia. Si hi ha, actualitzeu el dispositiu i proveu de reproduir l'error. Si encara és present, continueu amb aquesta guia. Si ja no hi és, feu un ballet! L'error s'ha arreglat i podeu continuar usant l'Ubuntu Touch.
de: Auch wenn es offensichtlich zu sein scheint, wird es doch leicht vergessen. Bitte sicherstellen, dass keine Aktualisierungen ausstehen (Systemeinstellungen - Aktualisierungen). Wenn diese nicht der Fall ist, kann mit dieser Anleitung fortgefahren werden. Ansonsten bitte das Gerät aktualisieren und versuchen, den Fehler zu reproduzieren. Falls er immer noch auftritt, kann mit dieser Anleitung fortgefahren werden. Tritt der Fehler nicht mehr auf, dann ist jetzt die Zeit für einen Freudentanz! Der Fehler wurde bereits behoben und kann Ubuntu Touch kann weiter genutzt werden.
es: Esto podría parecer obvio pero es fácil pasarlo por alto. Vaya a (Configuración - Actualizaciones) y asegúrese de que su dispositivo no tiene ninguna actualización de Ubuntu disponible. Si no, continúe a través de esta guía. Si es así, actualice su dispositivo e intente reproducir el error. Si aún ocurre, continúe a través de esta guía. Si no, ¡haga un bailecito! El error ya se ha solucionado y puede continuar usando Ubuntu Touch.
nb: Dette kan virke åpenbart, men det er lett å gå glipp av det. Gå til (Innstillinger - Oppdateringer) og sørg for at enheten ikke har noen tilgjengelige Ubuntu-oppdateringer. Hvis ikke, fortsett gjennom denne guiden. I så fall oppdaterer du enheten og prøver å reprodusere feilen. Hvis det fremdeles oppstår, fortsett gjennom denne guiden. Hvis ikke, gjør en liten dans! Feilen er allerede løst, og du kan fortsette å bruke Ubuntu Touch.
ru: Шаг очевидный, но его легко пропустить. Перейдите в меню Настройки - Обновления и убедитесь, что для вашего устройства нет доступных обновлений Ubuntu. Если их нет, действуйте по этой инструкции. Если доступны обновления, установите их и попробуйте воспроизвести ошибку. Если ошибка все еще проявляется, воспользуйтесь советами из этой инструкции. Если баг не проявляется, то, скорее всего, он был исправлен в последнем обновлении.

source: Check if the bug is already reported
ca: Comproveu si ja s'ha informat de l'error
de: Prüfen, ob der Fehler bereits gemeldet wurde
es: Compruebe si el error ya ha sido comunicado
nb: Sjekk om feilen allerede er rapportert
ru: Проверьте, сообщалось ли об этой ошибке раньше

source: Open up the bug tracker for `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
ca: Obriu el seguidor d'errors per a l'`ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
de: Den Bug Tracker `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_ öffnen.
es: Abra el seguidor de errores para `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.
ru: Зайдите на официальный баг-трекер `ubuntu-touch <https://github.com/ubports/ubuntu-touch>`_.

source: Pinephone users should check for and report bugs `here <https://gitlab.com/ubports/community-ports/pinephone>`_
de: Pinephone Benutzer sollten `hier <https://gitlab.com/ubports/community-ports/pinephone>`_ nach Fehlern suchen und Fehler melden.
es: Los usuarios de Pinephone deberían revisar y reportar errores `aquí <https://gitlab.com/ubports/community-ports/pinephone>`_
nb: Pinephone-brukere bør se etter og rapportere feil `her <https://gitlab.com/ubports/community-ports/pinephone>`_

source: First, you'll need to make sure that the bug you're trying to report hasn't been reported before. Search through the bugs reported. When searching, use a few words that describe what you're seeing. For example, "Lock screen transparent" or "Lock screen shows activities".
ca: En primer lloc, heu d'assegurar-vos que l'error que esteu intentant reportar no s'ha reportat encara. Cerqueu als informes d'error. A la cerca, useu algunes poques paraules que descriguin el que esteu observant. Per exemple, «Pantalla de bloqueig transparent» o «Pantalla de bloqueig mostra activitats».
de: Zuerst muss überprüft werden, ob der Fehler den Sie melden möchten bereits gemeldet worden ist. Durchsuchen Sie dazu die gemeldeten Fehler und benutzen Sie dabei Schlagwörter, welche die als fehlerhaft erkannte Reaktion beschreiben. Zum Beispiel "Lock screen transparent" (durchsichtiger Sperrbildschirm) oder "Lock screen shows activities" (Sperrbildschirm zeigt Aktivitäten).
es: Primero, tendrá que asegurarse de que el error que quiere comunicar no ha sido comunicado con anterioridad. Busque a través de los errores comunicados. Cuando busque, use unas pocas palabras que describan lo que está viendo. Por ejemplo, «Lock screen transparent» o «Lock screen shows activities». Tenga en cuenta que los informes de errores son exclusivamente en inglés.
nb: Først må du sørge for at feilen du prøver å rapportere ikke har blitt rapportert tidligere. Søk gjennom de rapporterte feilene. Når du søker, bruk noen få ord som beskriver det du ser. For eksempel "Låseskjerm gjennomsiktig" eller "Låseskjerm viser aktiviteter".
ru: Сначала нужно проверить, что об этой ошибке ранее не сообщалась. Посмотрите существующие баг-репорты. При поиске используйте ключевые слова, максимально описывающие ошибку. Например, «Блокировка экрана не скрывает рабочую область» или «Блокировка экрана показывает активные приложения».

source: If you find that a bug report already exists, select the "Add your Reaction" button (it looks like a smiley face) and select the +1 (thumbs up) reaction. This shows that you are also experiencing the bug.
ca: Si trobeu que ja existeix un informe d'error, trieu el botó «Afegiu la vostra reacció» (es veu com una cara somrient) i trieu la reacció +1 (polzes amunt). Això mostra que també esteu patint l'error.
de: Falls bereits ein passender Fehlerbericht existiert, die "Add your Reaction"-Schaltfläche (sieht aus wie ein Smiley) betätigen und +1 (Daumen hoch) auswählen. Dies zeigt, dass man ebenfalls von diesem Fehler betroffen ist.
es: Si encuentra que un informe de un error ya existe, seleccione el botón "Añadir su reacción" (se parece a un emoticono) y seleccione la reacción +1 (pulgares hacia arriba). Esto muestra que usted también está sufriendo el error.
nb: Hvis du oppdager at en feilrapport allerede eksisterer, velger du knappen "Legg til din reaksjon" (det ser ut som et smilefjes) og velger +1 (tommel opp) reaksjonen. Dette viser at du også opplever feilen.
ru: Если Вы обнаружите, что баг-репорт уже существует, нажмите кнопку "Add your Reaction" (выглядит как смайлик) и выберите опцию +1 (палец вверх). Это покажет, что Вы тоже столкнулись с этим багом.

source: If the report is missing any of the information specified later in this document, please add it yourself to help the developers fix the bug.
ca: Si a l'informe li manca cap de les informacions especificades més endavant a aquest document, si us plau afegiu-les per ajudar als desenvolupadors a corregir l'error.
de: Sollte dem Fehlerbericht eine der im Folgenden genannten Informationen fehlen, sollten diese bitte hinzugefügt werden, um die Entwickler bei der Fehlerbehebung zu unterstützen.
es: Si el informe carece de alguna de la información especificada mas adelante en este documento, por favor añádala usted mismo para ayudar a los desarrolladores a solucionar el error.
nb: Hvis rapporten mangler noe av informasjonen som er spesifisert senere i dette dokumentet, kan du legge den til for å hjelpe utviklerne med å fikse feilen.
ru: Если в баг-репорте отсутствует какая-либо информация, которая есть в этой инструкции, добавьте ее самостоятельно, чтобы помочь разработчикам исправить ошибку.

source: Reproduce the issue you've found
ca: Reproduïu el problema que heu trobat
de: Reproduzieren des Problems welches Du gefunden hast
es: Reproduzca el problema que ha encontrado
ru: Воспроизведение найденной ошибки

source: Next, find out exactly how to recreate the bug that you've found. Document the exact steps that you took to find the problem in detail. Then, reboot your phone and perform those steps again. If the problem still occurs, continue on to the next step. `If not... <https://youtu.be/nn2FB1P_Mn8?t=10s>`_
de: Als nächstes sollte der Fehler reproduziert werden. Dazu exakt und detailliert die Schritte dokumentieren, die zum Problem geführt haben. Nach einem Neustart diese Schritte nochmals durchführen. Falls das Problem weiterhin auftritt, kann zum nächsten Schritt übergegangen werden. `Falls nicht: <https://youtu.be/nn2FB1P_Mn8?t=10s>`_
ru: Далее выясните точно, как можно воспроизвести найденный баг. Детально документируйте все действия, которые ведут к проявлению ошибки. Затем перезагрузите телефон и выполните эти шаги снова. Если проблема все равно проявляется, перейдите к следующему шагу. `Если нет ... <https://youtu.be/nn2FB1P_Mn8?t=10s>` _

source: Making the bug report
ca: Preparació de l'informe d'error
de: Fehlerbericht erstellen
es: Redactando el informe de error
nb: Å lage feilrapporten
ru: Составление баг-репорта

source: Now it's time for what you've been waiting for, the bug report itself! Bug reports need to be filed in English.
ca: Ara és el moment que heu estat esperant, el propi informe d'error. Els informes d'error s'han d'enviar en anglès.
de: Nun ist es endlich an der Zeit, den Fehlerbericht zu erstellen! Fehlerberichte müssen in Englisch geschrieben werden.
es: ¡Ahora es el momento para lo que ha estado esperando, el informe de error en sí! Los informes de error tienen que presentarse en inglés.
nb: Nå er det tid for det du har ventet på, selve feilrapporten! Feilrapporter må arkiveres på engelsk.
ru: Теперь наконец-то можно составить баг-репорт! Сообщения об ошибках отправляются только на английском языке.

source: First, pull up the `bug tracker <https://github.com/ubports/ubuntu-touch>`_ and click "New Issue". Log in to GitHub if you haven't yet.
ca: En primer lloc , obriu el `seguidor d'errors <https://github.com/ubports/ubuntu-touch>`_ cliqueu «Problema nou». Inicieu una sessió al GitHub, si ja no ho heu fet.
de: Zuerst öffnet man den `Bug Tracker <https://github.com/ubports/ubuntu-touch>`_ und klickt auf "New Issue" und loggt sich bei GitHub ein, falls noch nicht geschehen.
es: Primero, abra el `seguidor de errores <https://github.com/ubports/ubuntu-touch>`_ y pulse "Nuevo problema". Identifíquese en GitHub si no lo ha hecho ya.
ru: Первый шаг - зайдите на `баг-трекер <https://github.com/ubports/ubuntu-touch>`_ и нажмите на клавишу "New Issue" ("Новая заявка"). Перед этим нужно войти в свою учётную запись на GitHub.

source: Next, you'll need to name your bug. Pick a name that says what's happening, but don't be too wordy. Four to eight words should be enough.
ca: A continuació, haureu d'anomenar el vostre error. Trieu un nom que digui el que està passant, però no useu massa verbositat. Quatre a vuit paraules haurien de ser prou.
de: Als nächstes muss der Fehler benannt werden. Es sollte ein Namen gewählt werden, der ohne zu viele Worte beschreibt, was passiert. Vier bis acht Wörter sollten reichen.
es: Después, necesitará describir su error. Seleccione una descripción que diga lo que está ocurriendo pero no sea demasiado extenso. De cuatro a ocho palabras debería ser suficiente.
nb: Deretter må du gi navngi feilen ditt. Velg et navn som sier hva som skjer, men ikke bruk for mange ord. Fire til åtte ord skal være nok.
ru: Шаг второй. Придумайте название багу. Название не должно быть длинным, в нескольких словах (4-8 слов) нужно передать всю суть ошибки.

source: Now, write your bug report. A good bug report includes the following:
ca: A continuació, escriviu el vostre informe d'error. Un bon informe d'error inclou el següent:
de: Nun wird der Fehlerbericht geschrieben. Ein guter Bericht enthält folgendes:
es: Ahora, escriba su informe de error. Un buen informe de error incluye lo siguiente:
nb: Nå, skriv feilrapporten din. En god feilrapport inneholder følgende:
ru: Теперь напишите баг-репорт. В хорошем сообщении об ошибке содержится следующее:

source: What happened: A synopsis of the erroneous behavior
ca: Què ha passat: Una sinopsi del comportament erroni
de: Was ist passiert: Eine Zusammenfassung des fehlerhaften Verhaltens
es: Que ocurrió: un resumen del comportamiento erróneo
nb: Hva skjedde: En oversikt over feilaktig oppførsel
ru: Что случилось: краткое описание проявления ошибки

source: What I expected to happen: A synopsis of what should have happened, if there wasn't an error
ca: Què és el que s'espera que passi: Una sinopsi del que hauria d'haver passat, si no hi ha hagut un error
de: Erwartetes Verhalten: Eine Zusammenfassung dessen, was hätte passieren sollen, wenn der Fehler nicht wäre
es: Que esperaba que ocurriera: un resumen de lo que debería haber ocurrido si no hubiera habido un error
nb: Hva jeg forventet å skje: En oversikt over hva som burde ha skjedd, hvis det ikke var en feil
ru: Что должно быть: как должна себя вести программа, если бы ошибки не было

source: Steps to reproduce: You wrote these down earlier, right?
ca: Passos per reproduir: Ja heu anotat això abans, oi que sí?
de: Schritte zum Reproduzieren: Die haben wir ja vorher schon ermittelt, nicht wahr?
es: Pasos para reproducirlo: usted lo apuntó antes ¿no?
nb: Fremgangsmåte for å reprodusere: Du skrev disse ned tidligere, ikke sant?
ru: Как воспроизвести баг: список действий, которые нужно совершить, чтобы ошибка проявилась.

source: Software Version: Go to (Settings - About) and list what appears on the "OS" line of this screen. Also include the release channel that you used when you installed Ubuntu on this phone.
ca: Versió del programari: Aneu a (Configuració del sistema - Quant a) i feu una llista del que apareix a la línia «Sistema operatiu» d'aquesta pantalla. Incloeu també el canal d'alliberament que vau usar quan vau instal·lar l'Ubuntu a aquest telèfon.
de: Software-Version: Die Info unter (Systemeinstellungen - Über) in der Zeile "Betriebssystem" und zusätzlich den Kanal (release channel) angeben, mit dem Ubuntu auf dem Gerät installiert wurde.
es: Versión del software: vaya a (Configuración - Acerca de) y liste lo que aparece en la línea "SO" en su pantalla. Incluya también el canal de publicación que usó cuando instaló Ubuntu en este teléfono.
ru: Версия операционной системы: перейдите в меню "Настройки" - "О программе" и напишите то, что указано в строке «OS». Также укажите канал для релизов, использующийся для установки ОС на телефон.

source: Once you're finished with that, post the report. You can't add labels yourself, so please don't forget to state the device you're experiencing the issue on in the description so a moderator can easily add the correct tags later.
de: Sobald Sie damit fertig sind, veröffentlichen Sie den Bericht. Sie können keine Beschriftungen selbst hinzufügen, also vergessen Sie bitte nicht, das Gerät, auf dem das Problem auftritt, in der Beschreibung anzugeben, damit ein Moderator später problemlos die richtigen Tags hinzufügen kann.
nb: Når du er ferdig med det, legg ut rapporten. Du kan ikke legge til etiketter selv, så ikke glem å oppgi enheten du opplever problemet i beskrivelsen, slik at en moderator enkelt kan legge til de riktige etikettene senere.
ru: Как только заполните сообщение об ошибке, опубликуйте его на трекере. Обычный пользователь не может добавлять ярлыки, поэтому укажите в описании устройство, на котором возникла проблема, чтобы модератор указал правильные теги позже.

source: A developer or QA-team member will confirm and triage your bug, then work can begin on it. If you are missing any information, you will be asked for it, so make sure to check in often!
ca: Un desenvolupador o un membre de l'equip de control de qualitat confirmarà i farà el triatge del vostre error, i a continuació es pot començar a treballar-lo. Si ha faltat alguna informació, se us demanarà, per tant torneu a contactar sovint!
de: Ein Entwickler oder QA-Teammitglied wird den Fehler sichten und bestätigen, worauf die Arbeit daran beginnen kann. Falls irgendwelche Infos fehlen, werden die Entwickler danach fragen. Deshalb sollte regelmäßig nachgesehen werden!
es: Un desarrollador o un miembro del equipo de control de calidad confirmará y clasificará su error, entonces podrá comenzar el trabajo sobre el. Si le falta alguna información, se le solicitará, así que ¡asegúrese de contactar a menudo!
nb: En utvikler eller et QA-teammedlem vil bekrefte og prioritere feilen din, så kan arbeidet begynne med den. Hvis du mangler informasjon, blir du bedt om det, så sørg for å sjekke inn ofte!
ru: Разработчик или работник отдела качества (QA) ознакомится с сообщением и подтвердит ошибку. После этого баг-репорт поступит в работу. Если не будет хватать какой-либо информации, разработчики напишут дополнение к сообщению, поэтому обязательно проверяйте его статус на трекере!

source: Getting Logs
ca: Obtenció dels registres
de: Log-Dateien beschaffen
es: Obtener registros
ru: Получение лог-файлов

source: Here we'll discuss the general steps to get logs, files that contain important debugging messages, on Ubuntu Touch. You may be asked for logs after submitting your issue. This section will help you to retrieve these logs from the device.
de: ‎Hier werden die allgemeinen Schritte zum Abrufen von Protokollen (Dateien, die wichtige Nachrichten zur Fehlerbeseitigung enthalten) auf Ubuntu Touch erläutert. Möglicherweise werden Sie nach dem Absenden des Problems nach Protokollen gefragt. Dieser Abschnitt hilft Ihnen, diese Protokolle vom Gerät abzurufen.
nb: Her vil vi diskutere de generelle trinnene for å få logger, filer som inneholder viktige feilsøkingsmeldinger, på Ubuntu Touch. Du kan bli bedt om logger etter at du har sendt inn problemet. Denne delen vil hjelpe deg med å hente ut disse loggene fra enheten.
ru: Сейчас мы рассмотрим основные шаги для получения лог-файлов Ubuntu Touch. В этих файлах может содержаться важная информация для процессов отладки. Разработчики могут попросить приложить эти файлы к баг-репорту. В этом разделе написано как получить лог-файлы с устройства.

source: Log files may contain information you prefer to keep private. Please be sure to skim through them to ensure this is not the case before posting them. We can coordinate to get them through e-mail or a similarly less public medium.
de: Log Dateien könnten Informationen beinhalten die man lieber geheim halten möchte. Man sollte sich entsprechend vergewissern bevor man Logfiles veröffentlicht. Wir können uns absprechen um diese über e-mail oder einen vergleichbaren, weniger öffentlichen Weg zu schicken.
nb: Loggfiler kan inneholde informasjon du foretrekker å holde privat. Sørg for å skumme gjennom dem for å sikre at dette ikke er tilfelle før du legger dem ut. Vi kan koordinere for å få de via e-post eller et lignende mindre offentlig medium.
ru: В лог-файлах может содержаться конфиденциальная информация. Пожалуйста, просматривайте эти файлы перед отправкой разработчикам или размещением в публичном доступе. С разработчиками можно договориться о передаче таких файлов через электронную почту или какие-то менее публичные сервисы.

source: To get ready, download the `Logviewer app <https://open-store.io/app/logviewer.neothethird>`_ from the OpenStore. This app will help us find, view, and send the logs we need.
de: Als erstes holt man sich die `Logviewer App <https://open-store.io/app/logviewer.neothethird>`_ aus dem OpenStore. Diese App hilft dabei die benötigten Logs zu finden, anzuschauen und zu übermitteln.
ru: Для начала скачайте приложение `Logviewer <https://open-store.io/app/logviewer.neothethird>` из OpenStore. Эта программа специально предназначена для просмотра, подготовки и отправки лог-файлов.

source: Now, open the Logviewer app. You'll see a list of all of the log files available in your user log folder, ``/home/phablet/.cache/upstart/``. This folder contains many, but not all, of the logs for software running on your device. You can tap on any log to view it, then tap the "send" icon in the top right corner to share it using an online service.
de: ‎Öffnen Sie nun die Logviewer App. Es wird eine Liste aller Protokolldateien angezeigt, die in Ihrem Benutzerprotokollordner ``/home/phablet/.cache/upstart/`` verfügbar sind. Dieser Ordner enthält viele, aber nicht alle Protokolle für Software, die auf Ihrem Gerät ausgeführt wird. Sie können auf ein beliebiges Protokoll tippen, um es anzuzeigen, und dann auf das Symbol "Senden" in der oberen rechten Ecke tippen, um es über einen Online-Dienst zu teilen.
ru: Теперь откройте приложение Logviewer. Вы увидите список всех лог-файлов, доступных в папке пользователя, ``/home/phablet/.cache/upstart / ``. Тут находится большинство лог-файлов от приложений, работающих на мобильном устройстве. Можно выбрать любой журнал и просмотреть его. В правом верхнем углу есть клавиша «Отправить», с помощью неё можно отправить эти файлы разработчикам.
