Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: If you don't see the log that you've been asked to send in Logviewer, it may be in a different folder or the application may not have created any logs yet. Tell this to the person who asked you for the logs. They should be able to get you the information you need to get back on track.
de: ‎Wenn das Protokoll, das Sie mit der Logviewer App senden sollen, nicht angezeigt wird, befindet es sich möglicherweise in einem anderen Ordner, oder die Anwendung hat noch keine Protokolle erstellt. Sagen Sie dies der Person, die Sie nach den Protokollen gefragt hat. Sie sollte in der Lage sein, Ihnen die Informationen zu geben, die Sie benötigen, um wieder auf Kurs zu kommen.
nb: Hvis du ikke ser loggen du har blitt bedt om å sende i Logviewer, kan den være i en annen mappe eller applikasjonen har kanskje ikke opprettet noen logger ennå. Fortell dette til personen som ba deg om loggene. De skal kunne få den informasjonen du trenger for å komme tilbake på sporet.
ru: Если лог-файл для Logviewer отсутствует, возможно, он находится в другой папке или приложение еще его не создало. Сообщите об этом разработчику, которые этот файл запрашивает.

source: Documentation
ca: Documentació
de: Dokumentation
es: Documentación
nb: Dokumentasjon
ru: Документация

source: Documentation on this site is written in ReStructuredText, or RST for short. Please check the `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>`_ if you are not familiar with RST.
ca: La documentació d'aquest lloc està escrita en ReStructuredTex, o, abreujadament, RST. Si us plau mireu `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>`_ si no coneixeu el RST.
de: Dokumentationen auf dieser Seite werden in ReStructuredText geschrieben, oder kurz RST. Bitte `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>`_ konsultieren, falls einem RST nicht geläufig sein sollte.
es: La documentación en este sitio está escrita en ReStructuredText, o RST para abreviar. Revise `RST Primer <http://www.sphinx-doc.org/en/stable/rest.html>`_ si no está familiarizado con RST.
ru: Документация на сайте выполнена в стандарте ReStructuredText (RST). Пожалуйста, пример файла `RST <http://www.sphinx-doc.org/en/stable/rest.html>`_, если Вам этот стандарт не знаком.

source: This page will guide you through writing great documentation for the UBports project that can be featured on this site.
ca: Aquesta pàgina us guiarà en la escriptura de magnifica documentació per al projecte UBports que es pot mostrar a aquest lloc.
de: Diese Seite leitet zum Schreiben guter Dokumentationen für das UBports-Projekt an, die auf dieser Seite zur Verfügung gestellt wird.
es: Esta página le guiará a través de la redacción de una magnífica documentación para el proyecto UBports que pueda ser destacada en este sitio.
nb: Denne siden vil guide deg gjennom å skrive god dokumentasjon for UBports-prosjektet som kan vises på dette nettstedet.
ru: Эта страница поможет Вам подготовить хорошую документацию для проекта UBports. Тесты будут размещены на сайте.

source: Documentation guidelines
ca: Directrius de la documentació
de: Dokumentationsrichtlinien
es: Directrices de la documentación
nb: Retningslinjer for dokumentasjon
ru: Инструкция по подготовке документации

source: These rules govern how you should write your documentation to avoid problems with style, format, or linking.
de: Diese Regeln beschreiben wie die Dokumentation geschrieben werden soll, um Probleme mit Stil, Formatierung oder Verlinkung zu vermeiden.
nb: Disse reglene styrer hvordan du skal skrive dokumentasjonen for å unngå problemer med stil, format eller kobling.

source: Title
ca: Títol
de: Titel
es: Título
nb: Tittel
ru: Заголовок

source: All pages must have a document title that will be shown in the table of contents (left sidebar) and at the top of the page.
de: Alle Seiten müssen einen Dokumententitel haben, der im Inhaltsverzeichnis (linke Seitenleiste) und oben auf der Seite angezeigt wird.
es: Todas las páginas deben tener un título del documento que se mostrará en la tabla de contenidos (barra lateral izquierda) y en la parte superior de la página.
nb: Alle sider må ha en dokumenttittel som vises i innholdsfortegnelsen (venstre sidefelt) og øverst på siden.
ru: На всех страницах должен быть заголовок, который будет показан в оглавлении (левая боковая панель) и в верхней части страницы.

source: Titles should be "sentence cased" rather than "Title Cased". For example::
de: Nur der Satzanfang des englischen Titels wird groß geschrieben. Zum Beispiel::

source: There isn't a single definition of title casing that everyone follows, but sentence casing is easy. This helps keep capitalization in the table of contents consistent.
ca: No hi ha una definició única sobre com fer títols amb frases que tothom segueix, però fer títol amb frases és senzill. Això ajuda a mantenir les majúscules consistents a la taula de continguts.
de: Die Großschreibung von Wörtern im Titel führt zu Regelunklarheiten. Wird nur der Satzanfang groß geschrieben, herrscht Klarheit. Damit bleibt die Großschreibung im Inhaltsverzeichnis konsistent.
es: No existe una única definición de como usar las mayúsculas que siga todo el mundo, pero aplicarlas en una frase es sencillo. Esto ayuda a mantener las mayúsculas en la tabla de contenidos consistentes.
ru: Не существует какого-то единого определения списка заголовков, которому следуют все пользователи, но на предложения разделять их легко. Это помогает сформировать стандартное оглавление.

source: Page titles are underlined with equals signs. For example, the markup for :doc:`./bugreporting` includes the following title:
de: Seitentitel werden mit Gleichzeichen unterstrichen. Z.B. wird :doc:`./bugreporting` wie folgt hervorgehoben:
es: Los títulos de las páginas están subrayados con signos de igual. Por ejemplo, la anotación para :doc:`./bugreporting` incluye el siguiente título:
ru: Заголовки страниц выделены знаком равенства. Например, в разделе :doc:`./bugreporting` заголовок выглядит так:

source: Note that:
de: Regeln:
es: Tenga en cuenta que:
nb: Merk at:
ru: Помните что:

source: The title is sentence cased
de: Nur der erste Buchstabe des Satzes wird groß geschrieben
es: El título se inicia en mayúscula
ru: Заголовок нужно писать заглавными буквами

source: The title is underlined with equals signs
de: Der Titel wird mit Gleichzeichen unterstrichen
es: El título se subraya con signos de igual
nb: Tittelen er understreket med likhetstegn
ru: Заголовок выделяется знаками равенства

source: The underline spans the title completely without going over
de: Die Unterstreichung ist vollständig und endet mit dem letzten Buchstaben
es: El subrayado abarca el título completamente sin sobresalir
ru: Линия подчеркивания не переходит за границы заголовка

source: Incorrect examples of titles include:
de: Fehlerhafte Beispiele von Titeln:
es: Algunos ejemplos incorrectos de títulos:
nb: Feil eksempler på titler inkluderer:
ru: Неправильные примеры заголовков:

source: Incorrect casing
de: Falsche Groß-/Kleinschreibung
es: Mayúsculas incorrectas
ru: Некорректный регистр букв

source: Underline too short
de: Unterstreichung ist zu kurz
es: Subrayado demasiado corto
ru: Линия подчёркивания слишком короткая

source: Underline too long
de: Unterstreichung ist zu lang
es: Subrayado demasiado largo
ru: Линия подчёркивания слишком длинная

source: Headings
de: Überschriften
es: Encabezamientos
nb: Topptekst
ru: Заголовки

source: There are several levels of headings that you may place on your page. These levels are shown here in order:
de: Es gibt mehrere Ebenen von Überschriften, die auf der Seite platziert werden können. Diese Ebenen sind hier geordnet aufgelistet:
es: Existen varios niveles de encabezamientos que puede colocar en su página. Se muestran aquí estos niveles en orden:
nb: Det er flere nivåer av overskrifter du kan plassere på siden din. Disse nivåene vises her i rekkefølge:
ru: Есть несколько уровней заголовков, которые вы можете разместить на своей странице. Эти уровни показаны здесь по порядку:

source: Each heading level creates a sub-section in the global table of contents tree available when the documentation is built. In the primary (web) version of the documentation, this only shows four levels deep from the top level of the documentation. Please refrain from using more heading levels than will show in this tree as it makes navigating your document difficult. If you must use this many heading levels, it is a good sign that your document should be split up into multiple pages.
de: Jede Überschriften-Ebene erzeugt eine Unterabschnitt im globalen Inhaltsverzeichnis, wenn die Dokumentation erzeugt wird. In der primären (web) Version der Dokumentation werden nur die ersten vier Ebenen dargestellt. Bitte daher nicht mehr Ebenen verwenden, als im Inhaltsverzeichnis dargestellt werden, um die Navigation im Dokument nicht zu erschweren. Wenn sehr viele Überschriften-Ebenen benötigt werden, sollte das Dokument in mehrere Seiten gesplittet werden.
es: Cada nivel de encabezamiento crea una sub-sección en el árbol de la tabla de contenido global disponible cuando se crea la documentación. En la versión primaria (web) de la documentación, esto solo muestra cuatro niveles desde el nivel superior de la documentación. Evite utilizar más niveles de títulos de los que se muestran en este árbol, ya que dificulta la navegación de su documento. Si debe usar muchos niveles de encabezamiento, esto es una buena señal de que su documento se debería dividir en varias páginas.
ru: Каждый заголовок автоматически формирует подраздел в оглавлении. В онлайн-документации отображается только четыре уровня от основного раздела документации. Пожалуйста, воздержитесь от использования большего количества уровней заголовков, это затрудняет навигацию по документу. Если Вам необходимо использовать множество подзаголовков, то лучше разбить документ на несколько страниц.

source: Table of contents
ca: Taula de continguts
de: Inhaltsverzeichnis
es: Tabla de contenidos
nb: Innholdsfortegnelse
ru: Содержание

source: People can't navigate to your new page if they can't find it. Neither can Sphinx. That's why you need to add new pages to Sphinx's table of contents.
ca: La gent no pot navegar a la vostra pàgina si no la poden trobar. Tampoc no pot l'Sphinx. És per això que heu d'afegir pàgines noves a la taula de continguts de l'Sphinx.
de: Niemand wird die neue Seite aufrufen, wenn man sie nicht findet. Da geht es Sphinx nicht anders. Deshalb muss jede neue Seite zu Sphinx Inhaltsverzeichnis hinzugefügt werden.
es: La gente no puede navegar a su nueva página si no pueden encontrarla. Tampoco Sphinx. Por eso necesita añadir nuevas páginas a la tabla de contenidos de Sphinx.
nb: Folk kan ikke navigere til den nye siden din hvis de ikke finner den. Det kan heller ikke Sphinx. Derfor må du legge til nye sider i Sphinx innholdsfortegnelse.
ru: Пользователи не могут перейти на новую страницу, если не могут ее найти. Это справедливо и для системы Sphinx. Поэтому сначала нужно добавить страницы в оглавление Sphinx.

source: You can do this by adding the page to the ``index.rst`` file in the same directory that you created it. For example, if you create a file called "newpage.rst", you would add the line marked with a chevron (>) in the nearest index:
de: Dies kann durch Hinzufügen der Seite zur Datei ``index.rst`` im selben Verzeichnis erfolgen. Wenn z.B. die Datei "newpage.rst" erstellt wird, müsste die mit dem Größer-Zeichen (>) markierte Zeile in den nächsten Index eingefügt werden:
es: Puede hacer esto añadiendo la página al archivo ``index.rst`` en el mismo directorio en que la haya creado. Por ejemplo, si ha creado un archivo titulado "newpage.rst", añadiría la línea marcada con un mayor que (>) en el índice mas cercano:
ru: Это можно сделать, добавив страницу в файл ``index.rst``, который находится в этой же папке. Например, если вы создадите файл с именем «newpage.rst», добавьте строку строку в индексный файл и обозначьте ее символом (>):

source: The order matters. If you would like your page to appear in a certain place in the table of contents, place it there. In the previous example, newpage would be added to the end of this table of contents.
ca: L'ordre importa. Si us agradaria que la vostra pàgina aparegui a un lloc determinat de la taula de continguts, ubiqueu-la allà. A l'exemple anterior, paginanova s'afegiria al final de la taula de continguts.
de: Die Reihenfolge ist dabei entscheidend. Falls die Seite an einer bestimmten Stelle im Inhaltsverzeichnis auftauchen soll, muss es dort entsprechend platziert werden. Im vorherigen Beispiel würde newpage am Ende des Inhaltsverzeichnisses eingefügt werden.
es: El orden importa. Si le gustaría que su página aparezca en un sitio determinado de la tabla de contenidos, sitúela allí. En el ejemplo anterior, la nueva página sería añadida al final de esta tabla de contenidos.
nb: Bestillingen betyr noe. Hvis du vil at siden din skal vises på et bestemt sted i innholdsfortegnelsen, plasserer du den der. I forrige eksempel vil newpage bli lagt til på slutten av denne innholdsfortegnelsen.
ru: Важен порядок страниц. Если Вы хотите, чтобы страница появлялась в определенном месте в оглавлении, разместите ее в этом месте в документации. В предыдущем примере новая страница добавлена в конец документа и оглавления.

source: Moving pages
de: Seiten verschieben

source: Sometimes it becomes necessary to move a page from one place in the documentation to another. Generally this is to improve document flow: For example, it makes more sense for the page to come after a page you've just added in a different section.
de: Manchmal wird es notwendig, eine Seite in der Dokumentation an eine andere Stelle zu verschieben. Im Allgemeinen dient dies der Verbesserung des Dokumentflusses: So ist es z. B. sinnvoller, die Seite hinter einer gerade bearbeiteten Seite eines anderen Abschnittes einzufügen.
nb: Noen ganger blir det nødvendig å flytte en side fra ett sted i dokumentasjonen til et annet. Generelt er dette for å forbedre dokumentflyten: For eksempel er det mer fornuftig at siden kommer etter en side du nettopp har lagt til i en annen seksjon.

source: However, people link to our documentation from many sources that we do not control. Blogs, websites, and other documentation sites can direct people here using links that they may never update. It is a terrible experience to follow a link from a different site and land on a 404 page, left to your own devices to find your way in restructured documentation.
de: ‎Die Leute verlinken jedoch aus vielen Quellen zu unserer Dokumentation, was wir nicht beeinflussen können. ‎Personen können über Blogs, Websites und andere Dokumentationsseiten, deren Links möglicherweise nie aktualisiert werden, hierhergelangen. ‎Es ist keine schöne Erfahrung, einem Link von einer anderen Website zu folgen und auf einer 404-Seite zu landen, um sich selbst überlassen in einer neu strukturierten Dokumentation zurechtfinden zu müssen.
nb: Imidlertid lenker folk til dokumentasjonen vår fra mange kilder som vi ikke kontrollerer. Blogger, nettsteder og andre dokumentasjonssider kan henvise folk hit ved hjelp av lenker som de kanskje aldri oppdaterer. Det er en forferdelig opplevelse å følge en lenke fra et annet nettsted og lande på en 404-side, overlatt til dine egne enheter for å finne veien i omstrukturert dokumentasjon.

source: We use a tool called Rediraffe to avoid this bad experience. Rediraffe creates redirect pages which can send a user from an old, invalid link to a new, useful link. Please create a redirect link when changing a page's name or moving a page within the documentation's directory structure. Redirect links are created by placing the filename of the old document and the filename of the new document, relative to the documentation's root, in the `redirects.txt file <https://github.com/ubports/docs.ubports.com/blob/master/redirects.txt>`_.
de: ‎Wir verwenden ein Tool namens Rediraffe, um diese schlechte Erfahrung zu vermeiden. Rediraffe erstellt Weiterleitungsseiten, die einen Benutzer von einem alten, ungültigen Link zu einem neuen, nützlichen Link befördern können. ‎Erstellen Sie einen Weiterleitungslink, wenn Sie den Namen einer Seite ändern oder eine Seite innerhalb der Verzeichnisstruktur der Dokumentation verschieben. Weiterleitungslinks werden erstellt, indem der Dateiname des alten Dokuments und der Dateiname des neuen Dokuments relativ zum Stamm der Dokumentation in der `Datei redirects.txt <https://github.com/ubports/docs.ubports.com/blob/master/redirects.txt>`_ platziert werden.

source: We use Rediraffe's ``checkdiff`` builder to ensure that pages are not deleted from the documentation without a redirect in place. This builder is run as part of the ``build.sh`` script in the repository and as part of our automated build once you submit a Pull Request.
de: ‎Wir verwenden den ``checkdiff`` Builder von Rediraffe, um sicherzustellen, dass Seiten nicht ohne Weiterleitung aus der Dokumentation gelöscht werden. Dieses Programm wird als Teil des ``build.sh`` Skripts im Repository und als Teil unseres automatisierten Build-Prozesses ausgeführt, sobald Sie einen Pull Request senden.

source: What follows are some examples of situations where you should create redirects.
de: Es folgen einige Beispiele für Fälle, in denen Sie Weiterleitungen erstellen sollten.
nb: Det som følger er noen eksempler på situasjoner der du bør opprette viderekoblinger.

source: You are moving ``systemdev/calendars.rst`` to ``appdev/calendars.rst``. Add the following to the ``redirects.txt`` file::
de: Wenn Sie ``systemdev/calendars.rst`` nach ``appdev/calendars.rst`` verschieben, fügen Sie Folgendes der Datei ``redirects.txt`` hinzu:

source: You are moving ``appdev/clickable.rst`` into several pages in ``appdev/clickable/`` to give significantly more information about the tool than there was previously. You have created an introduction page, ``appdev/clickable/introduction.rst``. In this case, it would be a good idea to redirect the old page to the new introduction page. This can be done by adding the following to ``redirects.txt``::
de: Wenn Sie ``appdev/clickable.rst`` auf mehrere Seiten in ``appdev/clickable/`` verschieben, um deutlich mehr Informationen über das Tool bereitzustellen als zuvor, und wenn Sie eine Einführungsseite ``appdev/clickable/introduction.rst`` erstellt haben, wäre es in diesem Fall eine gute Idee, die alte Seite auf die neue Einführungsseite weiterzuleiten. Dies kann erreicht werden, indem Folgendes zur Datei ``redirects.txt`` hinzugefügt wird:

source: Warnings
ca: Advertiments
de: Warnungen
es: Advertencias
nb: Advarsler
ru: Предупреждения и ошибки

source: Your edits must not introduce any warnings into the documentation build. If any warnings occur, the build will fail and your pull request will be marked with a red 'X'. Please ensure that your RST is valid and correct before you create a pull request. This is done automatically (via sphinx-build crashing with your error) if you follow :ref:`our build instructions <doc-contribution-workflow>` below.
de: Änderungen dürfen keine Warnungen bei der Erzeugung der Dokumentation hervorrufen. Falls Warnungen auftreten, schlägt die Erzeugung fehl und der Pull-Request wird mit einem roten 'X' markiert. Bitte sicher stellen, dass das RST gültig und korrekt ist, bevor ein Pull-Request geöffnet wird. Dies geschieht automatisch (wenn sphinx-build auf den Fehler stößt), wenn die :ref:`Anleitungen <doc-contribution-workflow>` befolgt werden.
es: Sus ediciones no deben introducir ninguna advertencia en la construcción de la documentación. Si ocurre alguna advertencia, la construcción fallará y su solicitud de incorporación de cambios («pull request») será marcada con una «X» roja. Asegúrese de que su RST es válido y correcto antes de crear su solicitud de incorporación de cambios («pull request»). Esto se hace automáticamente (vía sphinx-build fallando con su error) si sigue ref:`nuestras instrucciones de construcción <doc-contribution-workflow>` siguientes.
ru: Правки не должны вносить никаких ошибок в раздел с документацией. Если появятся какие-либо предупреждения или ошибки, сборка завершится неудачно, и запрос на компиляцию будет помечен красным крестиком. Пожалуйста, убедитесь, что ваш RST-файл является правильным, прежде чем запускать процесс сборки. Это произойдет автоматически (через sphinx-build crashing), если Вы будете выполнять :ref:`инструкции по созданию документации <doc-contribution-workflow>`, приведённые ниже.

source: Line length
de: Zeilenlänge
es: Longitud de línea
nb: Linjelengde
ru: Длина строки

source: There is no restriction on line length in this repository. Please do not break lines at an arbitrary line length. Instead, turn on word wrap in your text editor.
de: Es gibt keine Begrenzung für die Zeilenlänge in diesem Repository. Bitte keinen Zeilenumbruch an einer beliebigen Stelle einfügen.
es: No hay restricciones para la longitud de línea en este repositorio. No rompa las líneas en una longitud arbitraria. En su lugar, active el ajuste de línea en su editor de texto.
nb: Det er ingen begrensning på linjelengden i dette arkivet. Vennligst ikke bryt linjer med en vilkårlig linjelengde. I stedet slår du på ordpakking i tekstredigeringsprogrammet.
ru: Ограничений на длину строки нет (для этого репозитория). Пожалуйста, не создавайте строк разной длины. Настройте в текстовом редакторе автоматический перенос.

source: Contribution workflow
ca: Flux de treball de les contribucions
de: Arbeitsablauf
es: Flujo del trabajo de contribución
ru: Редактирование и внесение правок

source: The following steps will help you to make a contribution to this documentation after you have written a document.
de: Die folgenden Schritte helfen dabei, einen Beitrag zu dieser Dokumentation zu leisten, nachdem man ein Dokument geschrieben hat.
es: Los siguientes pasos le ayudarán a hacer una contribución a esta documentación después de que haya escrito un documento.
nb: Følgende trinn vil hjelpe deg med å gi et bidrag til denne dokumentasjonen etter at du har skrevet et dokument.
ru: Следующие действия помогут внести исправления в документ после того, как он был опубликован.

source: You will need a GitHub account to complete these steps. If you do not have one, click `here <https://github.com/join>`_ to begin the process of making an account.
ca: Us caldrà un compte del GitHub per completar aquests passos. Si no en teniu una, cliqueu `aquí <https://github.com/join>`_ per començar el procés de crear un compte.
de: Ein GitHub-Konto ist Voraussetzung für diese Schritte. Falls noch nicht geschehen, `hier <https://github.com/join>`_ das Konto anlegen.
es: Necesitará una cuenta de GitHub para completar estos pasos. Si no tiene una, pulse `aquí <https://github.com/join>`_ para comenzar el proceso de hacerse una cuenta.
ru: Вам понадобится учетная запись на GitHub, чтобы закончить перевод. Если Вы не зарегистрированы на этом ресурсе, сделайте это `по ссылке <https://github.com/join>`.

source: Forking the repository
de: Forken des Repository
es: Bifurcando el repositorio
nb: Forgrene arkivet
ru: Клонирование (форк) репозитория с документацией
