Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: You can make more advanced edits to our documentation by forking `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ on GitHub. If you're not sure how to do this, check out the excellent GitHub guide on `forking projects <https://guides.github.com/activities/forking/>`_.
ca: Podeu fer edicions més avançades de la nostra documentació bifurcant `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ al GitHub. Si no teniu seguretat sobre com fer això, mireu l'excel·lent guia del GitHub a `bifurcació de projectes <https://guides.github.com/activities/forking/>`_.
de: Fortgeschrittenere Änderungen an der Dokumentation können durch einen Fork (Abspaltung) von `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ auf GitHub durchgeführt werden. Falls nicht klar ist, wie das geht, hilft die exzellente GitHub-Anleitung auf `forking projects <https://guides.github.com/activities/forking/>`_ weiter.
es: Puede realizar ediciones mas avanzadas de nuestra documentación mediante la bifurcación (fork) de `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`_ en GitHub. Si no está seguro de como hacerlo, revise la excelente guía de GitHub sobre como `bifurcar proyectos <https://guides.github.com/activities/forking/>`_.
ru: Можно существенно переработать документацию, но для этого лучше сделать форк проекта `ubports/docs.ubports.com <https://github.com/ubports/docs.ubports.com>`на сайте GitHub. Если у Вас есть вопросы по этому процессу, прочитайте подробное руководство на сайте `GitHub <https://guides.github.com/activities/forking/>`_.

source: Building the documentation
de: Die Dokumentation erzeugen
es: Construyendo la documentación
ru: Сборка комплекта документации

source: If you'd like to build this documentation *before* sending a PR (which you should), follow these instructions on your *local copy* of your fork of the repository.
ca: Si voleu compilar aquesta documentació *abans* d'enviar una demanda de baixada (cosa que hauríeu de fer), seguiu aquestes instruccions a la *còpia local* de la vostra bifurcació del repositori.
de: Soll diese Dokumentation lokal erzeugt werden, *bevor* der Pull Request erstellt wird (was man auch tun sollte), folgt man diesen Anweisungen auf der *lokalen Kopie* des eigenen Forks vom Repository.
es: Si desea construir esta documentación *antes* de enviar una solicitud de extracción o PR (que debería), siga estas instrucciones en su *copia local* de su bifurcación (fork) del repositorio.
ru: Если Вы хотите скомпилировать пакет с комплектом документации *до* отправки нам pull request, эти инструкции помогут работать с *локальной копией* или форком репозитория.

source: The documentation can be built by running ``./build.sh`` in the root of this repository. The script will also create a virtual build environment in ``~/ubportsdocsenv`` if none is present.
de: Die Dokumentation kann durch Ausführen von ``./build.sh`` im Wurzelverzeichnis des Repository erzeugt werden. Das Skript erzeugt ebenfalls eine virtuelle Build-Umgebung in ``~/ubportsdocsenv``, falls noch nicht vorhanden.
es: La documentación se puede construir ejecutando ``./build.sh`` en la raíz de este repositorio. El guión (script) creará también un entorno de construcción virtual en ``~/ubportsdocsenv`` si no hay ninguno presente.
ru: Комплект документации можно скомпилировать, запустив скрипт ``./build.sh`` в корневой директории этого репозитория. Скрипт также создаст виртуальное рабочее окружение для компиляции в директории ``~ /ubportsdocsenv``, если его еще нет.

source: If all went well, you can enter the ``_build/html`` directory and open ``index.html`` to view the UBports documentation.
de: Wenn alles gut geht, kann das Verzeichnis ``_build`` betreten und ``index.html`` geöffnet werden, um die UBports-Dokumentation anzuzeigen.
es: Si todo fue bien, puede ir al directorio ``_build/html`` y abrir ``index.html`` para ver la documentación de UBports.
ru: Если скрипт успешно отработал, появятся директории ``_build/html``, где будет находится файл с документацией``index.html``.

source: If you have trouble building the docs, the first thing to try is deleting the build environment. Run ``rm -r ~/ubportsdocsenv`` and try the build again. Depending on when you first used the build script, you may need to run the ``rm`` command with ``sudo``.
de: Hat man Probleme beim Erstellen der Dokumentation, so sollte man zunächst versuchen, die Build-Umgebung zu löschen. Dazu führt man ``rm-r ~/ubportsdocsenv`` aus und versucht das Erstellen erneut. Je nachdem, wann das Erstellungsskript zum ersten Mal verwendet wurde, muss der Befehl ``rm`` möglicherweise mit ``sudo`` ausgeführt werden.
es: Si tiene algún problema construyendo los documentos, la primera cosa que debe intentar es eliminar el entorno de construcción. Ejecute ``rm -r ~/ubportsdocsenv`` e intente la construcción de nuevo. Dependiendo de cuando usó por primera vez el guión (script) de construcción, puede que necesite ejecutar la orden ``rm`` con ``sudo``.
ru: Если у Вас возникают проблемы при компиляции пакета документации, сначала попробуйте удалить рабочую среду для формирования сборки. Запустите команду ``rm -r ~/ubportsdocsenv`` и попробуйте снова запустить процесс сборки. В зависимости от рабочего окружения может потребоваться команда ``sudo`` перед ``rm``.

source: Final check of your contribution
de: Endkontrolle Ihres Beitrags
nb: Sluttkontroll av ditt bidrag

source: After you have created your PR on github, the CI (continuous integration) system will make a test build of your contribution. Please double check whether this builds successfully and whether the result looks as you intended it to:
de: ‎Nachdem Sie Ihren Pull Request auf GitHub erstellt haben, wird das System zur kontinuierlichen Integration (CI) eine Testversion Ihres Beitrags erstellen. Überprüfen Sie bitte genau, ob dies erfolgreich war und ob das Ergebnis wie beabsichtigt aussieht:

source: Scroll to the bottom of the "Conversation" tab of your PR on github, here you will see the checks (You may have to click on "Show all checks")
de: ‎Scrollen Sie zum unteren Rand der Registerkarte "Conversation" (Unterhaltung) Ihres Pull Requests auf GitHub, hier sehen Sie die Überprüfungen (Checks), möglicherweise müssen Sie auf "Show all checks" (Alle Überprüfungen anzeigen) klicken

source: It can have a yellow dot, i.e., "pending" then wait a few more seconds.
de: ‎Es kann ein gelber Punkt angezeigt werden, d.h. "ausstehend", dann warten Sie ein paar Sekunden länger.
nb: Den kan ha en gul prikk, dvs. "på vent", deretter vent noen sekunder til.

source: Or it may have a red X, i.e., it failed. In this case please check why it failed
de: ‎Oder es wird ein rotes X angezeigt, d.h. es ist fehlgeschlagen. Überprüfen Sie in diesem Fall, warum es fehlgeschlagen ist‎
nb: Eller det kan ha en rødt X, dvs. det mislyktes. I dette tilfellet må du sjekke hvorfor det mislyktes

source: If it shows a green check mark, it means the PR could be built successfully
de: ‎Wenn ein grünes Häkchen angezeigt wird, konnte der Pull Request erfolgreich erstellt werden

source: Now please click on "Details",
de: ‎Klicken Sie jetzt bitte auf "Details" (Einzelheiten),‎
nb: Nå vennligst klikk på "Detaljer",

source: then "Artifacts" on the top right,
de: ‎dann "Artifacts" (Werkzeuge) oben rechts,‎
nb: deretter "Artefakter" øverst til høyre,

source: then "_build/html/..index.html",
de: dann "_build/html/..index.html",
nb: deretter "_build/html/..index.html",

source: and finally on "Go to start page".
de: ‎und schließlich auf "Go to start page" (Gehe zur Startseite).
nb: og til slutt på "Gå til startside".

source: Now you can browse a complete build of the UBports docs site with your contribution included. Double check whether your changes look ok.
de: ‎Jetzt können Sie eine vollständige Version der UBports docs-Website mit Ihrem Beitrag einsehen. Überprüfen Sie genau, ob Ihre Änderungen in Ordnung sind.
nb: Nå kan du bla gjennom en komplett versjon av UBports docs-nettstedet med bidraget ditt inkludert. Dobbeltsjekk om endringene dine ser bra ut.

source: Alternative methods to contribute
de: Alternative Methoden zur Beteiligung
es: Métodos alternativos para contribuir
nb: Alternative metoder for å bidra
ru: Другие способы помощи

source: Translations
ca: Traduccions
de: Übersetzungen
es: Traducciones
nb: Oversettelser
ru: Перевод на другие языки

source: You may find the components of this document to translate at `its project in UBports Weblate`_.
de: Die Komponenten dieses Dokuments findet man zur Übersetzung auf `UBports Weblate`_.
es: Puede encontrar los componentes de este documento para traducir en `its project in UBports Weblate`_.
ru: Можно перевести инструкции и разделы документации в специальном проекте по переводам на ресурсе `UBports Weblate`_.

source: Writing documents not in RST format
de: Dokumente ohne RST-Format schreiben
es: Escribir documentos en un formato diferente a RST
ru: Подготовка документации в форматах, отличных от RST

source: If you would like to write documents for UBports but are not comfortable writing ReStructuredText, please write it without formatting and post it on the `UBports Forum`_ in the relevant section (likely General). Someone will be able to help you revise your draft and write the required ReStructuredText.
de: Falls man Dokumente für UBports schreiben möchte, sich aber unwohl bei der Verwendung von ReStructuredText fühlt, erstellt man das Dokument ohne Formatierung und teilt es im `UBports Forum`_ in einem passenden Abschnitt (wahrscheinlich Allgemein). Es wird sich jemand finden, der den erforderlichen ReStructuredText daraus formt.
es: Si le gustaría escribir documentos para UBports pero no está cómodo escribiendo en ReStructuredText, escríbalo sin formato y publíquelo en `UBports Forum`_ en la sección relevante (probablemente en General). Alguien le ayudará a revisar su borrador y escribir el necesario ReStructuredText.
nb: Hvis du ønsker å skrive dokumenter for UBports, men ikke er komfortabel med å skrive ReStructuredText, kan du skrive det uten formatering og legge det ut på `UBports Forum`_ i den aktuelle delen (sannsynligvis Generelt). Noen vil kunne hjelpe deg med å revidere utkastet ditt og skrive den nødvendige ReStructuredText.
ru: Если Вы хотите написать инструкции по продуктам UBports, но по каким-то причинам не можете оформлять текст в формате ReStructuredText, пожалуйста, разместите текст без форматирования в форуме сообщества `UBports Forum`_ в соответствующем разделе (скорее всего, в разделе "General"). Кто-нибудь из пользователей отредактирует черновик и переведёт его в формат ReStructuredText.

source: Uncomfortable with Git
de: Unsicher mit Git
es: Incómodo con Git
nb: Ukomfortabel med Git
ru: Если нет возможности работать с Git

source: If you've written a complete document in ReStructuredText but aren't comfortable using Git or GitHub, please post it on the `UBports Forum`_ in the relevant section (likely General). Someone will be able to help you revise your draft and submit it to this documentation.
de: Falls man ein Dokument in ReStructuredText für UBports geschrieben hat, sich aber unwohl bei der Verwendung von Git oder GitHub fühlt, teilt man es im `UBports Forum`_ in einem passenden Abschnitt (wahrscheinlich Allgemein). Es wird sich jemand finden, der das Dokument in die Dokumentation einfügt.
es: Si ha escrito un documento completo en ReStructuredText pero no está cómodo usando Git o GitHub, publíquelo en `UBports Forum`_ en la sección relevante (probablemente en General). Alguien le ayudará a revisar su borrador y enviarlo a esta documentación.
nb: Hvis du har skrevet et komplett dokument i ReStructuredText, men ikke er komfortabel med å bruke Git eller GitHub, kan du legge det ut på `UBports Forum`_ i den relevante seksjonen (sannsynligvis Generelt). Noen vil kunne hjelpe deg med å revidere utkastet ditt og sende det inn til denne dokumentasjonen.
ru: Если Вы подготовили документ в формате ReStructuredText, но по каким-то причинам не можете использовать Git или GitHub, пожалуйста, опубликуйте его в в соответствующем разделе форума `UBports Forum`_ (например, в разделе General). Кто-нибудь из пользователей посмотрит черновик и перенесёт его в раздел документации.

source: Current TODOs
ca: PER FER actuals
de: Aktuelle TODOs
es: POR HACER actuales
nb: Nåværende GJØREMÅL
ru: Планы по дополнению и развитию этого раздела

source: This section lists the TODOs that have been included in this documentation. If you know how to fix one, please send us a Pull Request to make it better!
de: Dieser Abschnitt listet die TODOs auf, die zu dieser Dokumentation hinzugefügt wurden. Falls du weißt, wie einer davon erledigt werden kann, sende uns bitte einen Pull Request, um es zu verbessern!
es: Esta sección lista los POR HACER que han sido incluidos en esta documentación. Si sabe como arreglar alguno ¡por favor envíenos una solicitud de incorporación de cambios («pull request») para hacerlo mejor!
nb: Denne delen viser GJØREMÅL som er inkludert i denne dokumentasjonen. Hvis du vet hvordan du fikser en, kan du sende oss en Pull Request for å gjøre det bedre!
ru: В этой секции содержится список планов на будущее и недоработок,которые нужно устранить. Если Вы знаете, как это сделать, пожалуйста создайте соответствующий pull request на трекере.

source: To create a todo, add this markup to your page::
ca: Per crear un per fer, afegiu aquest marcatge a la vostra pàgina::
de: Um ein todo zu erzeugen, fügt man diese Textauszeichnung zur Seite hinzu::
es: Para crear un por hacer, añada esta marca a su página::
nb: For å lage et gjøremål, legg til denne markeringen på siden din ::
ru: Чтобы создать такой список, добавьте на свою страничку этот шаблон::

source: Contributing to UBports
ca: Contribució a l'UBports
de: Mitwirken an UBports
es: Contribuir a UBports
ru: Как можно помочь Сообществу UBports

source: Welcome! You're probably here because you want to contribute to UBports. The pages you'll find below here will help you do this in a way that's helpful to both the project and yourself.
ca: Us donem la benvinguda! Probablement esteu aquí perquè voleu contribuir al UBports. Les pàgines que trobareu a sota d'aquí us ajudarà a fer això d'una manera útil tant per al projecte com per a vós.
de: Willkommen! Sie sind wahrscheinlich hier, weil Sie Ihren Teil zu UBports beitragen möchten. Diese Seiten werden Ihnen dabei helfen, auf eine Weise mitzuwirken, die allen Beteiligten hilft.
es: ¡Bienvenido/a! Probablemente esté aquí porque desea contribuir con UBports. Las páginas que encontrará más abajo le ayudarán a hacer esto de una manera que es útil para el proyecto y para usted.
nb: Velkommen! Du er sannsynligvis her fordi du vil bidra til UBports. Sidene du finner nedenfor vil hjelpe deg med å gjøre dette på en måte som er nyttig for både prosjektet og deg selv.
ru: Добро пожаловать! Скорее всего, Вы находитесь здесь потому, что хотите внести свой вклад в UBports. Ниже находится материал, который поможет сделать это с пользой как для проекта, так и для самого участника.

source: If you're just getting started, we always need help with :doc:`thorough bug reporting <bugreporting>`. If you are multilingual, :doc:`translations <translations>` are also a great place to start.
ca: Si us esteu iniciant ara, sempre es cal ajuda amb :doc:`informes d'errors detallats <bugreporting>`. Si sabeu moltes llengües, :doc:`traduccions <translations>` també són un bon lloc per començar.
de: Falls Sie neu hier sind, brauchen wir immer Hilfe beim :doc:`sorgfältigen Melden von Fehlern <bugreporting>`. Falls Sie mehrsprachig sind, ist auch :doc:`translations <translations>` immer ein guter Platz zum Anfangen.
es: Si está simplemente comenzando, siempre necesitamos ayuda con :doc:`informes exhaustivos de errores <bugreporting>`. Si es políglota :doc:`translations <translations>` es también un gran lugar para comenzar.
ru: Если Вы только начинаете знакомство с Ubuntu Touch, мы будем благодарны за :doc:`сообщения об ошибках <bugreporting>`. Если Вы знаете иностранные языки, помогите нам с :doc:`переводами <translations>`.

source: If those aren't enough for you, see `our contribute page <https://ubports.com/page/vo-get-involved>`_ for an introduction of our focus groups.
ca: Si això no us és prou, vegeu `la nostra pàgina de contribució <https://ubports.com/page/vo-get-involved>`_ per a una introducció dels nostres grups focals.
de: Falls Ihnen das nicht ausreicht, schauen Sie `unsere Mitmachen-Seite <https://ubports.com/page/vo-get-involved>`_ für eine Einführung in die Fokusgruppen an.
es: Si eso no es suficiente para usted, vea `nuestra página de contribución <https://ubports.com/page/vo-get-involved>`_ para una introducción en nuestros grupos focales.
nb: Hvis det ikke er nok for deg, kan du se `vår bidragsside <https://ubports.com/page/vo-get-involved>` _ for en introduksjon av våre fokusgrupper.
ru: Также можно посмотреть страничку `Как можно помочь <https://ubports.com/page/vo-get-involved>`, где есть ссылки на тематические группы.

source: Monetary support
ca: Suport monetari
de: Finanzielle Unterstützung
es: Apoyo monetario
nb: Pengestøtte
ru: Финансовая помощь

source: You can help us keep the lights on at UBports by becoming a patron on `Liberapay <https://liberapay.com/UBports/>`_ or `Patreon <https://www.patreon.com/ubports>`_!
ca: També podeu ajudar a mantenir els llums encesos a l'UBports afegint-vos al patronatge a `Liberapay <https://liberapay.com/UBports/>`_ o `Patreon <https://www.patreon.com/ubports>`_!
de: Du kannst dabei helfen, den Betrieb von UBports weiterhin zu gewährleisten, indem Du ein `Förderer (Patron) <https://www.patreon.com/ubports>`_ wirst!
es: Puede ayudarnos a mantener las luces encendidas en UBports ¡convirtiéndose en un patrón en `Liberapay <https://liberapay.com/UBports/>`_ o `Patreon <https://www.patreon.com/ubports>`_!
nb: Du kan hjelpe oss med å holde lysene på UBports ved å bli bidragsyter `Liberapay <https://liberapay.com/UBports/>`_ eller `Patreon <https://www.patreon.com/ubports>`_!
ru: На развитие проектов UBports можно сделать пожертвования через сервисы `Liberapay <https://liberapay.com/UBports/>`_ или `Patreon <https://www.patreon.com/ubports>`_.

source: Your contribution finances our server infrastructure and debug services, and helps covering additional costs.
ca: La vostra contribució finança la nostra infraestructura de servidors i els nostres serveis de depuració, i ajuda a cobrir costos addicionals.
de: Dein Beitrag finanziert unsere Server-Infrastruktur und Fehlerbehebungsdienste und hilft uns, weitere Kosten zu decken.
es: Su contribución financia nuestra infraestructura de servidores y servicios de depuración y ayuda a cubrir los costes extras.
nb: Ditt bidrag finansierer serverinfrastrukturen og feilsøkingstjenestene våre, og hjelper til med å dekke merkostnader.
ru: Ваши пожертвования пойдут на аренду серверов и оплату лицензионного ПО, а так же на всякие сопутствующие траты.

source: Preinstalled apps
de: Vorinstallierte Apps
es: Aplicaciones pre-instaladas
nb: Preinstallerte apper
ru: Предустановленные приложения

source: This page will help you get started with developing the apps which are included with Ubuntu Touch.
de: Diese Seite wird Ihnen helfen, mit der Entwicklung der Apps zu beginnen, die in Ubuntu Touch enthalten sind.
es: Esta página le ayudará a comenzar con el desarrollo de aplicaciones que están incluidas con Ubuntu Touch.
nb: Denne siden hjelper deg med å komme i gang med å utvikle appene som følger med Ubuntu Touch.
ru: На этой странице содержится материал по созданию приложений, которые по умолчанию включены в образ системы Ubuntu Touch.

source: Core apps
de: Kernanwendungen
es: Aplicaciones principales
nb: Kjerneapper
ru: Базовые приложения

source: Core apps are applications which are included with UBports distributions of Ubuntu Touch **and** placed in the OpenStore for updates. Core apps are a good "first development" experience within UBports. Many are built with `Clickable`_, an easy to use build and test system for Ubuntu Touch apps. Most core apps can even be built and run without an Ubuntu Touch device!
de: Core Apps sind Anwendungen, die in den UBports-Distributionen von Ubuntu Touch enthalten sind **und** im OpenStore für Updates platziert werden. Core Apps sind eine gute "First Development" Erfahrung in UBports. Viele sind mit `Clickable`_ erstellt, einem einfach zu bedienenden Build und Testsystem für Ubuntu Touch Apps. Die meisten Kernanwendungen können sogar ohne Ubuntu Touch-Gerät erstellt und ausgeführt werden!
es: Las aplicaciones principales son aquellas que están incluidas con las distribuciones de UBports de Ubuntu Touch **y** están en OpenStore para sus actualizaciones. Las aplicaciones principales son una buena experiencia como «primer desarrollo» dentro de UBports. Muchas están construidas con `Clickable`_, un sencillo sistema de construcción y prueba para las aplicaciones de Ubuntu Touch. La mayoría de las aplicaciones principales ¡incluso se pueden construir y ejecutar sin un dispositivo con Ubuntu Touch!
nb: Kjerneapper er applikasjoner som er inkludert i UBports-distribusjoner av Ubuntu Touch **og** plassert i OpenStore for oppdateringer. Kjerne apper er en god "første utvikling" -opplevelse innen UBports. Mange er bygget med `Clickable`_, et brukervennlig bygge- og testsystem for Ubuntu Touch-apper. De fleste kjerneappene kan til og med bygges og kjøres uten en Ubuntu Touch-enhet!
ru: Базовые приложения - это программы, которые включены в комплект поставки Ubuntu Touch **и** размещены в OpenStore для последующих обновлений. Базовые приложения позволяют познакомиться поближе с Ubuntu Touch и получить первое впечатление об этой операционной системе. Большинство таких программ скомпилированы с помощью `Clickable`_, простой среды для компиляции и тестирования программ для Ubuntu Touch. Большинство базовых программ можно скомпилировать и запустить без мобильного устройства с Ubuntu Touch.

source: Which core apps currently exist?
de: Welche Kernanwendungen gibt es aktuell?
es: ¿Qué aplicaciones principales existen actualmente?
nb: Hvilke kjerneapper eksisterer for tiden?
ru: Какие базовые программы уже существуют?

source: A full list of the Ubuntu Touch core apps follows.
de: Es folgt eine Liste der Kernanwendungen (core apps) von Ubuntu Touch.
es: Lista completa de aplicaciones principales de Ubuntu Touch a continuación.
nb: En fullstendig liste over Ubuntu Touch-kjerneapper følger.
ru: Полный список основных программ для Ubuntu Touch будет далее.

source: Application Name
de: Name der Applikation
es: Nombre de la aplicación
nb: Applikasjon navn
ru: Название приложения

source: Store page
de: Store-Seite
es: Página en OpenStore
ru: Страница в OpenStore

source: Code repository
de: Repository des Quellcodes
es: Repositorio de código
nb: Kode arkiv
ru: Репозиторий с исходным кодом

source: Calculator
de: Taschenrechner
es: Calculadora
nb: Kalkulator
ru: Калькулятор

source: `Calculator on OpenStore`_
de: `Taschenrechner im OpenStore`_
es: `Calculadora en OpenStore`_
nb: `Kalkulator i OpenStore`_
ru: `Калькулятор в OpenStore`_

source: `calculator-app on GitLab`_
de: `Taschenrechner-App auf GitHub`_
ru: `calculator-app в GitLab`_

source: Calendar
de: Kalender
es: Calendario
nb: Kalender
ru: Календарь

source: `Calendar on OpenStore`_
de: `Kalender im OpenStore`_
es: `Calendario en OpenStore`_
nb: `Kalender i OpenStore`_
ru: `Календарь в OpenStore`_

source: `calendar-app on GitLab`_
de: `Kalender-App auf GitLab`_
ru: `calendar-app в GitLab`_

source: Clock
de: Uhr
es: Reloj
nb: Klokke
ru: Часы

source: `Clock on OpenStore`_
de: `Uhr im OpenStore`_
es: `Reloj en OpenStore`_
nb: `Klokke i OpenStore`_
ru: `Приложение "Часы" в OpenStore`_
