Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: Most apps running on Ubuntu Touch use `GNU gettext <https://www.gnu.org/software/gettext/>`_ for translations. A *.pot* template file holds an apps strings. From this template for every language an individual *.po* file is derived. Those *.po* files do contain the actual translations. To add a new language a new *.po* file needs to be created. To translate a string the *.po* file needs to be edited. Next to the original string (english in most cases) the appropriate translation needs to be entered following the *.po* gettext file syntax. Some apps do use `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`_ for translation. It does follow the same priciples only using *.ts* files for translations with another syntax. As template one *.ts* file is used.
de: ‎Die meisten Apps, die auf Ubuntu Touch laufen, verwenden `GNU gettext <https://www.gnu.org/software/gettext/>`_ für Übersetzungen. Eine *.pot*-Vorlagendatei‎‎ enthält App-Zeichenfolgen. Aus dieser Vorlage wird für jede Sprache eine einzelne *.po*-Datei‎‎ abgeleitet. Diese *.po*-Dateien‎‎ enthalten die eigentlichen Übersetzungen. Um eine neue Sprache hinzuzufügen, muss eine neue *.po*-Datei‎‎ erstellt werden. Um eine Zeichenfolge zu übersetzen, muss die *.po*-Datei‎‎ bearbeitet werden. Neben der ursprünglichen Zeichenfolge (meistens Englisch) muss die entsprechende Übersetzung gemäß der *.po* gettext Dateisyntax eingegeben werden. Einige Apps verwenden `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`_ für die Übersetzung. Es folgt den gleichen Prinzipen, aber mit *.ts*-Dateien‎‎ für Übersetzungen mit einer anderen Syntax. Als Vorlage wird eine *.ts*-Datei‎‎ verwendet.
ru: Большинство приложений для Ubuntu Touch переводятся с помощью `GNU gettext <https://www.gnu.org/software/gettext/>`_. В *.pot*-файле находятся строки со всеми подписями и текстами из приложения. Из этого файла формируется отдельный *.po*-файл для каждого языкового раздела. Этот файл можно можно открыть в любом текстовом редакторе. За каждой оригинальной строкой (в большинстве случаев, на английском) следует переведенная строка согласно правилам и синтаксису файлов *.po*. Некоторые приложения можно перевести с помощью `QtLinguist <https://doc.qt.io/qt-5/qtlinguist-index.html>`.

source: Within a app strings are marked either this way ``i18n.tr("string")`` when using gettext or like this ``tr("string")`` when using QtLinguist. When the app is build those translatable strings are extracted and written into the *.pot* or *.ts* template files. The *.po* and *.ts* language files then need to be updated from their template.
de: Innerhalb einer App werden Zeichenfolgen bei Verwendung von gettext mit ``i18n.tr("string")`` markiert, oder mit ``tr("string")`` wenn QtLinguist verwendet wird. Wenn die App erstellt wird, werden diese übersetzbaren Zeichenfolgen extrahiert und in die *.pot*- oder *.ts*-Vorlagendateien‎‎ geschrieben. Die *.po*- und *.ts*-Sprachdateien müssen dann ausgehend von ihrer Vorlage aktualisiert werden.
ru: Внутри приложения строки помечаются следующим образом: `` i18n.tr ("string") `` при использовании gettext, или `` tr ("string") `` при использовании QtLinguist. При компиляции приложения эти строки извлекаются и записываются в файлы * .pot * или * .ts *. После перевода языковые файлы *.po * и * .ts * нужно обновить.

source: Once strings have been translated, they are made available for users with a new release of an app.
de: ‎Sobald Zeichenfolgen übersetzt wurden, werden sie Benutzern mit einer neuen Version der App zur Verfügung gestellt.
nb: Når strenger er oversatt, blir de gjort tilgjengelig for brukere med en ny utgivelse av en app.
ru: После завершения перевода, файлы доступны для всех пользователей в новой версии программы.

source: Methods of Translation
de: Übersetzerwerkzeuge
nb: Metoder for oversettelse
ru: Способы перевода

source: There are three common ways used to translate an app:
de: ‎Es gibt drei gebräuchliche Möglichkeiten zur Übersetzung einer App:
ru: Есть три способа перевести приложение:

source: Weblate: A web based translation tool. UBports apps using Weblate can be translated `here <https://translate.ubports.com/projects/>`_. There is an automatic transfer of new strings from an apps repo to weblate. Translated strings get back as commits to the repo from weblate.
de: Weblate: Ein webbasiertes Übersetzungswerkzeug. UBports Apps können mit Weblate `‎‎hier <https://translate.ubports.com/projects/>`_ ‎‎übersetzt werden. Es gibt eine automatische Übertragung neuer Zeichenfolgen vom App Repository zu Weblate. Übersetzte Zeichenfolgen werden von Weblate als bestätigte Änderungen (Commits) für das Repository zurückgegeben.
ru: Weblate: инструмент для онлайн-перевода через web-интерфейс. Страничка компонентов UBports для Weblate находится `по адресу<https://translate.ubports.com/projects/>`_. Новые строки для перевода переносятся сюда автоматически из всех приложений. Точно так же перемещаются в проекты готовые переводы.

source: Editor: Translation is done by changing *.po* files with the editor of your choice, and a GitHub/GitLab account. The *.po*/*.ts* files for each project are in their repository on `our GitLab organization <https://gitlab.com/ubports/apps>`_ or on `our GitHub organization <https://github.com/ubports>`_. After translating the translator commits new translations to an apps repo generally by opening a merge request/pull request.
de: Editor: Die Übersetzung erfolgt durch Ändern von *.po*-Dateien mit einem Editor ihrer Wahl und einem GitHub- oder GitLab-Konto. Die *.po*/*.ts*-Dateien für jedes Projekt sind im jeweiligen Repository in unserer `GitLab-Organisation <https://gitlab.com/ubports/apps>`_ oder auf unserer `GitHub-Organisation <https://github.com/ubports>`_. Nach der Übersetzung sendet der Übersetzer neue Übersetzungen üblicherweise an das Repository der App indem er einen Merge Request oder Pull Request öffnet.
ru: Редактор: файлы *.po* переводятся и редактируются в любом текстовом редакторе. /готовый вариант загружается на страничку проекта в GitHub/GitLab. Файлы *.po*/*.ts* для всех репозиторев Ubports в Gitlab находятся `здесь <https://gitlab.com/ubports/apps>`, в GitHub - `здесь <https://github.com/ubports>`_. После того, как перевод будет закончен, создайте merge request/pull request для загрузки в проект новых языковых файлов.

source: Team translation: We also have a `Translation Forum <https://forums.ubports.com/category/39/translations>`_ to discuss translating Ubuntu Touch and its core apps. Some projects are using Telegram or matrix groups too, and some teams are still using the Ubuntu Launchpad framework.
de: Übersetzungs-Team: Wir haben auch ein `Übersetzer-Forum <https://forums.ubports.com/category/39/translations>`_ zum Diskutieren von Übersetzungen von Ubuntu Touch und seinen Core-Apps. Einige Projekte nutzen auch Telegram oder Matrix-Gruppen und einige Teams nutzen noch das Ubuntu Launchpad Framework.
ru: Группы для перевода: на нашем форуме создан специальный раздел `Translation Forum <https://forums.ubports.com/category/39/translations>`_ , где обсуждается перевод системы Ubuntu Touch и всех базовых приложений. Переводы некоторых проектов обсуждаются в группах в Telegram или Matrix, а некоторые участники все еще переписываются на досках Ubuntu Launchpad.

source: Core apps and some community apps like dekko or TELEports are generally using weblate for translation. This is the preferred way to translate and it does not need any programming skills. Please have a look at the `UBports translation projects <https://translate.ubports.com/projects/>`_. When using weblate do not edit *.po* files manually. Commiting edited *.po* files can break the automated process of translation.
de: ‎Core-Apps und einige Community-Apps wie dekko oder TELEports verwenden in der Regel Weblate für die Übersetzung. Dies ist der bevorzugte Weg zu übersetzen und es braucht keine Programmierkenntnisse. Bitte werfen Sie einen Blick auf die `UBports Übersetzungsprojekte <https://translate.ubports.com/projects/>`_. Bearbeiten Sie bei der Verwendung von Weblate *.po*-Dateien‎‎ nicht manuell. Dies kann den automatisierten Übersetzungsprozess unterbrechen.
nb: Kjerneapps og noen fellesskapsapper som dekko eller TELEports bruker vanligvis weblate for oversettelse. Dette er den foretrukne måten å oversette på, og det trenger ingen programmeringsferdigheter. Ta en titt på `UBports oversettelsesprosjekter <https://translate.ubports.com/projects/>` _. Når du bruker weblate, må du ikke redigere *.po* -filer manuelt. Forpliktelse av redigerte *.po* -filer kan bryte den automatiserte prosessen med oversettelse.
ru: Базовые приложения и некоторые программы, развиваемые сообществом - dekko или TELEports, например, - в основном переводятся через weblate. Этот способ - самый предпочтительный, и не требует навыков программирования. Пожалуйста, ознакомьтесь с инструкциями `UBports translation projects <https://translate.ubports.com/projects/>`_. При переводе через weblate не следует редактировать файлы *.po* вручную. Загрузка измененных языковых файлов при переводе таким способом может нарушить автоматический процесс обновления языковых файлов.

source: Most apps maintained by individual developers are mainly using *.pot*/*.po* files for translation. Those generally need to be edited manually and commited to the apps repo.
de: ‎Die meisten Apps, die von einzelnen Entwicklern verwaltet werden, verwenden hauptsächlich *‎‎.pot*‎‎/*‎‎.po*-Dateien für die Übersetzung. Diese müssen in der Regel manuell bearbeitet und in das App-Repository übertragen werden.
ru: Большинство приложений разрабатывается независимыми разработчиками, для переводов используются в основном файлы *.pot*/*.po*. В этом случае их нужно редактировать вручную и загружать в репозиторий с приложением.

source: How-To
ca: Guia bàsica
de: Anleitung
es: Guía básica
ru: How-To (Краткие инструкции)

source: You can go to `UBports Weblate <https://translate.ubports.com/projects/>`_, click on "Dashboard" button, go to a project, and start making anonymous suggestions without being registered. If you want to save your translations, you must be logged in.
de: Auf `UBports Weblate <https://translate.ubports.com/>`_ per Klick auf "Dashboard", zum Projekt gehen und ohne Registrierung anonym Vorschläge machen. Sollen die Übersetzungen direkt gespeichert werden, muss man eingeloggt sein.
nb: Du kan gå til `UBports Weblate <https://translate.ubports.com/projects/>` _, klikke på "Dashboard" -knappen, gå til et prosjekt og begynne å komme med anonyme forslag uten å være registrert. Hvis du vil lagre oversettelsene dine, må du være logget inn.
ru: Можно перейти в раздел `UBports Weblate <https://translate.ubports.com/projects/>`_, найти клавишу "Dashboard" и, кликнув по ней, перейти в проект. Начать перевод можно без регистрации на сайте, в этом случае все правки будут анонимными. Если хочется зафиксировать свое имя в файлах, нужно зарегистрироваться.

source: For that, go to UBports Weblate and click on the "Register" button. Once in the "Registration" page, you'll find two options:
ca: Per fer això, aneu al Weblate de l'UBports i cliqueu al botó «Register» (registreu-me). Un cop esteu a la pàgina «Registration» (registre), trobareu dues opcions:
de: Dazu in UBports Weblate auf "Register" klicken. Auf der Registrierungsseite findet man zwei Optionen:
es: Para ello, vaya a UBports en Weblate y pulse en el botón "Registrar". Una vez en la página "Registro" encontrará dos opciones:
nb: For det, gå til UBports Weblate og klikk på "Registrer" -knappen. Når på "Registrering"s-siden finner du to alternativer:
ru: Для этого зайдите в раздел UBports Weblate - "Регистрация". На странице регистрации есть две опции:

source: Register using a valid email address, a username, and your full name. You'll need to resolve an easy control question too.
ca: Registreu-vos usant una adreça vàlida de correu electrònic, un nom d'usuari, i el vostre nom complet. També haureu de resoldre una pregunta senzilla de control.
de: Registrierung mittels gültiger E-Mail-Adresse, Nutzername und vollständiger Name. Dabei muss eine einfache Kontrollfrage beantwortet werden.
es: Regístrese usando una cuenta de correo válida, un nombre de usuario y su nombre completo. Necesitará contestar una sencilla pregunta de control también.
nb: Registrer deg ved hjelp av en gyldig e-postadresse, et brukernavn og ditt fulle navn. Du må også løse et enkelt kontrollspørsmål.
ru: Регистрация через действующий адрес электронной почты. Также потребуется Ваше полное ФИО и имя пользователя на сайте. Нужно будет также придумать секретный вопрос и ответ на него.

source: Register using a third party registration. Currently the system supports accounts from openSUSE, GitHub, Fedora, and Ubuntu.
ca: Registreu-vos usant un registre de tercers. Actualment el sistema dóna suport a comptes de l'openSUSE, el GitHub, el Fedora i l'Ubuntu.
de: Registrierung mittels anderer Webseite. Aktuell unterstützt das System Konten von openSUSE, GutHub, Fedora und Ubuntu.
es: Regístrese usando un registro de terceros. En la actualidad el sistema soporta cuentas de openSUSE, GitHub, Fedora y Ubuntu.
nb: Registrer deg ved hjelp av en tredjepartsregistrering. For tiden støtter systemet kontoer fra openSUSE, GitHub, Fedora og Ubuntu.
ru: Регистрация с использованием учётной записи на других ресурсах. На данный момент, можно использовать учётные записи с сайтов openSUSE, GitHub, Fedora и Ubuntu.

source: Once you're logged in, the site is self-explanatory and you'll find there all the options and customization you can do.
ca: Un cop heu iniciat una sessió, el lloc conté totes les explicacions i hi trobareu totes les opcions i la personalització que podeu fer.
de: Sobald eingeloggt, ist die Seite selbsterklärend und man findet leicht alle Optionen und mögliche Anpassungen.
es: Una vez que ha iniciado sesión, el sitio es auto-explicativo y encontrará allí todas las opciones y personalizado que puede hacer.
ru: Процесс станет понятнее, как только Вы зайдёте на сайт. Вы увидите все опции и настройки, которые доступны в учётной записи.

source: Now, get on with it. The first step is to search if your language already exists in the project of your choice. If your language is not available for a specific project, you can add it yourself.
de: Jetzt kann es los gehen. Der erste Schritt ist zu schauen, ob die Sprache im jeweiligen Projekt bereits existiert. Falls eine Sprache für das ensprechende Projekt noch nicht verfügbar ist, kann man diese selbst hinzufügen.
ru: Теперь, когда Вы на сайте проекта, проверьте, есть ли Ваш язык в списке переводов. Если в проекте переводов на нём нет, то можно добавить перевод на новый язык самостоятельно.

source: .po/.ts File Editor
de: Editor für .po/.ts-Dateien
ru: Редактор файлов .po/.ts

source: If you want to work with *.po*/*.ts* files directly you need to know what you're doing for sure. The first thing you should always remember is:
de: Wenn man direkt mit *.po*/*.ts*-Datei arbeiten will, muss man genau wissen was man tut. Was man dabei immer beachten muss:
nb: Hvis du vil jobbe med *.po*/*. Ts* filer direkte, må du være helt sikker på hva du gjør. Det første du alltid bør huske er:
ru: Если Вы хотите напрямую работать с файлами *.po*/*.ts*, нужно точно понимать все принципы работы. Первое, о чём нужно помнить, это:

source: Do **never** commit *.po* files to projects that are translated using weblate. This could break the whole translation exchange process with weblate.
de: Man darf **niemals** *.po*-Dateien in einem Commit zu Projekten hinzufügen die Weblate nutzen. Das kann den kompletten Übersetzungsprozess mit Weblate unbrauchbar machen.
nb: Utfør **aldri** commit på *.po* -filer til prosjekter som oversettes ved hjelp av weblate. Dette kan bryte hele oversettelsesprosessen med weblate.
ru: **Никогда ** не загружайте файлы * .po * в проекты, которые переведены с помощью weblate. Это может нарушить весь процесс переводов с помощью этого сервиса.

source: As was said up above, you need a file editor of your choice and a GitHub/GitLab account to translate *.po*/*.ts* files directly. Idealy you do have `clickable <http://clickable.bhdouglass.com/en/latest/>`_ set up and know how to build an app.
de: Wie oben erwähnt, wird ein Editor der freien Wahl benötigt und ein GitHub/GitLab-Konto, um *.po*/*.ts*-Dateien direkt zu übersetzen. Idealerweise hat man `Clickable <http://clickable.bhdouglass.com/en/latest/>`_ eingerichtet und weiss wie man ein App baut.
ru: Как уже упоминалось выше, для переводов и работы с файлами *.po*/*.ts* подойдёт любой текстовый редактор и учетная запись на сайтах GitHub/GitLab. Идеальный случай, если установлен `clickable <http://clickable.bhdouglass.com/en/latest/>`_ , и Вы умеете компилировать приложения.

source: There are online gettext .po editors and those you can install in your computer. You can choose whatever editor you want, but we prefer to work with free software only. There are too many plain text editors and tools to help you translate *.po*/*.ts* files to put down a list here.
de: ‎Es gibt gettext .po Editoren entweder als Online-Version oder auch zum Installieren auf Ihrem Computer. Sie können einen Editor Ihrer Wahl benutzen, aber wir bevorzugen die Verwendung von freier Software. Es gibt zu viele Klartext-Editoren und Tools, die Ihnen *.po/.ts*-Dateien zu übersetzen helfen, um sie hier alle aufzulisten.
ru: Текстовых редакторов очень много - есть как онлайн-приложения, так и программы, которые можно установить на ПК. Можно работать в любом редакторе, но мы предпочитаем бесплатное программное обеспечение. Утилит для перевода и программ для работы с файлами *.po*/*.ts* много, нет смысла приводить какой-то список.

source: For high quality translations it is recommended to go through all of the steps given below. Although if you are not familiar with building apps using clickable, skip the steps 4. to 6. You may not be able to translate the latest strings though. And you will not know if the strings fit into the apps layout.
de: ‎Für qualitativ hochwertige Übersetzungen wird empfohlen, alle unten angegebenen Schritte zu durchlaufen. Wenn Sie mit dem Erstellen von Apps mit Clickable nicht vertraut sind, überspringen Sie die Schritte 4. bis 6. Möglicherweise können Sie die neuesten Zeichenfolgen nicht übersetzen. Und Sie werden nicht wissen, ob die übersetzten Zeichenfolgen in das Layout der Apps passen.
ru: Чтобы подготовить качественный перевод, рекомендуется пройти все шаги, указанные ниже. Хотя, если Вы не знакомы с созданием приложений формата clickable, пропустите шаги с 4 по 6. Но после этого Вы не сможете перевести последние строчки в приложении. И не будет понятно, вписываются ли строки в макет приложения.

source: How to proceed:
de: Die nächsten Schritte:
nb: Hvordan fortsette:
ru: Как продолжить работу над переводом:

source: fork the apps repo into your GitHub or GitLab account
de: erstellen Sie eine Abspaltung (Fork) des App Repository in Ihrem GitHub- oder GitLab-Konto
ru: скопируйте (сделайте форк) репозитория приложения в свою учётную запись GitHub или GitLab

source: clone the repo locally or use GitLab's online editor
de: klonen Sie das Repository lokal oder benutzen Sie den GitLab Online Editor
ru: сохраните копию репозитория на свой компьютер или используйте для перевода стандартный онлайн-редактор GitLab

source: (optional) create a new branch for the translation
de: (optional) erstellen Sie einen neuen Zweig für die Übersetzung
ru: (необязательно) создайте новую ветвь для перевода

source: build the app using clickable to get up-to-date *.pot*/*.ts* template files
de: erstellen Sie die App mit Hilfe von Clickable, um die aktuellen *.pot*/*.ts*-Vorlagendateien zu erhalten
ru: скомпилируйте приложение с помощью clickable, чтобы получить самые последние версии файлов *.pot*/*.ts*

source: update the desired *.po*/*.ts* language file(s) from the template
de: ‎aktualisieren Sie die gewünschten *.po*/*.ts*-Sprachdatei(en) aus der Vorlage
ru: обновите соответствующие языковые файлы *.po*/*.ts* из шаблона

source: translate all strings
de: übersetzen Sie alle Zeichenketten
ru: переведите все строчки с текстом

source: build and install the app on your device and test the translations
de: erstellen und installieren Sie die App auf Ihrem Gerät und überprüfen Sie die Übersetzungen
ru: скомпилируйте приложение и установите его на смартфон, после этого проверьте перевод

source: (optional) repeat steps 6. and 7. until you are satisfied with your work
de: (optional) wiederholen Sie die Schtitte 6. und 7., bis Sie mit Ihrer Arbeit zufrieden sind
ru: (необязательно) повторяйте пункты 6 и 7, пока не получится удовлетворительного результата

source: push the translated *.po*/*.ts* file(s) to your forked repo [do NOT commit *.pot*/*.ts* template files]
de: verschieben Sie die übersetzten *.po*/*.ts*-Dateien in Ihr abgespaltetes Repository [ändern Sie KEINE *.pot*/*.ts*-Vorlagendateien]
ru: переместите переведенные версии файлов *.po*/*.ts* в скопированный репозиторий [не копируйте файлы *.pot*/*.ts* напрямую в исходный репозиторий]

source: open an merge/pull request from your fork to the apps repo
de: öffnen Sie einen Merge Request / Pull Request von Ihrem Fork zum App Repository
ru: создайте запрос на объединение изменений на странице оригинального репозитория

source: Translation Team Communication
ca: Comunicació de l'equip de traducció
de: Kommunikation im Übersetzerteam
es: Comunicación del equipo de traducción
ru: Общение с группой по переводам (Translation Team)

source: You may talk to others regarding translations by using `the forum category <https://forums.ubports.com/category/39/translations>`_ that UBports provides for this task. To use it you need to register, or login if you're registered already.
de: ‎Sie können mit anderen Personen über Übersetzungen sprechen, indem Sie ‎‎die `Forumskategorie‎‎ <https://forums.ubports.com/category/39/translations>`_ verwenden, die UBports für diese Aufgabe bereitstellt. Dazu müssen Sie sich registrieren oder anmelden wenn Sie bereits registriert sind.
nb: Du kan snakke med andre angående oversettelser ved å bruke `forumkategorien <https://forums.ubports.com/category/39/translations>` _ som UBports leverer for denne oppgaven. For å bruke den må du registrere deg, eller logge inn hvis du allerede er registrert.
ru: Можно пообщаться с другими пользователями, занимающимися переводами в `соответствующем разделе на форуме UBports <https://forums.ubports.com/category/39/translations>`_ . Для этого придётся там зарегистрироваться.

source: The only requirement is to start your post putting down your language in brackets in the "Enter your topic title here" field. For example, ``[Spanish] How to translate whatever?``
ca: L'únic requeriment és iniciar el vostre article posant la vostra llengua entre parèntesis al camp «Enter your topic title here» (entreu el títol del vostre tema aquí). Per exemple ``[Català] Com traduir el que sigui?``
de: Die einzige Anforderung ist einen Beitrag mit deiner Sprache in eckigen Klammern vorangestellt im Feld "Enter your topic title here" zu veröffentlichen. Zum Beispiel ``[German] How to translate whatever?``
es: El único requisito es comenzar su entrada poniendo su idioma entre corchetes en el campo "Introduzca el título de su tema aquí". Por ejemplo, `[Español] ¿Cómo traducir lo que sea?``
nb: Det eneste kravet er å starte innlegget ditt med å sette ned språket ditt i parentes i feltet "Skriv inn emnetittelen din her". For eksempel, ``[Spansk] Hvordan oversette hva som helst?``
ru: Единственное требование - перед тем, как создать тему, укажите язык перед названием. Например, ``[Spanish] Как создать перевод?``
