Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: In your interactions with your team you'll find the best way to coordinate your translations.
ca: En les interaccions amb el vostre equip trobareu la millor manera de coordinar les vostres traduccions.
de: Im Gespräch mit dem Team findet man leicht den besten Weg zur Koordination der Übersetzungen.
es: En sus interacciones con su equipo encontrará la mejor manera de coordinar sus traducciones.
ru: Общение с другими пользователями поможет лучше организовать работу над переводами.

source: License
ca: Llicència
de: Lizenz
es: Licencia
nb: Lisens
ru: Лицензия

source: All the translation projects, and all your contributions to this project, are under a `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ license that you explicitly accept by contributing to the project.
ca: Tots els projectes de traducció, i totes les vostres contribucions al projecte, estan sota la llicència `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ que accepteu explícitament quan contribuïu al projecte.
de: Alle Übersetzungsprojekte und alle Beiträge zu diesem Projekt stehen unter der `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_-Lizenz, welche du durch deinen Beitrag zum Projekt explizit akzeptierst.
es: Todos los proyectos de traducción y todas sus contribuciones al proyecto están sometidas a la licencia `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>`_ que usted acepta explícitamente al contribuir al proyecto.
nb: Alle oversettelsesprosjektene, og alle bidragene dine til dette prosjektet, er under en `Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/>` _ lisens som du eksplisitt godtar ved å bidra til prosjektet.
ru: Все переводы и все работы над проектом ведутся под лицензией Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) <https://creativecommons.org/licenses/by-sa/4.0/> ` _Ваше участие в проекте явно говорит о том, что Вы согласны с условиями этой лицензии.

source: Go to that link to learn what this exactly means.
ca: Aneu a aquest enllaç per conèixer que significa exactament això.
de: Folge dem Link, um herauszufinden, was das genau bedeutet.
es: Siga ese enlace para aprender que significa exactamente.
nb: Følg denne lenken for å lære hva dette betyr.
ru: Чтобы подробнее изучить лицензионные условия, перейдите по ссылке.

source: UBports Weblate
ca: Weblate de l'UBports
es: UBports en Weblate
ru: Сервис UBports Weblate

source: UBports Welcome
es: Bienvenida de UBports
nb: UBports velkommen

source: Contacts (`address-book-app on GitLab`_)
es: Contactos (`address-book-app en GitHub`_)

source: External Drives (`ciborium on GitLab`_)
es: Unidades externas (`ciborium en GitHub`_)

source: System Settings (`_system-settings on GitLab`_)
es: Configuración de sistema (`system-settings en GitHub`_)

source: How does a text get translated (technical background)
nb: Hvordan oversettes en tekst (teknisk bakgrunn)

source: Within an app strings are marked either this way ``i18n.tr("string")`` when using gettext or like this ``tr("string")`` when using QtLinguist. When the app is built those translatable strings are extracted and written into the *.pot* or *.ts* template files. The *.po* and *.ts* language files then need to be updated from their template.
nb: I en app er strengene merket på denne måten ``i18n.tr ("string") ``når du bruker gettext eller som denne ``tr ("string")`` når du bruker QtLinguist. Når appen er bygget, blir de oversettbare strengene hentet ut og skrevet inn i *.pot* eller *.ts* malfiler. Språkfilene *.po* og *.ts* må deretter oppdateres fra malen.

source: There are three commonly used ways to translate an app:
nb: Det er tre vanlige måter å oversette en app på:

source: Team translation: We also have a `Translation Forum <https://forums.ubports.com/category/39/translations>`_ to discuss translating Ubuntu Touch and its core apps. Some projects are using Telegram or Matrix groups too, and some teams are still using the Ubuntu Launchpad framework.
nb: Teamoversettelse: Vi har også et `Oversettelsesforum <https://forums.ubports.com/category/39/translations>` for å diskutere oversettelse av Ubuntu Touch og dets kjerneapper. Noen prosjekter bruker også Telegram- eller Matrix-grupper, og noen team bruker fortsatt Ubuntu Launchpad-rammeverket.

source: Once you're logged in, the site is self-explanatory and there you'll find all the options and customization you can do.
nb: Når du er logget inn, er nettstedet selvforklarende, og der finner du alle alternativene og tilpasningene du kan gjøre.

source: There are online gettext .po editors and those you can install on your computer. You can choose whatever editor you want, but we prefer to work with free software only. There are too many plain text editors and tools to help you translate *.po*/*.ts* files to list here.
nb: Det er getpo .po-redaktører på nettet og disse kan du installere på datamaskinen din. Du kan velge hvilken redaktør du vil ha, men vi foretrekker å bare bruke gratis programvare. Det er for mange redigeringsprogrammer og verktøy for å hjelpe deg med å oversette *.po*/*. Ts* -filer til å liste her.

source: Clone the repo locally or use GitLab's online editor
nb: Klon arkivet lokalt eller bruk GitLabs nettredigerer

source: (optional) Create a new branch for the translation
nb: (valgfritt) Opprett en ny gren for oversettelsen

source: Update the desired *.po*/*.ts* language file(s) from the template
nb: Oppdater ønsket *.po*/*. Ts* språkfil (er) fra malen

source: Translate all strings
nb: Oversett alle strengene

source: Build and install the app on your device and test the translations
nb: Bygg og installer appen på enheten din og test oversettelsene

source: (optional) Repeat steps 6. and 7. until you are satisfied with your work
nb: (valgfritt) Gjenta trinn 6. og 7. til du er fornøyd med arbeidet ditt

source: Next, find out exactly how to recreate the bug that you've found. Document the exact steps that you took to find the problem in detail. Then, reboot your phone and perform those steps again. If the problem still occurs, continue on to the next step. `If not <https://youtu.be/nn2FB1P_Mn8?t=10s>`_...
ca: A continuació, esbrineu com recrear exactament l'error que heu trobat. Documenteu detalladament els passos exactes que heu fet per trobar el problema. Després, reinicieu el telèfon i realitzeu aquests passos un altre cop. Si encara es produeix el problema, continueu al pas següent. `Si no <https://youtu.be/nn2FB1P_Mn8?t=10s>`_...

source: We appreciate as many good logs as we can get when you report a bug. In general, /var/log/dmesg and the output of /android/system/bin/logcat are helpful when resolving an issue. I'll show you how to get these logs.
ca: Ens agrada rebre quant més registres millor quan informeu d'un error. En general, /var/log/dmesg i la sortida de /android/system/bin/logcat són útils quan s'està resolent un problema. Us mostraré com obtenir aquests registres.

source: To get set ready, follow the steps to :doc:`set up ADB </userguide/advanceduse/adb>`.
ca: Per preparar-vos, seguiu els passos de :doc:`preparació de l'ADB </userguide/advanceduse/adb>`.

source: Now, you can get the two most important logs.
ca: A continuació, podeu obtenir els dos registres més importants.

source: The **dmesg** (*display message* or *driver message*) command displays debug messages from the kernel.
ca: L'ordre **dmesg** (*display message*, mostra el missatge, o *driver message*, missatge del controlador) mostra missatges de depuració del nucli.

source: Using the steps you documented earlier, reproduce the issue you're reporting
ca: Usant els passos que vau documentar abans, reproduïu el problema que esteu informant

source: cd to a folder where you're able to write the log
ca: canvieu a una carpeta on podeu escriure el registre

source: Run the command: `adb shell dmesg > UTdmesg.txt`
ca: Executeu l'ordre: `adb shell dmesg > UTdmesg.txt`

source: This log should now be located at UTdmesg.txt under your working directory, ready for uploading later.
ca: Aquest registre hauria d'estar ubicat ara a UTdmesg.txt al vostre directori de treball, ja preparat per pujar-lo més tard.

source: The **logcat** (*log concatenator*) command displays debug information from various parts of the underlying android system.
ca: L'ordre **logcat** (*concatenar registres*) mostra informació de depuració de diverses parts del sistema android subjacent.

source: Run the command: `adb shell /android/system/bin/logcat -d > UTlogcat.txt`
ca: Executeu l'ordre: `adb shell /android/system/bin/logcat -d > UTlogcat.txt`

source: This log will be located at UTlogcat.txt in your current working directory, so you'll be able to upload it later.
ca: Aquest registre s'ubicarà a UTlogcat.txt al vostre directori de treball, de manera que el podeu pujar més tard.

source: Logs: Attach your logs by clicking and dragging them into your GitHub issue.
ca: Registres: Adjunteu el vostres registres clicant-los i arrossegant-los al vostre problema al GitHub.

source: Once you're finished with that, post the bug. You can't add labels yourself, so please don't forget to state the device you're experiencing the issue on in the description so a moderator can easily add the correct tags later.
ca: Un cop que heu acabat amb això, publiqueu l'error. No teniu permís per afegir etiquetes, així que si us plau no us oblideu d'indicar el dispositiu en el qual esteu experimentant el problema a la descripció, de manera que un moderador pugui afegir fàcilment les etiquetes correctes més tard.

source: These rules govern *how* you should write your documentation to avoid problems with style, format, or linking. If you don't follow these guidelines, we will not accept your document.
ca: Aquest normes regulen *com* hauríeu d'escriure la documentació per evitar problemes amb l'estil, el format o els enllaços. Si no seguiu aquestes directriu, no acceptarem el vostre document.

source: All pages must have a document title that will be shown in the table of contents (left sidebar) and at the top of the page. This title is underlined with equals signs.
ca: Totes les pàgines han de tenir un títol de document que mostrarà a la taula de continguts (barra lateral esquerra) i a la part superior de la pàgina. Aquest títol està subratllat per signes d'igual.

source: Titles should be sentence cased rather than Title Cased. For example::
ca: Els títols haurien de basar-se en frases i no sols títols. Per exemple:

source: You can do this by adding the page to the ``index.rst`` file in the same directory that you created it. For example, if you create a file called "newpage.rst", you would add the line marked with a chevron (>) in the nearest index::
ca: Això ho podeu fer afegint la pàgina al fitxer``index.rst`` al mateix directori on el vau crear. Per exemple, si creeu un fitxer anomenat «paginanova.rst», afegiríeu la línia marcada amb un signe de més gran (>) a l'índex més proper::

source: Your edits must not introduce any warnings into the documentation build. If any warnings occur, the build will fail and your pull request will be marked with a red 'X'. Please ensure that your RST is valid and correct before you create a pull request. This is done automatically (via sphinx-build crashing with your error) if you follow our build instructions below.
ca: Les vostres edicions no han d'introduir cap advertiment a la compilació de la documentació. Si es produeix cap advertiment, la compilació fallarà i la vostra demanda de baixada es marcarà amb una «X» vermella. Si us plau assegureu-vos que el vostre RST és vàlid i correcte abans de crear una demanda de baixada. Això es fa automàticament (mitjançant la fallada de sphinx-build amb el vostre error) si seguiu les nostres instruccions de compilació de sota.

source: Documentation TODOs
ca: PER FER de la documentació

source: To test the core functionality of the operating system, we have compiled `a set of standardized tests <https://nc.ubports.com/s/3RnAI7tYzB2PMXs>`_. Run these tests on your device to :doc:`find and report bugs and regressions <bugreporting>`. It's usually run on all devices before a new release to make sure no new issues were introduced.
ca: Per provar la funcionalitat bàsica del sistema operatiu, hem compilat `un conjunt de comprovacions estandarditzades <https://nc.ubports.com/s/3RnAI7tYzB2PMXs>`_. Executeu aquests comprovacions al vostre dispositiu per :doc:`trobar i informar errors i regressions <bugreporting>`. Normalment s'executen a tots els dispositius abans d'un nou alliberament per assegurar que no s'han introduït nous problemes.

source: Unconfirmed bugreports are labeld **needs confirmation** to enable `global filtering <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Browse through the list, read the bugreports and try to reproduce the issues that are described. If neccessary, add :doc:`missing information or logs, or improve the quality of the report by other means <bugreporting>`. Leave a comment stating your device, channel, build number and whether or not you were able to reproduce the issue.
ca: Informes d'error sense confirmar s'etiqueten amb **needs confirmation** (cal confirmació) per activar el `filtratge global <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Navegueu per la llista, llegiu els informes d'error i proveu de reproduir els problemes que es descriuen. Si cal, afegiu :doc:`informació que manqui o registres, o milloreu la qualitat de l'informe per altres mitjans <bugreporting>`. Deixeu un comentari indicant quin és el vostre dispositiu, número de compilació o si heu pogut o no pogut reproduir el problema.

source: If you have write-access to the repository, you can replace the **needs confirmation** label with **bug** (to mark it confirmed) or **invalid** (if the issue is definitely not reproducable). In that case it should be closed.
ca: Si teniu permís d'escriptura al repositori, podeu reemplaçar l'etiqueta **needs confirmation** (cal confirmació) amb **bug** (error, per marcar-lo com confirmat) o **invalid** (no vàlid, si definitivament no es pot reproduir el problema). En aquest cas s'hauria de tancar.

source: Once a developer finished working on an issue, it's moved to the quality assurance column of the `GitHub project <https://github.com/ubports/ubuntu-touch/projects/3>`__. Check if the issue is still present in the latest update on the devel channel and try to find any problems it is causing. Check if the developer mentioned specific things to look out for when testing and leave a comment detailing your experience. If you have write-access to the repository, you can move the issue back to **In Development** or forward to **Release Candidate** as specified by the :doc:`issue tracking guidelines </about/process/issue-tracking>`.
ca: Un cop s'ha acabat el treball de desenvolupament d'un problema, es mou a la columna de control de qualitat del `projecte GitHub <https://github.com/ubports/ubuntu-touch/projects/3>`__. Comproveu si el problema encara és present a l'actualització més recent al canal de desenvolupament i intenteu trobar qualsevol problema que estigui causant. Cliqueu si la persona desenvolupadora va mencionar coses específiques per mirar quan es facin les comprovacions i deixeu un comentari descrivint amb detall la vostra experiència. Si teniu permís d'escriptura al repositori, podeu retornar el problema a **In Development** (en desenvolupament) o avançar-lo a **Release Candidate** (candidat a l'alliberament) com s'especifica a :doc:`directrius de seguiment de problemes </about/process/issue-tracking>`.

source: We are working hard to meet that goal, and you can help as well.
ca: Estem treballant dur per aconseguir aquest objectiu, i també podeu ajudar.

source: There are two levels for this:
ca: Hi ha dos nivells per això:

source: A casual approach, as a translator volunteer.
ca: Un nivell casual, com a voluntari de traduccions.

source: A fully committed approach as a UBports Member, filling in `this application <https://ubports.com/survey/start/ubports-membership-application-6>`_.
ca: Un nivell de compromís total com a membre de l'UBports, registrant-vos a `aquesta aplicació <https://ubports.com/survey/start/ubports-membership-application-6>`_.

source: Tools for Translation
ca: Eines per a la traducció

source: For everyone: A web based translation tool called `Weblate <https://translate.ubports.com/>`_. This is the recommended way.
ca: Per a tothom: Una eina de traducció basada en la web anomenada `Weblate <https://translate.ubports.com/>`_. Aquesta és la manera recomanada.

source: For advanced users: Working directly on .po files with the editor of your choice, and a GitHub account. The .po files for each project are in their repository on `our GitHub organization <https://github.com/ubports>`_.
ca: Per a usuaris avançats: Treball directe als fitxers .po amb l'editor de la vostra elecció, i un compte GitHub. Els fitxers .po per a cada projecte estan al seu repositori a la `nostra organització del GitHub <https://github.com/ubports>`_.

source: A `Translation Forum <https://forums.ubports.com/category/39/translations>`_ to discuss on translating Ubuntu Touch and its core apps.
ca: Un `fòrum de traducció <https://forums.ubports.com/category/39/translations>`_ per discutir sobre les traduccions de l'Ubuntu Touch i les seves aplicacions de base.

source: You can go to `UBports Weblate <https://translate.ubports.com/>`_, click on "Dashboard" button, go to a project, and start making anonymous suggestions without being registered. If you want to save your translations, you must be logged in.
ca: Podeu anar a `Weblate de l'UBports <https://forums.ubports.com/category/39/translations>`_, cliqueu al botó «Dashboard» (tauler), i comenceu a fer suggeriments anònims sense haver-vos registrat. Si voleu desar les vostres traduccions, heu d'iniciar una sessió.

source: Now, get on with it. The first step is to search if your language already exists in the project of your choice.
ca: A continuació, comenceu a treballar. El primer pas és cercar si la vostra llengua ja hi és al projecte que heu triat.

source: If your language is not available for a specific project, you can add it yourself.
ca: Si la vostra llengua no està disponible per al projecte especificat, la podeu afegir.

source: You decide how much time you can put into translation. From minutes to hours, everything counts.
ca: Podeu decidir quant de temps podeu dedicar a les traduccions. Des de minuts fins a hores, tot suma.

source: .po file editor
ca: editor de fitxers .po

source: As was said up above, you need a file editor of your choice and a GitHub account to translate .po files directly.
ca: Com s'havia dit abans, per editar fitxers .po directament us cal un editor de fitxers de la vostra elecció i un compte del GitHub.

source: There are online gettext .po editors and those you can install in your computer.
ca: Hi ha editors en línia dels fitxers .po del gettext i els podeu instal·lar al vostre ordinador.

source: You can choose whatever editor you want, but we prefer to work with free software only. There are too many plain text editors and tools to help you translate .po files to put down a list here.
ca: Podeu triar qualsevol editor que voleu, però preferim treballar exclusivament amb programari lliure. Hi ha massa editors de text pla i eines per ajudar-vos a traduir els fitxers .po com per fer una llista aquí.

source: If you want to work with .po files directly you know what you're doing for sure.
ca: Si voleu treballar amb fitxers .po directament segurament sabeu el que esteu fent.

source: The straightforward and recommended way is to use `the forum category <https://forums.ubports.com/category/39/translations>`_ that UBports provides for this task.
ca: La manera més senzilla i recomanada a usar és `la categoria del fòrum <https://forums.ubports.com/category/39/translations>`_ que l'UBports proveeix per a aquesta tasca.

source: To use it you need to register, or login if you're registered already.
ca: Per usar-la us heu de registrar, o iniciar una sessió si ja esteu registrat.

source: Just for your information, some projects are using Telegram groups too, and some teams are still using the Ubuntu Launchpad framework.
ca: Sols per a la vostra informació, alguns projectes també estan usant grups del Telegram, i alguns equips encara estan usant la infraestructura del Launchpad de l'Ubuntu.
