Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/contribute.po
Languages: ca, de, es, nb, ru

source: `clock-app on GitLab`_
de: `Uhr-App auf GitLab`_
ru: `clock-app в GitLab`_

source: File Manager
de: Dateimanager
es: Gestor de archivos
nb: Filbehandler

source: `File Manager on OpenStore`_
de: `Dateimanager im OpenStore`_
es: `Gestor de archivos en OpenStore`_
nb: `Filbehandler i OpenStore`_
ru: `File Manager в OpenStore`_

source: `filemanager-app on GitLab`_
de: `Dateimanager-App auf GitLab`_
ru: `filemanager-app в GitLab`_

source: Gallery
de: Galerie
es: Galería
nb: Galleri
ru: Галерея

source: `Gallery on OpenStore`_
de: `Galerie im OpenStore`_
es: `Galería en OpenStore`_
nb: `Galleri i OpenStore`_
ru: `Gallery в OpenStore`_

source: `gallery-app on GitLab`_
de: `Galerie-App auf GitLab`_
ru: `gallery-app в GitLab`_

source: Music
de: Musik
es: Música
nb: Musikk
ru: Музыка

source: `Music on OpenStore`_
de: `Musik im OpenStore`_
nb: `Musikk i OpenStore`_
ru: `Music в OpenStore`_

source: `music-app on GitLab`_
de: `Musik-App auf GitLab`_
ru: `music-app в GitLab`_

source: Notes
de: Notizen
es: Notas
nb: Notater

source: `Notes on OpenStore`_
de: `Notizen im OpenStore`_
es: `Notas en OpenStore`_
nb: `Notater i OpenStore`_
ru: `Notes в OpenStore`_

source: `notes-app on GitLab`_
de: `Notizen-App auf GitLab`_
ru: `notes-app в GitLab`_

source: `OpenStore... on OpenStore`_
de: `OpenStore... im OpenStore`_
es: `OpenStore... en OpenStore`_
nb: `OpenStore... i OpenStore`_
ru: `Страница репозитория OpenStore`_

source: `openstore-app on GitLab`_
de: `OpenStore-App auf GitLab`_
ru: `openstore-app в GitLab`_

source: `Terminal on OpenStore`_
de: `Terminal im OpenStore`_
es: `Terminal en OpenStore`_
nb: `Terminal i OpenStore`_
ru: `Terminal в OpenStore`_

source: `terminal-app on GitLab`_
de: `Terminal-App auf GitLab`_
ru: `terminal-app в GitLab`_

source: `UBports Welcome on OpenStore`_
de: `UBports Welcome im OpenStore`_
es: `Bienvenida de UBports en OpenStore`_
nb: `UBports velkommen i OpenStore`_
ru: `UBports Welcome в OpenStore`_

source: `ubports-app on GitLab`_
de: `UBports-App auf GitLab`_
ru: `ubports-app в GitLab`_

source: Weather
de: Wetter
es: Tiempo
nb: Vær
ru: Погода

source: `Weather on OpenStore`_
de: `Wetter-App im OpenStore`_
nb: `Vær i OpenStore`_
ru: `Weather в OpenStore`_

source: `weather-app on GitLab`_
de: `Wetter-App auf GitLab`_
ru: `weather-app в GitLab`_

source: Other preinstalled apps
de: Andere vorinstallierte Apps
es: Otras aplicaciones pre-instaladas
nb: Andre preinstallerte apper
ru: Другие предустановленные приложения

source: The following applications are preinstalled in Ubuntu Touch but are not considered core apps. Most of the time these projects must be updated with the system because they use many system services which do not necessarily have a stable API.
de: Die folgenden Anwendungen sind bei Ubuntu Touch vorinstalliert, gelten aber nicht als Core-Apps. Meistens müssen diese Projekte mit dem System aktualisiert werden, da sie viele Systemdienste nutzen, die nicht unbedingt eine stabile API haben.
nb: Følgende applikasjoner er forhåndsinstallert i Ubuntu Touch, men regnes ikke som kjerneapper. Mesteparten av tiden må disse prosjektene oppdateres med systemet fordi de bruker mange systemtjenester som ikke nødvendigvis har en stabil API.
ru: Эти приложения предустановлены в ОС Ubuntu Touch, но они не относятся к основным приложениям. В большинстве случаев эти программы должны обновляться системой, поскольку они используют множество системных служб, не всегда имеющих стабильный API.

source: These apps may be more difficult to work with, but their repository should contain a document stating how to build and run them on a device.
de: Diese Anwendungen können schwieriger zu bearbeiten sein, aber ihr Repository sollte ein Dokument enthalten, das angibt, wie man sie erstellt und auf einem Gerät ausführt.
es: Puede que sea más difícil trabajar con estas aplicaciones pero su repositorio debería incluir un documento indicando como construirlas y ejecutarlas en un dispositivo.
nb: Disse appene kan være vanskeligere å jobbe med, men arkivet deres bør inneholde et dokument som sier hvordan du bygger og kjører dem på en enhet.
ru: С этими приложениями может быть сложно работать, но в репозиториях должен быть документ, описывающий алгоритм по компиляции и их запуску на устройстве.

source: Browser (`morph-browser on GitHub`_)
de: Browser (`Morph-Browser auf GitHub`_)
es: Navegador (`morph-browser en GitHub`_)
ru: Браузер (`morph-browser на GitHub`_)

source: Contacts (`address-book-app on GitHub`_)
de: Kontakte (`Adressbuch-App auf GitHub`_)
ru: Контакты (`address-book-app на GitHub`_)

source: Camera (`camera-app on GitLab`_)
de: Kamera (`Kamera-App auf GitLab`_)
ru: Камера (`camera-app на GitLab`_)

source: External Drives (`ciborium on GitHub`_)
de: Externe Laufwerke (`Ciborium auf GitHub`_)
ru: Внешние накопители (`ciborium на GitHub`_)

source: Media Player (`mediaplayer-app on GitHub`_)
de: Medienwiedergabe (`Medienwiedergabe-App auf GitHub`_)
es: Reproductor multimedia (`mediaplayer-app en GitHub`_)
ru: Media Player (`mediaplayer-app на GitHub`_)

source: Messaging (`messaging-app on GitHub`_)
de: Nachrichten (`Nachrichten-App auf GitHub`_)
es: Mensajería (`messaging-app en GitHub`_)
ru: Сообщения (`messaging-app на GitHub`_)

source: Phone (`dialer-app on GitHub`_)
de: Telefon (`Telefon-App auf GitHub`_)
es: Teléfono (`dialer-app en GitHub`_)
ru: Телефон (`dialer-app на GitHub`_)

source: System Settings (`system-settings on GitHub`_)
de: Systemeinstellungen (`Systemeinstellungen auf GitHub`_)
ru: Настройки (`system-settings на GitHub`_)

source: Instructions for contributing to these applications can be found in their respective repositories.
de: Anweisungen für das Beitragen zu diesen Anwendungen finden Sie in den jeweiligen Repositorien.
es: Las instrucciones para contribuir a estas aplicaciones se encuentran en sus respectivos repositorios.
nb: Instruksjoner for å bidra til disse applikasjonene finner du i deres respektive arkiver.
ru: Подробные инструкции для разработчиков этих приложений можно найти в репозиториях.

source: Quality Assurance
ca: Control de qualitat
de: Qualitätssicherung
es: Control de calidad
nb: Kvalitetssikring

source: This page explains how to help the UBports QA team, both as an official member or a new contributor. Please also read the :doc:`issue tracking </about/process/issue-tracking>` and :doc:`bugreporting <bugreporting>` guides to better understand the workflow. For real-time communication, you can join our `telegram group <http://t.me/ubports_qa_team>`_.
ca: Aquesta pàgina explica com ajudar a l'equip de control de qualitat de l'UBports, tant com a membre oficial o com a nou col·laborador. Si us plau llegiu també les guies :doc:`seguiment de problemes </about/process/issue-tracking>` i :doc:`informació d'errors <bugreporting>` per entendre millor el flux de treball. Per a comunicació en temps real, podeu unir-vos al nostre `grup de telegram <http://t.me/ubports_qa_team>`_.
de: Diese Seite erklärt, wie man sowohl als offizielles Mitglied als auch als neuer Mitarbeiter im UBports QA-Team hilft. Bitte für ein besseres Verständnis der Arbeitsweise auch die Anleitungen :doc:`Problemverfolgung </about/process/issue-tracking>` und :doc:`Fehler melden <bugreporting>` lesen.
es: Esta página explica como ayudar al equipo de control de calidad de UBports, tanto como miembro oficial o como nuevo colaborador. Por favor lea también las guías :doc:`seguimiento de problemas </about/process/issue-tracking>` e :doc:`informe de errores <bugreporting>` para comprender mejor el flujo de trabajo. Para la comunicación en tiempo real puede unirse a nuestro `grupo en telegram <http://t.me/ubports_qa_team>`_.
ru: На этой странице рассказывается, как могут помочь опытные разработчики или новые участники отделу QA. Пожалуйста, также ознакомьтесь с документами :doc:`issue tracking </about/process/issue-tracking>` и :doc:`bugreporting <bugreporting>`, чтобы лучше понимать как организован рабочий процесс. Задать вопросы или пообщаться можно в нашем `чате в Telegram <http://t.me/ubports_qa_team>`_.

source: Smoke testing
ca: Proves de fum
de: Rauchtest
es: Pruebas de humo
nb: Røyktesting
ru: Smoke testing - тестирование на начальном этапе

source: To test the core functionality of the operating system, we have compiled `a set of standardized tests <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Run these tests on your device to :doc:`find and report bugs and regressions <bugreporting>`. It's usually run on all devices before a new release to make sure no new issues were introduced.
de: Um die Kernfunktionalität des Betriebssystems zu testen, haben wir `eine Liste standardisierter Tests <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Führe diese Tests auf Deinem Gerät aus, um :doc:`Bugs und Rückfälle zu finden und zu melden <bugreporting>`. Normalerweise werden sie vor einem neuen Release auf allen Geräten durchgeführt, um sicherzustellen, dass keine neuen Probleme dazugekommen sind.
nb: For å teste kjernefunksjonaliteten til operativsystemet, har vi samlet `et sett med standardiserte tester <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots> `_. Kjør disse testene på enheten din til: doc: `finn og rapporter feil og regresjoner <feilrapportering>`. Det kjøres vanligvis på alle enheter før en ny utgivelse for å sikre at ingen nye problemer ble introdusert.
ru: Для тестирования ключевых функций системы мы подготовили `набор стандартизованных тестов <https://gitlab.com/ubports/teams/qa/project-management/raw/master/QA-Plan-Template.ots>`_. Запустите эти тесты на своём мобильном устройстве :doc:`для поиска багов и регрессии <bugreporting>`. Обычно эти тесты проходят на всех устройствах перед выпуском нового релиза операционной системы.

source: Confirming bug reports
ca: Confirmació d'informes d'error
de: Fehlerberichte bestätigen
es: Confirmando informe de errores
ru: Подтверждение сообщений об ошибках (баг-репортов)

source: Unconfirmed bugreports are labeld **needs confirmation** to enable `global filtering <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Browse through the list, read the bugreports and try to reproduce the issues that are described. If necessary, add :doc:`missing information or logs, or improve the quality of the report by other means <bugreporting>`. Leave a comment stating your device, channel, build number and whether or not you were able to reproduce the issue.
de: Unbestätigte Fehlerberichte sind mit **needs confirmation** markiert, damit `globales filtern <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__ möglich ist. Man geht die Liste durch, liest die Fehlerberichte und versucht die beschriebenen Probleme zu reproduzieren. Falls nötig, :doc:`ergänzt man fehlende Informationen oder Log-Dateien oder verbessert die Qualität des Fehlerberichts im Allgemeinen<bugreporting>`. Zum Schluss hinterlässt man einen Kommentar, ob man das Problem reproduzieren konnte oder nicht und nennt Gerät, Kanal und Build-Nummer.
es: Los informes de errores sin confirmar son etiquetados **«needs confirmation»** (**necesita confirmación**) para posibilitar el `filtrado global <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Navegue por la lista, lea los informes de errores y trate de reproducir los problemas que se describen. Si es necesario, añada :doc:`la información que falta, o los registros, o mejore la calidad del informe por otros medios <bugreporting>`. Deje un comentario indicando su dispositivo, canal, número de construcción y si puede o no reproducir el problema.
ru: Неподтверждённые баг-репорты получают метку **needs confirmation**, чтобы их можно было найти через `фильтр <https://github.com/ubports/ubuntu-touch/issues?q=is%3Aissue+is%3Aopen+label%3A%22needs+confirmation%22>`__. Посмотрите этот список и попробуйте воспроизвести ошибки, которые в нём перечислены. Если нужно, то дополните баг-репорт :doc:`новой информацией, прикрепите лог-файлы или чем-то иным, что может помочь разработчикам <bugreporting>`. Можно указать в комментариях модель Вашего устройства, версию сборки, канал разработки и удалось ли воспроизвести ошибку.

source: If you have write-access to the repository, you can replace the **needs confirmation** label with **bug** (to mark it confirmed) or **invalid** (if the issue is definitely not reproducible). In that case it should be closed.
de: Wenn Sie Schreibzugriff auf das Repository haben, können Sie das Label **needs confirmation** durch **bug** (um es als bestätigt zu markieren) oder **invalid** ersetzen (wenn das Problem definitiv nicht reproduzierbar ist). In diesem Fall sollte es geschlossen werden.
es: Si tiene derecho de escritura en el repositorio, puede cambiar la etiqueta **needs confirmation** (**necesita confirmación**) por la de **bug** (**error**) (para marcarlo como confirmado) o **invalid** (**nulo**) (si definitivamente el problema no es reproducible). En ese caso debería ser cerrado.
ru: Если у Вас есть права на запись в репозиторий, можно поменять ярлык **needs confirmation** на **bug** (если ошибка подтверждается) или **invalid** (если баг не воспроизводится). В последнем случае запрос нужно закрыть.

source: If you find two issues describing the same problem, leave a comment and try to find their differences. If they are in fact identical, close the newer one and label it **duplicate**.
ca: Si trobeu dos informes descrivint el mateix problema, deixeu un comentari i intenteu trobar les diferències. Si, de fet, són idèntics, tanqueu el més nou i poseu l'etiqueta **duplicate** (duplicat).
de: Falls man auf zwei Fehlerberichte stößt, die das selbe Problem beschreiben, hinterlässt man einen Kommentar und versucht die Unterschiede zu ermitteln. Sind beide faktisch identisch, schließt man den neueren und markiert ihn als **duplicate**.
es: Si encuentra dos asuntos describiendo el mismo problema, deje un comentario y trate de encontrar las diferencias. Si de hecho son idénticos, cierre el más nuevo y etiquételo como **duplicate** (duplicado).
nb: Hvis du finner to problemer som beskriver det samme problemet, kan du legge igjen en kommentar og prøve å finne forskjellene. Hvis de faktisk er identiske, lukker du den nyere og merker den **duplikat**.
ru: Если Вы найдете два открытых тикета, описывающих одну и ту же проблему, напишите комментарий и попробуйте найти различия.Если эти две заявки на самом деле одинаковые, закройте последнюю по дате и обозначьте ее маркером **duplicate**.

source: Testing patches
ca: Comprovació de pegats
de: Korrekturen testen
es: Probando los parches
nb: Testing av feilrettinger
ru: Тестирование патчей

source: Pull-requests can be tested using the `QA scripts <https://github.com/ubports/ubports-qa-scripts>`_. Run ``ubports-qa -h`` for usage information.
de: Pull-Requests können mit den `QA-Skripten <https://github.com/ubports/ubports-qa-scripts>`_ getestet werden. Führen Sie ``ubports-qa -h`` für Nutzungsinformationen aus.
es: Se pueden probar las solicitudes de incorporación de cambios usando los `«scripts» (guiones) de QA <https://github.com/ubports/ubports-qa-scripts>`_. Ejecute ``ubports-qa -h`` para ver la información de su uso.
ru: Pull-requests можно протестировать с помощью `скриптов QA <https://github.com/ubports/ubports-qa-scripts>`_. Запустите команду ``ubports-qa -h`` для более подробной информации.

source: Once the pull-request has been merged, the issue it fixes is moved to the quality assurance column of the `GitHub project <https://github.com/ubports/ubuntu-touch/projects/3>`__. Please check if the issues in this column are still present in the latest update on the devel channel, then see if anything else has broken in the update. Check if the developer mentioned specific things to look out for when testing and leave a comment detailing your experience. If you have write-access to the repository, you can move the issue back to **In Development** (and reopen it) or forward to **Release Candidate** as specified by the :doc:`issue tracking guidelines </about/process/issue-tracking>`.
de: Sobald ein Entwickler die Arbeit an einem Problem beendet hat, wird es in die Qualitätssicherungsspalte des `GitHub-Projekts <https://github.com/ubports/ubuntu-touch/projects/3>`__ verschoben. Nun prüft man, ob das Problem im neuesten Stand des Entwicklungskanals gelöst ist und versucht weitere Probleme zu erkennen, die möglicherweise in Folge auftreten. Es ist darauf zu achten, ob der Entwickler bestimmte Dinge benannt hat, auf die während der Tests zu achten ist und dass man einen detaillierten Kommentar mit den eigenen Erfahrungen hinterlässt. Hat man Schreibrechte in dem Repository, kann der Fehlerbericht zurück in **In Development** oder weiter zu **Release Candidate** verschoben werden, entsprechend der Anleitungen zur :doc:`Problemverfolgung</about/process/issue-tracking>`.
es: Una vez que la solicitud de incorporación de cambios ha sido incorporada, el problema que soluciona se mueve a la columna de control de calidad del `proyecto en GitHub <https://github.com/ubports/ubuntu-touch/projects/3>`__. Compruebe si el problema está aún presente en la última actualización del canal de desarrollo y si algo más se ha roto en la actualización. Compruebe si el desarrollador mencionó algunas cosas específicas que buscar cuando se realicen pruebas y deje un comentario detallando su experiencia. Si tiene derecho de escritura en el repositorio, puede mover el problema de vuelta a **«In Development»** (**En desarrollo**) (y reabrirlo) o pasarlo a **«Release Candidate»** (**Versión candidata**) según se especifica en las :doc:`directrices de seguimiento de problemas </about/process/issue-tracking>`.
ru: После объединения pull-request и исправления ошибки, он перемещается в столбец группы обеспечения качества на `страничке проекта в GitHub <https://github.com/ubports/ubuntu-touch/projects/3>`__.Пожалуйста, проверьте, есть ли эта заявка в последнем обновлении на канале devel, а затем посмотрите, не сломалось ли что-нибудь еще в этом обновлении. Проверьте, упомянул ли разработчик конкретные вещи, на которые нужно обратить внимание при тестировании, и оставьте комментарий с подробным описанием ваших действий по воспроизведению бага. Если у вас есть права на запись в репозиторий, Вы можете перенести баг обратно в статус **In Development** (и открыть его заново) или перенести в **Release Candidate** как это описывается в документе :doc:`issue tracking guidelines </about/process/issue-tracking>`.

source: Initial triaging of issues
ca: Triatge inicial de problemes
de: Initiale Sichtung von Fehlerberichten
es: Clasificación inicial de problemas
nb: Innledende prioritering av problemer
ru: Первичная обработка баг-репортов

source: Initial triaging of new issues is done by QA-team members with write-access to the repository. If a new issue is filed, read the report and add the correct labels as specified by the :doc:`issue tracking guidelines </about/process/issue-tracking>`. You can also immediately start confirming the bugreport.
ca: Els membres de l'equip de control de qualitat amb permisos d'escriptura al repositori fa el triatge inicial dels problemes nous. Si es registra un nou problema, llegiu l'informe i afegiu les etiquetes correctes com s'especifica a :doc:`directrius per al seguiment de problemes </about/process/issue-tracking>`. Podeu començar immediatament a confirmar l'informe d'error.
de: Die initiale Sichtung von Fehlerberichten erfolgt durch QA-Teammitglieder mit Schreibrechten im Repository. Falls ein neuer Fehlerbericht eingeht, liest man diesen und fügt die korrekten Markierungen entsprechend der Anleitungen zur :doc:`Problemverfolgung </about/process/issue-tracking>`. Der Fehlerbericht kann gegebenenfalls auch direkt bestätigt werden.
es: La clasificación inicial de nuevos problemas la realizan los miembros del equipo de control de calidad con derecho de escritura en el repositorio. Si se presenta un nuevo problema, lea el informe y añada las etiquetas adecuadas según se especifica en las :doc:`directrices del seguimiento de problemas </about/process/issue-tracking>`. También puede comenzar inmediatamente a confirmar el informe de errores.
nb: Innledende prioritering av nye utgaver gjøres av QA-teammedlemmer med skrivetilgang til arkivet. Hvis en ny utgave er arkivert, kan du lese rapporten og legge til de riktige etikettene som angitt i: doc: `retningslinjer for problemsporing </about/process/issue-tracking>`. Du kan også umiddelbart bekrefte feilrapporten.
ru: Первичное рассмотрение новых заявок проводится участником группы обеспечения качества (QA) с правами записи в папки репозитория. Если новая запись уже создана, внимательно изучите её и установите корректные маркеры, как это указано в руководстве :doc:`issue tracking guidelines </about/process/issue-tracking>`. Сразу же можно заняться подтверждением баг-репорта.

source: If the new issue has already been reported elsewhere, label it **duplicate** and close it.
ca: Si ja s'ha reportat el nou problema en algun altre lloc, poseu-li l'etiqueta **duplicate** (duplicat) i tanqueu-lo.
de: Wurde das Problem bereits gemeldet, markiert man es als **duplicate** und schließt es.
es: Si el nuevo problema ya ha sido reportado en otra parte, etiquételo **duplicado** y ciérrelo.
nb: Hvis det nye problemet allerede er rapportert andre steder, merk det **duplikat** og lukk det.
ru: Если новый баг-репорт уже когда-то поступал, отметьте его маркером **duplicate** и закройте.

source: Although English is the official base language for all UBports projects we believe you have the right to use it in any language you want.
ca: Tot i que la llengua oficial de base per a tots els projectes de l'UBport és l'anglès, creiem que teniu dret a usar-lo en qualsevol llengua que vulgueu.
de: Auch wenn Englisch die offizielle Sprache für alle UBports-Projekte ist, glauben wir, dass Nutzer ein Recht darauf haben, in jeglicher Sprache zu partizipieren, wie sie wollen.
es: Aunque el inglés es el idioma base oficial para todos los proyectos de UBports creemos que tiene el derecho a usarlo en el idioma que usted quiera.
nb: Selv om engelsk er det offisielle basisspråket for alle UBports-prosjekter, mener vi at du har rett til å bruke det på hvilket som helst språk du vil.
ru: Хотя английский является официальным языком для всех проектов UBports, пользователь может свободно использовать любой язык.

source: We are working hard to meet that goal, and you can help as well. You decide how much time you can put into translation. From minutes to hours, everything counts.
de: Jeder kann selbst entscheiden, wie viel Zeit er in die Übersetzungen investiert, ob Minuten oder Stunden, jeder Beitrag zählt.
nb: Vi jobber hardt for å nå det målet, og du kan også hjelpe. Du bestemmer hvor mye tid du kan bruke på oversettelse. Fra minutter til timer, alt teller.
ru: Мы прилагаем все усилия, чтобы создать действительно качественный продукт, и Вы тоже можете помочь нам. Вы сами решаете, сколько времени потратить на перевод. Несколько минут, несколько часов - нам нужна любая помощь.

source: How does a text gets translated (technical background)
de: Wie ein Text übersetzt wird (technischer Hintergrund)
ru: Как переводить текст (техническую документацию)
