Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: sv

source: About
sv: Om

source: User Guide
sv: Användarguide

source: Contribute
sv: Bidra

source: Development
sv: Utveckling

source: Porting
sv: Portering

source: Click Packages
sv: Klick-paket

source: Ubuntu UI-Toolkit
sv: Verktyg för Ubuntu's grafiska gränssnitt

source: Clickable
sv: Klickbar

source: Platform
sv: Plattform

source: Welcome to the UBports documentation!
sv: Välkommen till dokumentationen för UBports!

source: Welcome to the official documentation of the UBports project!
sv: Välkommen till den officiella dokumentationen för UBports-projektet!

source: UBports develops the mobile phone operating system Ubuntu Touch. Ubuntu Touch is a mobile operating system focused on ease of use, privacy, and convergence.
sv: UBports utvecklar operativsystemet Ubuntu Touch för mobiltelefoner. Ubuntu Touch är ett operativsystem för mobiltelefoner med fokus på användarvänlighet, integritet och konvergens.

source: On this website you find guides to :doc:`install Ubuntu Touch on your mobile phone <userguide/install>`, :doc:`use Ubuntu Touch <userguide/dailyuse/index>`, :doc:`develop Ubuntu Touch apps <appdev/index>`, :doc:`port Ubuntu Touch to an Android handset <porting/introduction/index>` and :doc:`learn more about system components <systemdev/index>`. If this is your first time here, please consider reading our :doc:`introduction <about/introduction>`.
sv: På den här hemsidan så hittar du guider till :doc:`installera Ubuntu Touch i din mobiltelefon <userguide/install>`, :doc:`använd Ubuntu Touch <userguide/dailyuse/index>`, :doc:`utveckla appar för Ubuntu Touch <appdev/index>`, :doc:`portera Ubuntu Touch till en telefonlur med Android i <porting/introduktion/index>` och :doc:`lär dig mer om system-komponenter <systemdev/index>`. Vänligen överväg att läsa vår :doc:`introduktion<about/introduktion>`.

source: If you want to help improving this documentation, :doc:`the Documentation contribute page <contribute/documentation>` will get you started.
sv: Om du hjälpte till att förbättra dokumentationen så kommer :doc:`dokumentationsbidragssidan <contribute/documentation>` att hjälpa dig att komma igång.

source: You may view this documentation in the following languages:
sv: Du kan visa den här dokumentationen i följande språk:

source: `English <https://docs.ubports.com/en/latest/>`_
sv: `Engelska <https://docs.ubports.com/en/latest/>`_

source: `Català <https://docs.ubports.com/ca/latest/>`_
sv: `Katalanska <https://docs.ubports.com/ca/latest/>`_

source: `Français <https://docs.ubports.com/fr/latest/>`_
sv: `Franska <https://docs.ubports.com/fr/latest/>`_

source: `Deutsch <https://docs.ubports.com/de/latest/>`_
sv: `Tyska <https://docs.ubports.com/de/latest/>`_

source: `Italiano <https://docs.ubports.com/it/latest/>`_
sv: `Italienska <https://docs.ubports.com/it/latest/>`_

source: `Română <https://docs.ubports.com/ro/latest/>`_
sv: `Rumänska <https://docs.ubports.com/ro/latest/>`_

source: `Русский <https://docs.ubports.com/ru/latest>`_
sv: `Ryska <https://docs.ubports.com/ru/latest>`_

source: `Türkçe <https://docs.ubports.com/tr/latest/>`_
sv: `Turkiska <https://docs.ubports.com/tr/latest/>`_

source: `Español <https://docs.ubports.com/es/latest/>`_
sv: `Spanska <https://docs.ubports.com/es/latest/>`_

source: `Simplified Chinese <https://docs.ubports.com/zh_CN/latest/>`_
sv: `Förenklad Kinesiska <https://docs.ubports.com/zh_CN/latest/>`_
