Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/humanguide.po
Languages: ru

source: App main view
ru: Основные приложения

source: When an app starts, shows a generic splash screen (as in the image) or a custom one, then the main view.
ru: Когда приложение запускается, отображается общий экран-заставка (как на изображении) или пользовательский экран, а затем основной вид.

source: The standard parts of a main view or any other page may be:
ru: Стандартные элементы основного вида или любой другой страницы могут быть:

source: Header
ru: Заголовок

source: Display app name, leading area and trailing area icons.
ru: Отображение названия приложения, значков начальной и конечной областей.

source: In this case, showing title and trailing actions.
ru: В этом случае отображается заголовок и конечные действия.

source: Tabbed content
ru: Содержимое с вкладками

source: To organize information under tabs.
ru: Чтобы упорядочить информацию по вкладкам.

source: Bottom edge menu
ru: Меню нижнего края

source: For quick actions. See `Quick actions`_.
ru: Для быстрых действий. См. раздел "Быстрые действия"_.

source: Dialogs
ru: Диалоги

source: A dialog is a way of informing the user about important notices or letting them complete a single action.
ru: Диалог-это способ информирования пользователя о важных уведомлениях или предоставления ему возможности выполнить одно действие.

source: Dialogs should be unambiguous and concise in their wording. Only the most common, or main, action should be highlighted with color. The main action should be placed topmost in vertical dialogs or rightmost in horizontal dialogs.
ru: Диалоги должны быть недвусмысленными и лаконичными в своих формулировках. Только самое общее, или главное действие должно быть выделено цветом. Главное действие должно располагаться сверху в вертикальных диалогах или справа в горизонтальных диалогах.

source: Main actions may be positive, negative, or neutral. Positive actions add something to their subjects. Negative actions remove, delete, or otherwise make changes that can't be easily undone. Neutral actions do not add or remove from the subject, but still make a change.
ru: Основные действия могут быть положительными, отрицательными или нейтральными. Положительные действия добавляют что-то к их предметам. Негативные действия перемещают, удаляют или каким-то иным образом вносят изменения, которые нельзя легко отменить. Нейтральные действия не добавляют и не удаляют предмет, но все же вносят изменения.

source: The main action should be highlighted using ``theme.palette.normal.negative`` if it is destructive, ``theme.palette.normal.positive`` if it is positive, or ``theme.palette.normal.focus`` if it is neutral. The remaining options should be gray, without defining a color theme property.
ru: Основное действие должно быть выделено с помощью ``theme.palette.normal.negative`` если оно негативно ``theme.palette.normal.positive``, если оно позитивно, или ``theme.palette.normal.focus``, если оно нейтрально. Остальные параметры должны быть серыми, без определения свойства цветовой темы.

source: Dialogs should resume actions, not ask a yes or no question. For example, the user has selected an option to delete a contact. Your dialog should ask, "Are you sure you would like to delete this contact?" The options should then be "Delete", a negative action colored in red, and "Cancel", colored in gray.
ru: Диалоги должны возобновлять действия, а не задавать вопрос " да " или "нет". Например, пользователь хочет удалить какой-то контакт в адресной книге. Ваш диалог должен быть таким: "Вы уверены, что хотите удалить этот контакт?" Варианты ответа - "удалить" - отрицательное действие, окрашенное в красный цвет, и" отмена" - окрашенное в серый цвет.

source: Examples of designs to avoid
ru: Примеры конструкций, которых следует избегать

source: Left: Download button uses old focus color, Cancel button (secondary action) uses old grey color.
ru: Слева: кнопка загрузки использует старый цвет фокуса, кнопка отмены (вторичное действие) использует старую серую расцветку.

source: Right: Dialog uses generic answers, both buttons colored as main actions with confusing color meaning: "Will 'No' cause an irreversible action, and 'Yes' cause an additive action?"
ru: Справа: Диалог использует общие ответы, обе кнопки окрашены как основные действия с запутанным цветовым оформлением: "будет ли клавиша "нет "вызывать необратимое действие, а "да" - аддитивное действие?"

source: Header uses
ru: Использование заголовка

source: App headers can be used to show app name, app section or page, search box, or other globally accessible functions.
ru: Заголовки приложений можно использовать для отображения имени приложения, раздела или страницы приложения, поля поиска или других глобально доступных функций.

source: Some special apps doesn't show any header, like the Camera app or some games.
ru: Некоторые специальные приложения не показывают никакого заголовка, например приложение камеры или некоторые игры.

source: The header takes care of showing the back button when a `page stack <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/PageStack.html>`__ is used.
ru: Заголовок нужен, чтобы показать кнопку "назад", когда используется "стек страниц <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/PageStack.html>' __ .

source: Importing Data
ru: Импорт данных

source: Interchange of data between apps is done through Content Hub. This improves isolation between apps.
ru: Обмен данными между приложениями осуществляется через Content Hub. Это улучшает изоляцию между приложениями.

source: Apps with the appropriate apparmor permissions can import, export or share data between them.
ru: Приложения с соответствующими разрешениями apparmor могут импортировать, экспортировать или обмениваться данными между собой.

source: For more information see `Importing from Content Hub and URLdispatcher`_.
ru: Для получения дополнительной информации см. раздел `Импорт из Content Hub и URLdispatcher`_.

source: App layout
ru: Макет приложения

source: Main actions
ru: Основное действие

source: Main actions are displayed in the corresponding header of the Page. The header should show only relevant actions to the current page.
ru: Основные действия отображаются в соответствующем заголовке страницы. Заголовок должен показывать только соответствующие действия для текущей страницы.

source: Main page of Contacts app shows:
ru: Главная страница приложения Контакты выглядит так:

source: When viewing a single contact, only relevant actions are shown:
ru: При просмотре одного контакта отображаются только соответствующие действия:

source: Slots
ru: Ячейки

source: The header contains a number of slots that can hold actions or navigational options. Depending on the surface or window size, additional slots can be added to show the actions otherwise hidden in drawers.
ru: Заголовок содержит несколько ячеек, которые могут содержать действия или навигационные параметры. В зависимости от размера поля или окна можно добавить дополнительные ячейки, чтобы показать действия, которые иначе скрыты.

source: Action Drawer
ru: Панель быстрого доступа

source: Actions will be placed into an action drawer when there are no available slots to house them. However, when your app is on a larger surface, like on a desktop, then actions will appear in the slots.
ru: Действия будут помещены в панель быстрого доступа, когда нет доступных слотов для их размещения. Однако когда ваше приложение находится на большом экране, например на рабочем столе,действия будут отображаться в слотах.

source: Responsive layout
ru: Адаптивный макет

source: As the header gains width across screen sizes, additional slots become visible and actions in the drawer will appear automatically.
ru: По мере увеличения ширины заголовка в разных размерах экрана становятся видны дополнительные слоты, и действия на панели быстрого доступа появляются автоматически.

source: 3 slot layout
ru: Третий слой слотов

source: 4 slot layout
ru: четвертый слой слотов

source: 5 slot layout
ru: пятый слой слотов

source: 6 slot layout
ru: шестой слой слотов

source: Medium to large screens
ru: Средний и большой экраны

source: The maximum number of visible action slots in a convergent environment is 6. If this is exceeded then additional actions will migrate to the action drawer.
ru: Максимальное количество видимых слотов в конвергентной среде - 6. Если это число превышено, дополнительные действия будут перенесены в панель быстрого доступа.

source: Simple
ru: Простота

source: Keep in mind to keep a clean design. The simpler, the better.
ru: Помните о том, что дизайн должен быть простым и минималистичным. Чем проще, тем лучше.

source: Presenting data
ru: Презентация данных

source: List Items
ru: Элементы списка

source: List items can be used to make up a list of ordered scrollable items that are related to each other.
ru: Элементы списка можно использовать для создания списка упорядоченных прокручиваемых элементов, связанных друг с другом.

source: When images or icons are presented without text or actions, it would make more sense to show them inside a grid rather than a list; like in a photo gallery.
ru: Когда изображения или значки представлены без текста или действий, было бы разумнее отображать эти элементы как в фотогалерее, а не в списке.

source: Items in a list can have actions that can be placed in a context menu. The context menu can be accessed in two ways: by swiping or right-clicking the list item.
ru: Элементы в списке могут иметь действия, которые можно разместить в контекстном меню. В контекстное меню можно попасть двумя способами: с помощью движения пальцами ("свайп") или щелкнув правой кнопкой мыши элемент списка.

source: The actions are placed within two categories: leading for negative actions and trailing for positive actions.
ru: Действия делятся на две категории: для отрицательных действий и для положительных действий.

source: Touch swiping
ru: "Свайпы" (жесты пальцами)

source: Mouse right click
ru: Щелчок правой клавишей мыши

source: Keyboard navigation
ru: Навигация с помощью клавиатуры

source: Lists in edit mode
ru: Списки в режиме редактирования

source: Edit mode allows users to modify a particular item or multiple items at once.
ru: Режим редактирования позволяет пользователям один или несколько элементов одновременно.

source: You can use edit mode to allow users to multi-select, rearrange or delete items inside a list. When edit mode is entered the whole screen becomes an edit state and the header will show associated editing actions for the content. Alternatively, if the user long presses an item a context menu will show the associated editing actions too.
ru: Вы можете использовать режим редактирования, чтобы пользователи могли выбирать, переупорядочивать или удалять элементы в списке. При входе в режим редактирования весь экран переходит в состояние редактирования, а в заголовке отображаются соответствующие действия по редактированию содержимого. Или можно иначе - если пользователь долго нажимает на элемент, контекстное меню также покажет связанные действия редактирования.

source: Layout of detailed list items
ru: Макет подробного списка пунктов

source: 1 line – Title
ru: 1 линия - Название

source: 1 line – Subtitle
ru: 1 линия - Подзаголовок

source: 2 lines – Summary
ru: 2 линия - Резюме

source: Quick actions
ru: Быстрые действия

source: The most common action for an app, the one that needs to be accessed quickly might be added as a `bottom edge <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/BottomEdge.html>`__ action, accessed with a swipe from outside of the screen upwards.
ru: Наиболее распространенное действие для приложения, к которому нужно быстро получить доступ, можно добавить как действие`bottom edge <https://api-docs.ubports.com/sdk/apps/qml/Ubuntu.Components/BottomEdge.html > `__ , доступ к которому осуществляется с помощью свайпа по экрану вверх.

source: You can add a new contact in the Contacts app swiping up:
ru: Можно добавить новый контакт в приложение «Контакты», проведя пальцем вверх:

source: Hint
ru: Подсказки

source: The hint is used to let the user know that there is something worth trying at the bottom of the screen.
ru: Подсказки используются, чтобы сообщить пользователю, что в нижней части экрана есть нужные данные или элементы.

source: After opening an app, a hint with a text and/or an icon is shown:
ru: После запуска приложения отображается подсказка с текстом и/или значком:

source: After after a few seconds it hides and a floating icon is shown
ru: Через несколько секунд она скроется, и появится плавающая иконка

source: App icon design
ru: Дизайн иконок приложений

source: The whole system and apps follow the `Suru design principles <http://web.archive.org/web/20191223082720/https://docs.ubuntu.com/phone/en/apps/design/get-started/design-philosophy>`__ started by Canonical and `Samuel Hewitt <https://samuelhewitt.com>`__.
ru: Вся система и приложения выполнены по правилам `Suru design principles <http://web.archive.org/web/20191223082720/https://docs.ubuntu.com/phone/en/apps/design/get-started/design-philosophy>`__, авторы которых - компания Canonical и`Samuel Hewitt <https://samuelhewitt.com>`__.

source: Design Philosophy and Suru Meaning
ru: Философия дизайна и стиль Suru

source: Suru alludes to Japanese culture.
ru: Suru ведет своё происхождение из японской культуры.

source: The design of Suru is inspired by origami.
ru: В элементах оформления Suru угадываются идеи оригами.

source: Paper can be used in two and three dimensional forms, because it is transferable and diverse.
ru: Бумага - материал универсальный. Она может принимать разнообразные формы, как объемные трехмерные, так и двухмерные.

source: Suru brings a precise yet organic structure to the Ubuntu Touch interface. The sharp lines and varying levels of transparency evoke the edges and texture of paper.
ru: Suru дает точную и органичную структуру интерфейсу Ubuntu Touch. Четкие линии и различный уровень прозрачности напоминают острую кромку листов бумаги и их текстуру.

source: Design Tips for an App Icon
ru: Советы по оформлению пиктограмм и знаков приложений

source: Descriptive design
ru: Понятный дизайн

source: The icon you choose for your app should describe what your app is about, what it does, or what service it is there for in a recognizable way.
ru: Иконка приложения должна давать представление о программе, для чего она предназначена или для какой службы выпущена.

source: Distinctive shapes
ru: Отличительные формы

source: Depending on the object you choose to show in the icon, on the perspective, lighting and other factors, it might be hard to recognize what you are trying to depict. A TV might look like a box, or a computer screen, a remote control like a phone, etc.
ru: В зависимости от изображения на иконке, от его перспективы и детализации, может быть трудно понять, что именно изображено. Телевизор может выглядеть как коробка, экран компьютера, пульт - как телефон и так далее.

source: Details
ru: Детали

source: A detailed icon is very nice to look at as it shows quality and your eye for the small things. It might add confusion though, especially in smaller sizes or for people who have impaired eyesight. Show what's necessary, pay attention to detail, but don't overload the icon.
ru: На хорошо прорисованный значок приятно смотреть, это говорит о внимании к мелочам и качестве приложения. Однако это может запутать пользователя или создавать трудности людям с ослабленным зрением. Покажите, что мелочи важны, но старайтесь не перегружать иконку.

source: Colours
ru: Цвета

source: Use distinctive colours, make your icon stand out a bit and give the shapes enough contrast to be visible.
ru: Лучше использовать разные цвета, чтобы выделить иконку программы. Чтобы значки и детали были заметны, нужно сделать их контрастными.

source: Gradients
ru: Цветовые оттенки (градиент)

source: If you were to add a gradient to your icon, only use colours that are slightly different from each other so that the change is not too dramatic. For example:
ru: Если иконка использует градиентную расцветку, лучше использовать цвета, которые немного отличаются друг от друга, чтобы цветовая палитра изменялась плавно. Например:

source: Composition
ru: Композиция

source: Suru icons are composed of simple geometric shapes. The background is usually a coloured surface with the pictogram, also composed of flat shapes, “floating” above it.
ru: Иконки Suru состоят из простых геометрических фигур. Фон обычно представляет собой цветную поверхность с пиктограммой, также состоящей из плоских фигур, «плавающей» над поверхностью.

source: The Fold Effect
ru: Эффект линии сгиба

source: In keeping with the origami motif, some Suru icons have an implied fold. In many icons this is a single horizontal or vertical line but sometimes the fold line(s) correspond or align with elements of the pictogram.
ru: Как и в фигурках оригами, у некоторых иконок Suru есть едва видимая складка. Во многих значках это одна горизонтальная или вертикальная линия, но иногда на пиктограмме можно видеть несколько линий сгиба.

source: The fold is drawn by creating an overlay of a white or black polygon of very low opacity (usually between 1%~10%).
ru: Линия сгиба создается путем наложения белого или черного многоугольника с очень низким значением параметра "непрозрачность" (обычно от 1% до 10%).

source: Grids
ru: Сетка

source: Using a grid layout ensures consistency across all icons and will force you to reserve area for the icon background for even padding around the pictogram.
ru: Использование макетной сетки обеспечивает одинаковое оформление всех иконок и заставляет разработчиков резервировать область для фона значка для равномерного заполнения вокруг пиктограммы.

source: Note that the circular elements are slightly larger than rectangular elements of the grid, this overshoot is needed to compensate for the optical illusion where circular objects appear smaller than rectangular objects of the same dimensions.
ru: Обратите внимание, что круглые элементы немного больше прямоугольных элементов сетки. Такое оформление необходимо, чтобы компенсировать оптическую иллюзию, когда круглые объекты кажутся меньше прямоугольных объектов тех же размеров.

source: Unit Grid
ru: Сетка на устройстве

source: Designing with an overall pixel grid in mind is crucial to having crisp, clean icons. Since most desktop icons have dimensions that are a factor of four (16x16, 24x24, 32x32, 48x48, 256x256) using a pixel grid with lines every 4 pixels and drawing to that grid is the best practice.
ru: При разработке дизайна с учетом общей пиксельной сетки очень важно иметь четкие и чистые значки. Поскольку большинство значков на рабочем стол могут быть 4-х типов (16x16, 24x24, 32x32, 48x48, 256x256), лучше всего использовать пиксельную сетку с линиями каждые 4 пикселя и рисовать в этой сетке.

source: Shadows
ru: Тени

source: Often a Suru icon is drawn with two distinct sets of shadows, one for the pictogram to create a drop shadow effect, and a second below the overall icon shape.
ru: Часто значок Suru рисуется с двумя отдельными наборами теней: один для пиктограммы, чтобы создать эффект тени, а второй - под общей формой значка.

source: The drop shadow effect on the central pictogram is a combination of two shadow that are identical in shape to the pictogram:
ru: Эффект падающей тени на центральной пиктограмме представляет собой комбинацию двух теней, идентичных по форме пиктограмме:

source: a shape that is rgba(0,0,0,0.1) with vertical offset of 2 pixels and a blur of 1%
ru: форма rgba (0,0,0,0.1) с вертикальным смещением 2 пикселей и размытием 1%

source: a shape that is rgba(0,0,0,0.4) with vertical offset of 4 pixels and a blur of 10%
ru: форма тени rgba (0,0,0,0.4) с вертикальным смещением 4 пикселей и размытием 10%

source: If the fold effect is present, the second shadow is drawn using a linear gradient with three stops whose positions correspond to the location of the background fold.
ru: Если присутствует эффект линии сгиба, вторая тень рисуется с использованием линейного градиента. Во время прорисовки делаются три точки, позиции которых соответствуют местоположению линии сгиба.

source: Highlights
ru: Световые эффекты

source: Pictograms have an ever~so~slight (1 pixel) white highlight along the top edge of them. To do this, make 2 solid white copies of the main pictogram shape and move one copy 1 pixel down and 'difference' the two so what's left is an 'edge' that you can align to the top of the pictogram. Repeat as needed.
ru: Пиктограммы имеют очень слабую (1 пиксель) белую подсветку по верхнему краю. Чтобы добиться этого эффекта, включите две абсолютно белых копии основной формы пиктограммы и переместите одну копию формы на 1 пиксель вниз и совместите две формы так, чтобы остался «край», который вы можете выровнять по верхнему краю пиктограммы. При необходимости процесс можно повторить.

source: Depending on the colour of your pictogram element, you can vary the opacity of your highlight. For instance, if it is using bright, primary colours, there isn't any need for a highlight.
ru: В зависимости от цвета элемента пиктограммы можно изменять прозрачность световых эффектов. Например, при использовании ярких основных цветов нет необходимости использовать световые эффекты.

source: Grids and other resources can be found in this `gitlab repository <https://gitlab.com/cibersheep/ubuntu-icon-resource-kit>`__.
ru: Сетки и другие ресурсы можно найти в этом `gitlab-репозитории <https://gitlab.com/cibersheep/ubuntu-icon-resource-kit>`__.

source: In-app icons design
ru: Дизайн иконок в приложении

source: Interface Icons
ru: Иконки интерфейса

source: Interface icons communicate either status or action displays, such as battery level or an alarm, whilst also enabling the user to perform actions like opening a menu, sharing content or print a document. The interface icons are located in the top bar or in-app icons, such as in the Header or the menus.
ru: Интерфейсные значки сообщают нужны для индикации статуса устройства или действий пользователя. Например, они показывают уровень заряда батареи, а также позволяют пользователю открывать меню, просматривать контент или работать с документами. Значки интерфейса расположены на верхней панели или в приложении, например, в заголовке или меню.

source: See a `list of the icons <http://docs.ubports.com/projects/icons/>`__. available in the system.
ru: Полный `список значков <http://docs.ubports.com/projects/icons/>`__, которые есть в системе UTouch.

source: Color
ru: Цвет

source: Interface icons can be colourized in qml therefore are designed in #808080 color.
ru: Иконки интерфейсов можно раскрасить в qml, они раскрашены в цвет #808080.

source: Font
ru: Шрифт

source: To provide a consistent look to the UI and to make the Suru icons distinctive, the design is based on the same patterns as the Ubuntu font. The font patterns can applied to the symbol to define its contours.
ru: Чтобы обеспечить единообразный вид пользовательского интерфейса и сделать значки Suru отличительными, дизайн основан на тех же шаблонах, что и шрифты Ubuntu. Шаблоны шрифтов можно применить к символу, чтобы определить его контуры.

source: Strokes
ru: Линии

source: Stroke ends are squared but the upper end of vertical strokes is slightly oblique with a +10º angle.
ru: Концы линий имеют прямоугольную форму, но верхний конец вертикальных линий слегка скошен под углом + 10º.

source: Rotation
ru: Вращение

source: When they are not horizontal or vertical, objects are oriented along a +45º axis.
ru: Когда объекты не расположены горизонтально или вертикально, они ориентированы по оси + 45º.

source: Corners
ru: Углы
