Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/humanguide.po
Languages: ru

source: Curved corners are preferred if possible. The following picture shows a zoom on the default outer and inner curvatures, with nodes and Bezier handle. The default curvature can be scaled down when the shape is smaller.
ru: По возможности лучше использовать скругленные углы. На следующем рисунке показано увеличенное изображение внешних и внутренних закругленных углов с узлами и маркером Безье. Кривизну по умолчанию можно уменьшить, если используется форма поменьше.

source: Arrows
ru: Стрелки

source: A chevron symbol is used for navigation arrows. The arrowhead is an isosceles triangle where the two equal sides are slightly curved (following the pattern of the Y character).
ru: Навигационные стрелки обозначены символом шеврона. Стрелка представляет собой равнобедренный треугольник, две равные стороны которого слегка изогнуты (по образцу буквы "Y").

source: Opacity
ru: Тени и непрозрачность

source: 50% opacity is used to reflect the status of an indicator. In case of a double space (enabled and disabled, for example), the opacity of the whole icon changes. When the status allows a range of values, the opacity of a single portion of icon can be altered.
ru: Прозрачность в 50% используется для отражения статуса индикатора. В случае двойного нажатия (например, включенного и выключенного) прозрачность всего значка изменится. Когда статус допускает диапазон значений, можно изменить прозрачность отдельной части значка.

source: Grid
ru: Сетка

source: Interface icons are designed for 96x96 pixels, with at least 4 pixels of margin on every side.
ru: Интерфейсные иконки имеют размер 96x96 пикселей, с полями не менее 4 пикселей с каждой стороны.

source: Design concepts
ru: Концепции дизайна

source: As designed by `Canonical <https://www.canonical.com/>`__, we use the following system palette (from `Michał Prędotka <http://colors.mivoligo.com/>`__ and `Ubuntu documentation <https://docs.ubuntu.com/phone/en/apps/api-qml-development/Ubuntu.Components.UbuntuColors>`__):
ru: Как и во всех продуктах компании `Canonical <https://www.canonical.com/>`__, у нас используется следующее цветовое оформление (автор - `Michał Prędotka <http://colors.mivoligo.com/>`__, подробнее можно посмотреть в `комплекте документации Ubuntu <https://docs.ubuntu.com/phone/en/apps/api-qml-development/Ubuntu.Components.UbuntuColors>`__):

source: Operating system and app palette
ru: Операционная система и цветовая палитра приложений

source: #FFFFFF White
ru: #FFFFFF Белый

source: Recommended for background on Ambiance theme (light theme) or regular text on Suru Dark theme.
ru: Рекомендуется для фона в теме Ambiance (светлая тема) или стандартного текста в теме Suru Dark.

source: #111111 Jet
ru: #111111 Гагат

source: Recommended for regular text on Ambiance theme or background in Suru Dark.
ru: Рекомендуется для обычного текста в теме Ambiance или фона в теме Suru Dark.

source: #3B3B3B Inkstone
ru: #3B3B3B Чернильный камень

source: Recommended for foreground colours in dark themes.
ru: Рекомендуется для цветов переднего плана в темных темах.

source: #5D5D5D Slate
ru: #5D5D5D Сланец

source: Recommended for text and action icons.
ru: Рекомендуется для текста и значков действий.

source: #666666 Graphite
ru: #666666 Графит

source: Recommended for coloring dark themes' background.
ru: Рекомендуется для фона темных тем оформления.

source: #888888 Ash
ru: #888888 Пепел

source: Recommended for subtitles and other tertiary content.
ru: Рекомендуется для субтитров и второстепенного контента.

source: #CDCDCD Silk
ru: #CDCDCD Шёлк

source: Recommended for neutral action buttons and secondary text.
ru: Рекомендуется для нейтральных клавиш и дополнительного текста.

source: #F7F7F7 Porcelain
ru: #F7F7F7 Фарфор

source: Recommended for foregrounds.
ru: Рекомендуется для переднего плана.

source: #335280 Blue
ru: #335280 Синий

source: Recommended for progress bars, selected areas, text selection and text cursor. Also neutral actions (Ambiance).
ru: Рекомендуется для строк состояния, выделенного текста и областей, текстового курсора. Также используется для нейтральных действий (в теме Ambiance).

source: #19B6EE Light Blue
ru: #19B6EE Светло-синий

source: Recommended for progress bars, selected areas, text selection and text cursor. Also neutral actions (SuruDark).
ru: Рекомендуется для строк состояния, выделенного текста и областей, текстового курсора. Также используется для нейтральных действий (в теме SuruDark).

source: #0E8420 Green
ru: #0E8420 Зелёный

source: Recommended for positive action buttons (Ambiance).
ru: Рекомендуется для кнопок положительного действия (Ambiance).

source: #3EB34F Light Green
ru: #3EB34F Светло-зелёный

source: Recommended for positive action buttons (SuruDark).
ru: Рекомендуется для кнопок положительного действия (SuruDark).

source: #C7162B Red
ru: #C7162B Красный

source: Recommended for negative and irreversible action buttons, errors and alerts (Ambiance).
ru: Рекомендуется для кнопок негативных действий, ошибок и предупреждений (Ambiance).

source: #ED3146 Light Red
ru: #ED3146 Светло-красный

source: Recommended for negative and irreversible action buttons, errors and alerts (SuruDark).
ru: Рекомендуется для кнопок отрицательных действий, ошибок и предупреждений (SuruDark).

source: #E95420 Orange
ru: #E95420 Оранжевый

source: Orange is recommended for branded elements, focus and intensity.
ru: Оранжевый цвет используется для "фирменных" элементов Ubuntu Touch, а также для привлечения внимания.

source: Typography
ru: Оформление

source: Fonts
ru: Шрифты

source: Our default font is `Ubuntu <https://design.ubuntu.com/font/>`__ `[2] <https://en.wikipedia.org/wiki/Ubuntu_(typeface)>`__ installed in the system.
ru: По умолчанию в системе используется шрифт `Ubuntu <https://design.ubuntu.com/font/>`__ `[2] <https://en.wikipedia.org/wiki/Ubuntu_(typeface)>`__.

source: For the font sizes to be consistent across devices, instead of setting the font size as a number of pixels or points, it is imperative to define the font size in terms of size names:
ru: Чтобы размеры шрифта были одинаковыми на всех устройствах,нужно устанавливать размер шрифта не в виде количества пикселей или точек, а названиях размеров:

source: Font Size Name
ru: Название размера шрифта

source: Desktop
ru: Десктоп

source: Phone
ru: Смартфон

source: Tablet
ru: Планшет

source: 4" HD Screen
ru: Экран 4" HD

source: 10" HD screen
ru: Экран 10" HD

source: Units
ru: Единицы

source: Resolution Independence Approach
ru: Независимое разрешение

source: The objective of resolution independence is to make it easy for graphical user interfaces in Ubuntu Touch to scale to all the form factors that Ubuntu Touch targets: phones, tablets, laptops and desktops. The approach taken combines simplicity for the designers and developers with visual fidelity, quality and usability.
ru: Независимость от экранного разрешения должна упростить масштабирование графических пользовательских интерфейсов в Ubuntu Touch для всех форм-факторов: телефонов, планшетов, ноутбуков и настольных компьютеров. Такой подход сочетает в себе простоту для дизайнеров и разработчиков с визуальной точностью, качеством и удобством использования.

source: Measurement Units
ru: Единицы измерения

source: A measurement unit called the *grid unit* is defined, abbreviated *gu.* 1 grid unit translates to a given number of pixels depending on the type of screen that the user interface is displayed on. For example, on a laptop computer 1 grid unit will typically translate to 8 pixels. The number of pixels per grid unit is chosen in order to preserve the perceived visual size of UI elements and therefore depends on the density of the display and the distance the user is to the screen. We also ensure that 1 grid unit is always an integer number of pixel.
ru: Единица измерения *grid unit* сокращенно называется *gu*. 1 единица сетки переводится в заданное количество пикселей в зависимости от типа экрана, на котором отображается пользовательский интерфейс. Например, на ноутбуке 1 единица сетки обычно соответствует 8 пикселям. Количество пикселей на единицу сетки выбирается для сохранения воспринимаемого визуального размера элементов пользовательского интерфейса и зависит от плотности отображения и расстояния, на котором находится пользователь от экрана. Одна единица сетки всегда является целым числом пикселей.

source: Device
ru: Устройство

source: Conversion
ru: Конвертация

source: Most laptops
ru: Стандартный ноутбук

source: High DPI laptops
ru: Ноутбуки с высоким DPI

source: Phone with 4 inch screen at HD resolution (around 720x1,280 pixels)
ru: Смартфон с экраном 4" с HD-разрешением (720x1280)

source: Tablet with 10 inch screen at HD resolution (around 720x1,280 pixels)
ru: Планшет с экраном 10" и HD-разрешением (720x1280)

source: Density Unit
ru: Плотность устройства

source: Exceptionally, in order to accommodate for the rare cases where measurements of less than 1 gu are needed another unit is available: the *density independent pixel,* abbreviated dp. 1 dp typically translates to 1 pixel on laptops and low density mobile phones and tablets.
ru: В редких случаях, когда требуются измерения менее 1 gu, можно использовать другую единицу измерения: *density independent pixel, * сокращенно dp. 1 dp обычно соответствует 1 пикселю на ноутбуках, планшетах и смартфонах с низким разрешением экрана.

source: Use
ru: Использование

source: Device Sizes
ru: Размер устройства

source: Device Grid Units
ru: Grid Units для устройств

source: width
ru: ширина

source: height
ru: высота

source: E5 (portrait)
ru: E5 (портретный режим)

source: M10 HD (landscape)
ru: M10 HD (пейзажный режим)

source: M10 FHD (landscape)
ru: M10 FHD (пейзажный режим)

source: N5 (portrait)
ru: N5 (портретный режим)

source: Human interface guidelines
ru: Рекомендации по интерфейсу пользователя

source: Ubuntu Touch follows a clean, beautiful, modern and (above all) convergent design. We aim to keep developing the design started by Canonical.
ru: Ubuntu Touch обладает современным, красивым и (прежде всего) конвергентным дизайном. Мы продолжаем работать над идеями и концепциями, предложенными фирмой Canonical.

source: Accessibility
ru: Доступность

source: Accessibility is important to make all users to be able to use the operating system.
ru: В идеале каждый пользователь должен иметь возможность установить и работать с Ubuntu Touch.

source: Inclusive palette and theme
ru: Комфортная палитра цветов и тема оформления

source: We would like to create and implement color palettes helpful to people who have sight impairment:
ru: Мы хотим создать оформление, которое будет удобным для людей с нарушениями зрения:

source: Additional `palette proposal <http://colors.mivoligo.com/#color-blind>`__.
ru: Дополнительная `палитра <http://colors.mivoligo.com/#color-blind>`__.

source: A high contrast theme.
ru: Высококонтрастная тема.

source: Adaptable font size theme.
ru: Тема с адаптируемым размером шрифта.

source: Input methods
ru: Методы ввода

source: Apps should be accessible using any combination of mouse, touch, and keyboard.
ru: Приложения должны запускаться с помощью любой клавиши мыши, нажатия на сенсорном экране и клавишам клавиатуры.

source: Convergence
ru: Конвергенция

source: Convergence is one of the milestones Ubuntu Touch wants to achieve. One app available across all screen sizes and input methods, such as mobile handsets, tablets, and laptops.
ru: Конвергенция - одна из фундаментальных идей Ubuntu Touch. Любое приложение может работать на любых устройствах и не зависеть от размера экранов. Например на мобильных телефонах, планшетах и ноутбуках изображение будет одинаковым.

source: Screen size
ru: Размер экрана

source: Ubuntu Touch Tweak Tool app
ru: Приложение Ubuntu Touch Tweak Tool

source: Main page stays as the main page on phones or on the left on bigger screen devices. Additional pages on the phone, can be displayed at variable sizes on the right on bigger screens.
ru: Главная страница будет располагаться на основном экране смартфона или слева на устройствах с большим экраном. Дополнительные экраны смартфона в уменьшенном размере будут расположены справа на устройствах с большим экраном.

source: Input method
ru: Способы ввода информации

source: Using touch, a user can swipe or long-press on a list item to reveal a contextual menu. Using a pointer (mouse or trackpad) a user can right-click the item to reveal the contextual menu. Using a keyboard a user can focus the desired item and press the MENU key to open the context menu.
ru: На тач-скрине открытие и навигация по контекстному меню осуществляется с помощь "свайпов" или долгих нажатий. Используя курсор (мышь или трекпад), пользователь может открыть контекстное меню правой клавишей мыши. На клавиатуре пользователь может выделить нужный элемент и нажать клавишу МЕНЮ, чтобы открыть контекстное меню.

source: Other design considerations
ru: Другие замечания по дизайну

source: Scaling images
ru: Масштабирование изображений

source: Scaling images is important in a convergent app. App icons and images can be created in scalable formats to improve their ability to scale.
ru: Масштабирование изображений нужно для нормального функционирования режима конвергенции. Значки и изображения приложений лучше создавать в масштабируемом формате, чтобы улучшить их вид на разных устройствах.

source: One of the most popular scalable formats is `SVG <https://en.wikipedia.org/wiki/Scalable_Vector_Graphics>`__. SVG files can be created using software like `Inkscape <https://inkscape.org/>`__.
ru: Одним из самых популярных масштабируемых форматов является `SVG <https://en.wikipedia.org/wiki/Scalable_Vector_Graphics>`__. Файлы SVG можно создавать с помощью программы ʻInkscape <https://inkscape.org/> `__.

source: One particularity of qml, though, is that SVGs are rendered to use less memory, losing the advantages of scalability. When using a SVG file in an ``Image`` element we can use the property called ``sourceSize``. This will define the rendered size of the SVG image. A SVG image with a ``sourceSize`` width and height of 252 pixels, will be rendered as if the scalable image would be a png of 252 per 252 pixels.
ru: В qml есть особенность - SVG-файлы подвергаются рендерингу, чтобы занимать меньше памяти. Это теряет преимущества масштабируемости. При использовании SVG-файла в элементе «Изображение» можно использовать свойство с именем ``sourceSize``. Это определит визуализированный размер изображения SVG. Изображение SVG с шириной ``sourceSize`` и высотой 252 пикселя будет отображаться так, как если бы масштабируемое изображение было бы png-файлом размером 252 на 252 пикселя.

source: It is not advisable to define ``sourceSize`` as a relative size to avoid performance issues. A good practice is defining ``sourceSize`` based on a set list of thresholds. In the example below the image.svg will be rendered 60 per 60 grid units if the main view is bigger that 70 grid units but as an image of 40 per 40 grid units in the other cases. By defining these thresholds, we get scalable images without a huge performance cost.
ru: Не рекомендуется определять ``sourceSize`` как относительный размер, чтобы избежать проблем с производительностью. Лучше всего определять ``sourceSize`` на основе заданного списка пороговых значений. В приведенном ниже примере изображение image.svg будет показываться в размерах 60 на 60 gu, если основной масштаб больше 70 gu. В других случаях будет формироваться изображение размерами 40 на 40 gu. Настройка порогов значений помогает получить масштабируемые изображения без затрат мощности устройства на рендеринг.

source: Read more about image performance in the `Qt wiki <https://wiki.qt.io/Performance_tip_Images>`__.
ru: Подробнее о работе с изображениями можно узнать в `Qt wiki <https://wiki.qt.io/Performance_tip_Images>`__.

source: Translations
ru: Перевод на другие языки

source: Adding translations to your app makes it more accessible to international users. `Clickable <http://clickable.bhdouglass.com/>`__ will handle this process automatically, extracting new translatable strings into a pot file (the source strings of your app, to be translated).
ru: Перевод на другие языки сделает приложение доступным множеству пользователей из других стран. `Clickable <http://clickable.bhdouglass.com/>`__ может автоматически переносить непереведённые строки в файл .pot (в нём содержатся строки для перевода).

source: Marking a string to be translatable can be achieved like this i18n.tr(string). For example:
ru: Отметить строку для перевода можно так: i18n.tr (string). Например:

source: More information and options can be found in this a bit outdated `tutorial on localization <http://web.archive.org/web/https://docs.ubuntu.com/phone/en/apps/qml/tutorials-internationalizing-your-app>`__ an app.
ru: Подробную информацию и примеры можно найти в немного устаревшем `руководстве по локализации <http://web.archive.org/web/https://docs.ubuntu.com/phone/en/apps/qml/tutorials-internationalizing-your-app>`__ приложений.
