Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/index.po
Languages: ca, de, es, gl, ja, nb, nl, pl, sq, zh_hans, zh_hant

source: About
ca: Quant a
de: Über
es: Acerca de
gl: Sobre
ja: UBportsについて
nb: Om
nl: Over
pl: Informacje
sq: Rreth
zh_hans: 关于
zh_hant: 關於

source: User Guide
ca: Guia d'usuari
de: Benutzerhandbuch
es: Guía de usuario
gl: Guía de usuario
ja: ユーザーガイド
nb: Brukerhåndbok
nl: Handleiding
pl: Podręcznik użytkownika
sq: Libri i përdoruesit
zh_hans: 用户指南
zh_hant: 用戶指南

source: Contribute
ca: Contribuïu
de: Mitwirken
es: Contribuir
gl: Contribuír
ja: 貢献する
nb: Bidra
nl: Bijdragen
pl: Wnieś wkład
sq: Marr pjesë
zh_hans: 贡献
zh_hant: 貢獻

source: Development
ca: Desenvolupament
de: Entwicklung
gl: Desenvolvedor
ja: 開発する
nb: Utvikling
nl: Ontwikkeling
pl: Rozwój
zh_hans: 开发
zh_hant: 發展

source: Porting
ca: Adaptació
de: Portierung
es: Portar
gl: Adaptación
ja: ポーティング
nb: Portering
nl: Porteren
pl: Portowanie
sq: Portimi
zh_hans: 移植
zh_hant: 移植

source: Click Packages
ca: Paquets click
de: Click Pakete
gl: Paquetes click
ja: Click パッケージ
nb: Klikk-Pakker
nl: Click-pakketten
pl: Pakiety Click
zh_hans: Click软件包
zh_hant: Click 套件

source: Clickable
de: Anklickbar
nb: Klikkbar

source: Platform
ca: Plataforma
de: Plattform
es: Plataforma
gl: Plataforma
ja: プラットフォーム
nb: Plattform
pl: Platforma
sq: Platforma
zh_hans: 平台
zh_hant: 平臺

source: Welcome to the UBports documentation!
ca: Us donem la benvinguda a la documentació de l'UBports!
de: Willkommen in der UBports Dokumentation!
es: ¡Bienvenido/a a la documentación de UBports!
gl: Dámosche a benvida á documentación de UBports!
ja: UBportsドキュメントへようこそ！
nb: Velkommen til UBports dokumentasjon!
nl: Welkom in de UBports-documentatie!
pl: Witamy w dokumentacji UBports!
sq: Mirë se vini në dokumentacionin e UBports!
zh_hans: 欢迎来到 UBports 文档！
zh_hant: 歡迎來到 UBports 文檔!

source: Welcome to the official documentation of the UBports project!
ca: Us donem la benvinguda a la documentació oficial del projecte UBports!
de: Willkommen in der offiziellen Dokumentation des UBports Projekts!
es: ¡Bienvenido/a a la documentación oficial del proyecto UBports!
gl: Dámosche a benvida á documentación oficial do proxecto UBports!
ja: UBportsプロジェクトの公式ドキュメントへようこそ！
nb: Velkommen til den offisielle dokumentasjonen for UBports-prosjektet!
nl: Welkom in de officiële documentatie van het UBports-project!
pl: Witamy w oficjalnej dokumentacji projektu UBports!
sq: Mirë se vini në dokumentacionin zyrtar të projektit UBports!
zh_hans: 欢迎来到 UBports 项目的官方文档！
zh_hant: 歡迎來到 UBports 專案的正式文檔!

source: UBports develops the mobile phone operating system Ubuntu Touch. Ubuntu Touch is a mobile operating system focused on ease of use, privacy, and convergence.
ca: L'UBports desenvolupa el sistema operatiu Ubuntu Touch per a telèfons mòbils. L'Ubuntu Touch és un sistema operatiu mòbil enfocat a la facilitat d'ús, la privacitat i la convergència.
de: UBports entwickelt das Betriebssystem Ubuntu Touch für Mobiltelefone. Ubuntu Touch ist ein mobiles Betriebssystem, mit dem Fokus auf Benutzerfreundlichkeit, Datenschutz und Konvergenz.
es: UBports desarrolla el sistema operativo Ubuntu Touch para teléfonos móviles. Ubuntu Touch es un sistema operativo móvil centrado en la facilidad de uso, privacidad y convergencia.
gl: UBports desenvolve o sistema operativo móbil Ubuntu Touch. Ubuntu Touch é un sistema operativo móbil focalizado na facilidade de uso, privacidade e converxencia.
ja: UBportsは携帯電話向けOSのUbuntu Touchを開発しています。Ubuntu Touchは使いやすさ、プライバシー、マルチプラットフォーム性に注力したモバイルOSです。
nb: UBports utvikler mobiltelefonoperativsystemet Ubuntu Touch. Ubuntu Touch er et mobiloperativsystem som er fokusert på brukervennlighet, personvern og konvergens.
nl: UBports ontwikkelt het mobiele besturingssysteem ‘Ubuntu Touch’. Ubuntu Touch is gefocust op eenvound, privacy en eenheid.
pl: UBports rozwija system operacyjny Ubuntu Touch . Ubuntu Touch to mobilny system operacyjny na telefony komórkowe, który skupia się na prostocie użytkowania, prywatności i konwergencji.
sq: UBports zhvillon sistemin operativ të telefonit celular Ubuntu Touch. Ubuntu Touch është një sistem operativ celular i fokusuar në lehtësinë e përdorimit, privatësisë dhe konvergjencës.
zh_hans: UBports 开发了 Ubuntu Touch 手机操作系统。Ubuntu Touch 是一款专注于易用性，隐私性和融合性的移动操作系统。
zh_hant: UBports 開發的手機作業系統 Ubuntu Touch。Ubuntu Touch 是一個專注於易用性、隱私性和融合性的移動作業系統。

source: On this website you find guides to :doc:`install Ubuntu Touch on your mobile phone <userguide/install>`, :doc:`use Ubuntu Touch <userguide/dailyuse/index>`, :doc:`develop Ubuntu Touch apps <appdev/index>`, :doc:`port Ubuntu Touch to an Android handset <porting/introduction/index>` and :doc:`learn more about system components <systemdev/index>`. If this is your first time here, please consider reading our :doc:`introduction <about/introduction>`.
nb: På denne siden finner du veiledninger for :doc:`installasjon av Ubuntu Touch på enheten din<userguide/install>`, :doc:`use Ubuntu Touch <userguide/dailyuse/index>`, :doc:`utvikling av Ubuntu Touch-programmer <appdev/index>`, :doc:`tilpasning av Ubuntu Touch til en Android-enhet <porting/introduction/index>` og :doc:`lær mer om systemkomponenter <systemdev/index>`.Hvis du er her for første gang bær du lese :doc:`introduksjonen <about/introduction>`.
zh_hans: 在这里你可以找到这些教程：:doc:`将 Ubuntu Touch 安装到手机上 <userguide/install>`，:doc:`使用 Ubuntu Touch <userguide/dailyuse/index>`，:doc:`开发 Ubuntu Touch 应用 <appdev/index>`，:doc:`将 Ubuntu Touch 移植到 Android 手机 <porting/introduction/index>` 以及 :doc:`了解系统级开发 <systemdev/index>`。如果这是你第一次来这里，可以考虑阅读 :doc:`简介 <about/introduction>`.

source: If you want to help improving this documentation, :doc:`the Documentation contribute page <contribute/documentation>` will get you started.
ca: Si voleu ajudar a millorar la documentació, :doc:`la pàgina de contribució a la documentació <contribute/documentation>` us ajudarà a començar.
de: Wenn Sie uns helfen wollen, diese Dokumentation zu verbessern, gibt die Seite :doc:`zur Dokumentation beitragen <contribute/documentation>` einen guten Einstieg.
es: Si quiere ayudar a mejorar esta documentación, :doc:`la página de contribuir a la documentación <contribute/documentation>` le ayudará a empezar.
gl: Se quere axudar a mellorar a documentación, :doc:`a páxina de contribución á documentación <contribute/documentation>` axudaravos a comezar.
ja: このドキュメントの改善を支援したい場合は、:doc: `ドキュメントへの貢献ページ<contribute/documentation>`から始められます。
nb: Hvis du vil hjelpe deg med å forbedre denne dokumentasjonen, vil: doc: `Dokumentasjonsbidragssiden <contribute /documentation>` komme i gang.
nl: Als je wilt helpen deze documentatie te verbeteren, kijk dan op de pagina :doc:`bijdragen aan de documentatie <contribute/documentation>`.
pl: Jeśli chcesz pomóc w ulepszeniu tej dokumentacji, :doc:`Strona tworzenia dokumentacji <contribute/documentation>` pomoże ci zacząć.
sq: Nëse dëshironi të ndihmoni në përmirësimin e këtij dokumentacioni, :doc:`faqja e kontributit të Dokumentacionit<kontribuon/dokumentacionin>` do t'ju fillojë.
zh_hans: 如果您想要协助我们改进本文档，:doc:`文档贡献页面 <contribute/documentation>` 将会帮助你开始。
zh_hant: 如果您想幫助改進本文檔，請閱讀 :doc:`the Documentation contribute page <contribute/documentation>` 將幫助您開始。

source: You may view this documentation in the following languages:
ca: Podeu veure aquesta documentació en les llengües següents:
de: Sie können diese Dokumentation in den folgenden Sprachen anzeigen lassen:
es: Puede leer esta documentación en los siguientes idiomas:
gl: Pode ver esta documentación nas seguintes linguas:
ja: このドキュメントは、以下の言語でご覧いただけます。
nb: Du kan se denne dokumentasjonen på følgende språk:
nl: Je kunt deze dokumentatie bekijken in de volgende talen:
pl: Możesz przeglądać tę dokumentację w następujących językach:
sq: Ju mund ta shihni këtë dokumentacion në gjuhët e mëposhtme:
zh_hans: 您可以使用以下语言查看此文档：
zh_hant: 您可以使用以下語言查看這個文檔:

source: `English <https://docs.ubports.com/en/latest/>`_
ca: `Anglès <https://docs.ubports.com/en/latest/>`_
gl: `Inglés <https://docs.ubports.com/en/latest/>`_
ja: `英語 (English) <https://docs.ubports.com/en/latest/>`_
nb: `Engelsk <https://docs.ubports.com/en/latest/>`_
nl: `Engels <https://docs.ubports.com/en/latest/>`_
pl: `Angielski <https://docs.ubports.com/en/latest/>`_
sq: `Anglisht <https://docs.ubports.com/en/latest/>` _
zh_hans: `英语（English） <https://docs.ubports.com/en/latest/>`_
zh_hant: "English (英語) <https://docs.ubports.com/en/latest/>"_

source: `Català <https://docs.ubports.com/ca/latest/>`_
gl: `Catalán <https://docs.ubports.com/ca/latest/>`_
ja: `カタロニア語 (Català) <https://docs.ubports.com/ca/latest/>`_
nb: `Katalansk <https://docs.ubports.com/ca/latest/>`_
nl: `Catalaans <https://docs.ubports.com/ca/latest/>`_
pl: `Kataloński <https://docs.ubports.com/ca/latest/>`_
sq: `Katalonje <https://docs.ubports.com/en/latest/>` _
zh_hans: `加泰罗尼亚语（Català） <https://docs.ubports.com/ca/latest/>`_
zh_hant: "Català (加泰隆尼亞語) <https://docs.ubports.com/ca/latest/>"_

source: `Français <https://docs.ubports.com/fr/latest/>`_
ca: `Francès <https://docs.ubports.com/fr/latest/>`_
gl: `Francés <https://docs.ubports.com/fr/latest/>`_
ja: `フランス語 (Français) <https://docs.ubports.com/fr/latest/>`_
nb: `Fransk <https://docs.ubports.com/fr/latest/>`_
nl: `Frans <https://docs.ubports.com/fr/latest/>`_
pl: `Francuski <https://docs.ubports.com/fr/latest/>`_
sq: `Frëngjisht <https://docs.ubports.com/fr/latest/>` _
zh_hans: `法语（Français） <https://docs.ubports.com/fr/latest/>`_
zh_hant: "Français (法語) <https://docs.ubports.com/fr/latest/>"_

source: `Deutsch <https://docs.ubports.com/de/latest/>`_
ca: `Alemany <https://docs.ubports.com/de/latest/>`_
gl: `Alemán <https://docs.ubports.com/de/latest/>`_
ja: `ドイツ語 (Deutsch) <https://docs.ubports.com/de/latest/>`_
nb: `Tysk <https://docs.ubports.com/de/latest/>`_
nl: `Duits <https://docs.ubports.com/de/latest/>`_
pl: `Niemiecki <https://docs.ubports.com/de/latest/>`_
sq: `Gjermanisht <https://docs.ubports.com/en/latest/>` _
zh_hans: `德语（Deutsch） <https://docs.ubports.com/de/latest/>`_
zh_hant: "Deutsch (德語) <https://docs.ubports.com/de/latest/>"_

source: `Italiano <https://docs.ubports.com/it/latest/>`_
ja: `イタリア語 (Italiano) <https://docs.ubports.com/it/latest/>`_
nb: `Italiensk <https://docs.ubports.com/it/latest/>`_
nl: `Italiaans <https://docs.ubports.com/it/latest/>`_
pl: `Włoski <https://docs.ubports.com/it/latest/>`_
sq: `Italisht <https://docs.ubports.com/it/latest/>` _
zh_hans: `意大利语（Italiano） <https://docs.ubports.com/it/latest/>`_
zh_hant: "Italiano (義大利語) <https://docs.ubports.com/it/latest/>"_

source: `Română <https://docs.ubports.com/ro/latest/>`_
ca: `Romanès <https://docs.ubports.com/ro/latest/>`_
gl: `Romano <https://docs.ubports.com/ro/latest/>`_
ja: `ルーマニア語 (Română) <https://docs.ubports.com/ro/latest/>`_
nb: `Romansk <https://docs.ubports.com/ro/latest/>`_
nl: `Romaans <https://docs.ubports.com/ro/latest/>`_
pl: `Rumuński <https://docs.ubports.com/ro/latest/>`_
sq: `Rumanisht <https://docs.ubports.com/ro/latest/>`_
zh_hans: `罗马尼亚语（Română） <https://docs.ubports.com/ro/latest/>`_
zh_hant: "Română (羅馬尼亞語) <https://docs.ubports.com/ro/latest/>"_

source: `Русский <https://docs.ubports.com/ru/latest>`_
gl: `Ruso <https://docs.ubports.com/ru/latest>`_
ja: `ロシア語 (Русский) <https://docs.ubports.com/ru/latest>`_
nb: `Russisk <https://docs.ubports.com/ru/latest>`_
nl: `Russisch <https://docs.ubports.com/ru/latest>`_
pl: `Rosyjki <https://docs.ubports.com/ru/latest>`_
zh_hans: `俄语（Русский ） <https://docs.ubports.com/ru/latest>`_
zh_hant: "Русский (俄語) <https://docs.ubports.com/ru/latest>"_

source: `Türkçe <https://docs.ubports.com/tr/latest/>`_
ca: `Turc <https://docs.ubports.com/tr/latest/>`_
gl: `Turco <https://docs.ubports.com/tr/latest/>`_
ja: `トルコ語 (Türkçe) <https://docs.ubports.com/tr/latest/>`_
nb: `Tyrkisk <https://docs.ubports.com/tr/latest/>`_
nl: `Turks <https://docs.ubports.com/tr/latest/>`_
pl: `Turecki <https://docs.ubports.com/tr/latest/>`_
sq: `Turqisht <https://docs.ubports.com/tr/latest/>`_
zh_hans: `土耳其语（Türkçe） <https://docs.ubports.com/tr/latest/>`_
zh_hant: "Türkçe (土耳其語) <https://docs.ubports.com/tr/latest/>"_

source: `Español <https://docs.ubports.com/es/latest/>`_
ca: `Espanyol <https://docs.ubports.com/es/latest/>`_
ja: `スペイン語 (Español) <https://docs.ubports.com/es/latest/>`_
nb: `Spansk <https://docs.ubports.com/es/latest/>`_
nl: `Spaans <https://docs.ubports.com/es/latest/>`_
pl: `Hiszpański <https://docs.ubports.com/es/latest/>`_
sq: `Spanjisht <https://docs.ubports.com/es/latest/>`_
zh_hans: `西班牙语（Español） <https://docs.ubports.com/es/latest/>`_
zh_hant: "Español (西班牙語) <https://docs.ubports.com/es/latest/>"_

source: `Simplified Chinese <https://docs.ubports.com/zh_CN/latest/>`_
de: `Vereinfachtes Chinesisch <https://docs.ubports.com/zh_CN/latest/>`_
gl: `Chinés simplificado <https://docs.ubports.com/zh_CN/latest/>`_
ja: `簡体字中国語 (Simplified Chinese) <https://docs.ubports.com/zh_CN/latest/>`_
nb: `Kinesisk <https://docs.ubports.com/zh_CN/latest/>`_
nl: `Vereenvoudigd Chinees <https://docs.ubports.com/zh_CN/latest/>`_
pl: `Chiński Uproszczony <https://docs.ubports.com/zh_CN/latest/>`_
zh_hans: `中文（Simplified Chinese） <https://docs.ubports.com/zh_CN/latest/>`_
zh_hant: "Simplified Chinese (簡體中文) <https://docs.ubports.com/zh_CN/latest/>"_

source: Ubuntu UI-Toolkit
ca: Caixa d'eines d'interfície d'usuari de l'Ubuntu
de: Ubuntu Benutzeroberflächen-Werkzeug (UI-Toolkit)
gl: Caixa de ferrramentas da interface de usuario de Ubuntu
ja: Ubuntu UI ツールキット
pl: UI-Toolkit Ubuntu
zh_hans: Ubuntu 界面工具
zh_hant: Ubuntu 使用者介面工具

source: On this website you find guides to :doc:`install Ubuntu Touch on your mobile phone <userguide/install>`, :doc:`use Ubuntu Touch <userguide/dailyuse/index>`, :doc:`develop Ubuntu Touch apps <appdev/index>`, :doc:`port Ubuntu Touch to an Android handset <porting/index>` and :doc:`learn more about system components <systemdev/index>`. If this is your first time here, please consider reading our :doc:`introduction <about/introduction>`.
pl: Na tej stronie znajdziesz poradniki jak :doc:`zainstalować Ubuntu Touch na twoim smartfonie <userguide/install>`, :doc:`używać Ubuntu Touch <userguide/dailyuse/index>`, :doc:`napisać aplikacje na Ubuntu Touch <appdev/index>`, :doc:`przeportować Ubuntu Touch na urządzenie z Androidem <porting/index>` i :doc:`nauczysz się więcej o komponentach systemu <systemdev/index>`. Jeśli jesteś tu pierwszy raz, rozważ przeczytanie naszego :doc:`wprowadzenia <about/introduction>`.
zh_hant: 在這個網站上，你會發現到指南 :doc: "安裝 Ubuntu Touch 到您的手機 <userguide/install>"， :doc: "使用 Ubuntu Touch <userguide/dailyuse/index>"， :doc: "開發 Ubuntu Touch 應用程式 <appdev/index>"， :doc: "埠 Ubuntu Touch 到Android手機 <porting/Intro>"和 :doc:"瞭解更多關於系統元件 <systemdev/index>"。如果這是你第一次來這裡，請閱讀我們的 :doc: "介紹 <about/introduction>"。

source: Halium
de: Halium (Portierungsprojekt)

source: On this website you find instructions how to install Ubuntu Touch on your mobile phone, user guides and detailed documentation on all system components. If this is your first time here, please consider reading our :doc:`introduction <about/introduction>`.
es: En este sitio web encontrará instrucciones de como instalar Ubuntu Touch en su teléfono móvil, guías de usuario y documentación detallada de todos los componentes del sistema. Si esta es su primera vez aquí, por favor considere leer nuestra :doc:`presentación <about/introduction>`.

source: App development
es: Desarrollo de aplicaciones
