Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: You now need to delete your entire BUILDDIR/kernel/VENDOR/MODEL/security/apparmor subdirectory and replace it with the one you downloaded. Then rebuild halium-boot.
de: Sie müssen nun Ihr gesamtes Unterverzeichnis BUILDDIR/kernel/VENDOR/MODEL/security/apparmor löschen und es durch das heruntergeladene Verzeichnis ersetzen. Dann bauen Sie halium-boot neu auf.

source: If you get errors when building, you will need to resolve them one by one, modifying your source code as needed. Note that you should only modify the code in the apparmor subdirectory if at all possible. Modifying code elsewhere will more than likely just compound your problems.
de: Wenn Sie beim Erstellen Fehler erhalten, müssen Sie diese nacheinander beheben und den Quellcode nach Bedarf ändern. Beachten Sie, dass Sie nur den Code im apparmor-Unterverzeichnis ändern sollten, wenn dies überhaupt möglich ist. Wenn Sie den Code an anderer Stelle ändern, werden Ihre Probleme höchstwahrscheinlich nur noch größer.

source: Seek help as needed from one of the sources mentioned in section :ref:`Getting-community-help`.
de: Suchen Sie bei Bedarf Hilfe bei einer der in Abschnitt :ref:`Hilfe aus der Gemeinschaft` genannten Quellen.

source: Sound configuration
de: Sound-Konfiguration

source: The supplied touch.pa file located in the /etc/pulse directory of your device needs adjustment. Extract the file and copy it to your 'ubuntu' directory.
de: Die mitgelieferte Datei touch.pa, die sich im Verzeichnis /etc/pulse auf Ihrem Gerät befindet, muss angepasst werden. Entpacken Sie die Datei und kopieren Sie sie in Ihr 'ubuntu'-Verzeichnis.

source: Locate the line::
de: Lokalisieren Sie die Zeile::

source: and replace it with this::
de: und ersetzen Sie sie durch diese::

source: At the end of the file, append this::
de: Am Ende der Datei fügen Sie Folgendes an::

source: Now complete steps 3 and 4, taking care to remember the note on how to :ref:`Rebuild-system.img`.
de: Führen Sie nun die Schritte 3 und 4 aus und denken Sie dabei an den Hinweis, wie Sie :ref:`Rebuild-system.img` erstellen.

source: Further configuration
de: Weitere Konfiguration
zh_hans: 进一步设置

source: For the time being, refer to the `porting faq <https://pad.ubports.com/p/porting-faq>`_ and `porting check list <https://pad.ubports.com/p/PortChecklist>`_.
de: In der Zwischenzeit können Sie sich auf die `Porting FAQ <https://pad.ubports.com/p/porting-faq>`_ und die `Porting Checkliste <https://pad.ubports.com/p/PortChecklist>`_ beziehen.

source: Installing
de: Installation
zh_hans: 安装

source: In order to install Ubuntu Touch, you will need a recovery with Busybox, such as TWRP, installed on your phone. If you have not done so yet, refer to section :ref:`Install-TWRP-recovery` and install it now.
de: Um Ubuntu Touch zu installieren, müssen Sie eine Wiederherstellung mit Busybox, wie z. B. TWRP, auf Ihrem Telefon installieren. Wenn Sie dies noch nicht getan haben, lesen Sie den Abschnitt :ref:`Install-TWRP-recovery` und installieren Sie es jetzt.
zh_hans: 为了安装Ubuntu Touch，你需要在你的手机上安装一个带有Busybox的恢复程序，例如TWRP。如果你还没有这样做，请参考 :ref:`Install-TWRP-recovery` 一节，现在就安装它。

source: You will also need to ensure the ``/data`` partition is formatted with ``ext4`` and does not have any encryption on it. Boot into the recovery image you just installed, check and adjust as necessary.
de: Sie müssen auch sicherstellen, dass die ``/data``-Partition mit ``ext4`` formatiert ist und keine Verschlüsselung enthält. Booten Sie in das soeben installierte Wiederherstellungsimage, überprüfen Sie es und passen Sie es bei Bedarf an.

source: If you have trouble accessing your device in fastboot mode, but are able to access it in TWRP recovery mode using adb, then boot into recovery mode and try the following alternative method::
de: Wenn Sie Probleme haben, auf Ihr Gerät im Fastboot-Modus zuzugreifen, aber in der Lage sind, im TWRP-Wiederherstellungsmodus mit adb darauf zuzugreifen, dann booten Sie in den Wiederherstellungsmodus und versuchen Sie die folgende alternative Methode::

source: On your device, choose *Install* in the TWRP menu, navigate to the sdcard directory, choose *Image*, select your image file, select *Boot* and swipe to flash.
de: Wählen Sie auf Ihrem Gerät *Installieren* im TWRP-Menü, navigieren Sie zum Verzeichnis sdcard, wählen Sie *Image*, wählen Sie Ihre Image-Datei, wählen Sie *Boot* und ziehen Sie zum Flashen.

source: Samsung devices: Flashing halium-boot.img on Samsung devices is done using the Heimdall flashing utility (on Linux) or the Odin utility (on Windows) after first bringing the device into 'download mode'. See more information on these utilities `here <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>`_. Follow the instructions for the utility you choose, including the specific flashing command for flashing the boot partition. Install system.img and rootfs (below) with the device in recovery mode.
de: Samsung-Geräte: Das Flashen von halium-boot.img auf Samsung-Geräten erfolgt mit dem Heimdall-Flash-Dienstprogramm (unter Linux) oder dem Odin-Dienstprogramm (unter Windows), nachdem das Gerät zunächst in den 'Download-Modus' gebracht wurde. Weitere Informationen zu diesen Dienstprogrammen finden Sie hier <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>`_. Befolgen Sie die Anweisungen für das von Ihnen gewählte Dienstprogramm, einschließlich des spezifischen Flash-Befehls zum Flashen der Boot-Partition. Installieren Sie system.img und rootfs (unten), während sich das Gerät im Wiederherstellungsmodus befindet.
zh_hans: 三星设备。在三星设备上刷入 halium-boot.img 是使用 Heimdall flashing utility（在Linux上）或Odin utility（在Windows上），首先将设备进入 "下载模式"。关于这些工具的更多信息请见`here <http://docs.halium.org/en/latest/porting/install-build/reference-rootfs.html#install-hybris-boot-img-on-samsung-devices>`_。按照你所选择的工具的说明，包括刷写启动分区的具体刷写命令。在设备处于恢复模式下安装 system.img 和 rootfs（如下）。

source: Install system.img and rootfs
de: system.img und rootfs installieren
es: Instalación de system.img y rootfs
it: Installa system.img e rootfs
zh_hans: 安装 system.img 和 rootfs 文件系统
zh_hant: 安裝 system.img 和 rootfs

source: Next you need to download the appropriate rootfs for your device. At the moment there are two available versions, a 32 bit and a 64 bit one.
de: Als Nächstes müssen Sie das entsprechende Rootfs für Ihr Gerät herunterladen. Zurzeit gibt es zwei Versionen, eine 32-Bit- und eine 64-Bit-Version.
zh_hans: 接下来你需要为你的设备下载合适的rootfs。目前，有两个可用的版本，一个是32位，一个是64位。

source: Simply download ``ubports-touch.rootfs-xenial-armhf.tar.gz`` (32 bit) from `our CI server <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__.
de: Laden Sie einfach ``ubports-touch.rootfs-xenial-armhf.tar.gz`` (32 bit) von `unserem CI-Server <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__ herunter.
zh_hans: 只需从`我们的CI服务器<https://ci.ubports.com/job/xenial-rootfs-armhf/>`__下载 `ubports-touch.rootfs-xenial-armhf.tar.gz`（32位）。

source: If you have a 64-bit ARM (aarch64) device, this same rootfs should work for you. You can also try the 64 bit version keeping in mind that you may possibly run into more issues with this owing to the current state of development of this rootfs. (If you have an x86 device, let us know. There is no rootfs available for these yet.)
de: Wenn Sie ein 64-Bit-ARM-Gerät (aarch64) haben, sollte das gleiche rootfs für Sie funktionieren. Sie können auch die 64-Bit-Version ausprobieren, wobei Sie bedenken sollten, dass Sie aufgrund des aktuellen Entwicklungsstandes dieses rootfs möglicherweise auf mehr Probleme stoßen könnten. (Wenn Sie ein x86-Gerät haben, lassen Sie es uns wissen. Für diese gibt es noch kein rootfs)
zh_hans: 如果你有一个 64 位的 ARM（arch64）设备，这个rootfs应该同样对你有用。你也可以尝试64位版本，但要记住，由于这个rootfs 目前的发展状况，你可能会遇到更多的问题。目前还没有适用于这些设备的 rootfs）

source: Clone or download the `halium-install repository <https://gitlab.com/JBBgameich/halium-install>`_. This repository contains tools that can be used to install a Halium system image and distribution rootfs. Reboot your device to recovery (e.g. TWRP), to get adb access again. Now use the ``halium-install`` script to install Ubuntu Touch on your device::
de: Klonen oder laden Sie das `halium-install repository <https://gitlab.com/JBBgameich/halium-install>`_ herunter. Dieses Repository enthält Werkzeuge, die zur Installation eines Halium-Systemabbilds und Distributions-Rootfs verwendet werden können. Starten Sie Ihr Gerät im Recovery-Modus (z.B. TWRP) neu, um wieder adb-Zugriff zu erhalten. Verwenden Sie nun das Skript ``halium-install``, um Ubuntu Touch auf Ihrem Gerät zu installieren::
zh_hans: 克隆或下载 `halium-install 软件仓库<https://gitlab.com/JBBgameich/halium-install>`_。这个软件仓库包含了一些工具，可以用来安装 Halium 系统镜像和分发 rootfs。重新启动你的设备到恢复状态（如 TWRP），以再次获得 adb 权限。现在使用 ``halium-install`` 脚本在你的设备上安装 Ubuntu Touch：

source: Get SSH access
de: SSH-Zugriff erlangen
es: Obtener acceso SSH
it: Ottenere l'accesso SSH
zh_hans: 获得 SSH 访问权限
zh_hant: 獲得 SSH 存取權限

source: The password will be the one that you set while running halium-install.
de: Das Passwort ist dasjenige, das Sie während der Ausführung von halium-install festgelegt hast.
es: La contraseña será la que estableció cuando estaba ejecutando «halium-install».
zh_hans: 密码将是您在运行 halium-install 时设置的密码。
zh_hant: 密碼將是您在執行 halium-install 時設置的密碼。

source: Troubleshooting initial boot
de: Fehlersuche beim ersten Start
zh_hans: 初次启动时的故障排除

source: Refer to :ref:`Known-issues-with-initial-boot`.
de: Siehe :ref:`Known-issues-with-initial-boot`.
zh_hans: 参考 :ref:`Known-issues-with-initial-boot`。

source: Reference material
de: Referenzmaterial
zh_hans: 参考材料

source: Display settings
de: Anzeigeeinstellungen
es: Configuración de pantalla
it: Impostazioni schermo
zh_hans: 显示设置
zh_hant: 顯示器設定

source: ``GRID_UNIT_PX`` (Pixels per Grid Unit or Px/GU) is specific to each device. Its goal is to make the user interface of the system and its applications the same *perceived* size regardless of the device they are displayed on. It is primarily dependent on the pixel density of the device’s screen and the distance to the screen the user is at. The latter value cannot be automatically detected and is based on heuristics. We assume that tablets and laptops are the same distance and that they are held at 1.235 times the distance phones tend to be held at.
de: ``GRID_UNIT_PX`` (Pixel pro Gittereinheit oder Px/GU) ist gerätespezifisch. Das Ziel ist, dass das Systems und die Anwendungen vom Nutzer immer gleich *wahrgenommen* werden, unabhängig vom Gerät, auf dem sie angezeigt werden. Dies hängt in erster Linie von der Pixeldichte des Gerätebildschirms und des Abstands des Geräts vom Nutzer ab. Letzteres kann nicht automatisch ermittelt werden und basiert auf Heuristiken. Man nimmt an, dass Tablets und Klapprechner den gleichen Nutzerabstand haben und dass sie üblicherweise 1,235 mal weiter als Telefone gehalten werden.
es: ``GRID_UNIT_PX`` (píxeles por unidad de cuadrícula o «Px/GU») es específico para cada dispositivo. Su meta es hacer que la interfaz de usuario del sistema y sus aplicaciones se *perciban* del mismo tamaño independientemente del dispositivo en que se estén mostrando. Depende principalmente de la densidad de píxeles de la pantalla del dispositivo y de la distancia a la pantalla a la que esté el usuario. El último valor no se puede detectar automáticamente y se basa en la heurística. Asumimos la misma distancia para tabletas y portátiles y que están sostenidos a 1,235 veces la distancia a la que se suelen sostener los teléfonos.
it: `` GRID_UNIT_PX`` (Pixel per Grid Unit o Px / GU) è specifico per ogni dispositivo. Il suo obiettivo è quello di rendere l'interfaccia utente del sistema e delle sue applicazioni della stessa dimensione * percepita *, indipendentemente dal dispositivo su cui sono visualizzate. Dipende principalmente dalla densità dei pixel dello schermo del dispositivo e dalla distanza dello schermo dall'utente. Quest'ultimo valore non può essere rilevato automaticamente e si basa sull'euristica. Supponiamo che tablet e laptop siano alla stessa distanza e che siano tenuti a 1.235 volte la distanza a cui i telefoni tendono ad essere tenuti.
zh_hans: ``GRID_UNIT_PX`` (Pixels per Grid Unit or Px/GU)用于每个设备。目标是使系统用户界面和应用具有一致的“感官”大小，而不管它们显示在什么设备上。它主要取决于设备屏幕的像素密度和用户到屏幕的距离。后一个值不能自动检测，它是基于启发式的。我们假设平板电脑和笔记本电脑的距离是一样的，它们的距离是手机的1.235倍。
zh_hant: "GRID_UNIT_PX" （每網格單位像素數或Px / GU）特定於每個設備。 它的目標是使系統及其應用程式的用戶界面與 *感知* 大小相同，而不管它們顯示在哪個設備上。 它主要取決於設備屏幕的像素密度以及用戶所在屏幕的距離。 後一個值不能自動檢測，並且基於啟發程式。 我們假設平板電腦和筆記本電腦的距離是相同的，並且它們的容量是手機通常距離的 1.235 倍。

source: ``QTWEBKIT_DPR`` sets the display scaling for the Oxide web engine, so changes to this value will affect the scale of the browser and webapps.
de: ``QTWEBKIT_DPR`` legt die Anzeigeskalierung für die Oxide-Webengine fest. Dieser Wert beeinflusst die Skalierung im Browser und in Webapps.
es: ``QTWEBKIT_DPR`` configura la escala de la pantalla para el motor web Oxide, así que los cambios a este valor afectarán a la escala del navegador y de las aplicaciones web.
it: `` QTWEBKIT DPR`` imposta il ridimensionamento dello schermo per il motore web Oxide, pertanto le modifiche a questo valore influiranno sulla scala del browser e delle webapps.
zh_hans: ``QTWEBKIT_DPR``设置Oxide网页引擎的显示尺寸，本值的改变将影响浏览器和web应用的尺寸。
zh_hant: "QTWEBKIT_DPR" 設置 Oxide Web 引擎的顯示比例，因此更改此值將影響瀏覽器和 webapps 的比例。

source: A reference device has been chosen from which we derive the values for all other devices. The reference device is a laptop with a 120ppi screen. However, there is no exact formula since these options are set for *perceived* size rather than *physical* size. Here are some values for other devices so you may derive the correct one for yours:
de: Es wurde ein Referenzgerät ausgewählt, aus dem wir die Werte für alle anderen Geräte ableiten. Das Referenzgerät ist ein Laptop mit einem 120ppi Bildschirm. Es gibt jedoch keine genaue Formel, da diese Optionen auf *wahrgenommene* Größe und nicht auf *physische* Größe eingestellt sind. Hier sind einige Werte für andere Geräte, so dass Sie die richtigen für Ihre Geräte ableiten können:
es: Un dispositivo de referencia ha sido elegido y del cuál derivamos los valores para todos los otros dispositivos. El dispositivo de referencia es un portátil con una pantalla de 120ppi. Sin embargo, no existe una fórmula exacta ya que estas opciones se configuran para un tamaño *percibido* mas que un tamaño *físico*. Aquí tiene algunos valores para otros dispositivos para que pueda derivar el correcto para el suyo:
zh_hans: 选择了一个参考设备，可从中得出所有其他设备的值。参考设备是一个120ppi屏幕的手持电脑。但是，由于这些选项是针对*感知*大小而不是*物理*大小设置的，因此没有确切的公式。 以下是其他设备的一些值，因此你可以为自己的设备得出正确的值：
zh_hant: 我們已經選擇了一個參考裝置，我們從中推導出所有其他裝置的值。 參考裝置是具有 120 ppi 螢幕的筆記型電腦。 但是，沒有確切的公式，因為這些選項設置為 *感知* 大小而不是 *物理* 大小。 以下是其他裝置的一些值，因此您可以為您的派生出正確的值：

source: Device
de: Gerät
es: Dispositivo
it: Dispositivo
zh_hans: 设备
zh_hant: 裝置

source: Resolution
de: Auflösung
es: Resolución
it: Risoluzione
zh_hans: 分辨率
zh_hant: 解析度

source: Display Size
de: Bildschirmgröße
es: Tamaño de pantalla
it: Grandezza dello schermo
zh_hans: 显示大小
zh_hant: 顯示器尺寸

source: 'Normal' density laptop
de: 'Normale' Dichte Klapprechner
es: Portátil con densidad «normal»
it: Laptop a densità 'normale'
zh_hans: “正常”屏幕像素密度的笔记本电脑
zh_hant: "普通畫質" 筆記型電腦

source: N/A
de: Nicht verfügbar
es: N/D
it: N/D

source: 'High' density laptop
de: 'Hohe' Dichte Klapprechner
es: Portátil con densidad «alta»
it: Laptop a densità 'alta'
zh_hans: 高密度笔记本
zh_hant: "高畫質" 筆記型電腦

source: Experiment with a few values to find one that feels good when compared to the Ubuntu Touch experience on other devices. If you are unsure of which is the best, share some pictures (including some object for scale) along with the device specs with us.
de: Am besten experimentiert man etwas mit den Werten, um herauszufinden, welche sich gut anfühlen, verglichen mit dem Nutzererlebnis auf anderen Geräten. Ist man sich unsicher, was am besten ist, kann man den UBports-Entwicklern Bilder schicken, auf denen Vergleichsobjekte zu sehen sind.
es: Experimente con algunos valores hasta encontrar uno con el que se sienta bien comparado con la experiencia de Ubuntu Touch en otros dispositivos. Si no está seguro de cuál es el mejor, comparta con nosotros algunas fotografías (incluyendo algún objeto como escala) así como las especificaciones del dispositivo.
it: Sperimenta con alcuni valori per trovare quello che meglio si adatta se confrontato con l'esperienza di Ubuntu Touch su altri dispositivi. Se non sei sicuro di quale sia il migliore, condividi con noi alcune immagini (compresi alcuni oggetti per la scala) insieme alle specifiche del dispositivo.
zh_hant: 嘗試使用一些值來找到與其他裝置上的 Ubuntu Touch 體驗相比感覺良好的值。 如果您不確定哪個是最好的，請與我們共享一些圖片（包括一些用於比例的對象）以及裝置規格。

source: There are two other settings that may be of interest to you:
de: Es gibt zwei weitere Einstellungen, die interessant sein können:

source: Form factor
de: Formfaktor
es: Factor de forma
it: Fattore di forma
zh_hant: 外形規格

source: Native orientation
de: Native Orientierung

source: ``NATIVE_ORIENTATION`` sets the display orientation for the device's built-in screen. This value is used whenever autorotation isn't working correctly or when an app wishes to be locked to the device's native orientation. Acceptable values are ``landscape``, which is normally used for tablets, laptops, and desktops; and ``portrait``, which is usually used for phone handsets.
de: ``NATIVE_ORIENTATION`` legt die Bildschirmorientierung für den eingebauten Bildschirm fest. Dieser Wert wird genutzt, wenn die automatische Drehung nicht richtig funktioniert oder wenn Apps die Orientierung auf die native Orientierung festlegen wollen. Akzeptable Werte sind ``landscape``, welches für gewöhnlich für Tablets, Klapprechner und Desktops, und ``portrait``, welches für gewöhnlich für Telefone verwendet wird.
es: ``NATIVE_ORIENTATION`` configura la orientación de la pantalla incorporada en el dispositivo. Este valor se usa siempre que la rotación automática no esté funcionando correctamente o cuando una aplicación desea estar bloqueada en la orientación nativa del dispositivo. Valores aceptables son ``landscape`` (horizontal), que se usa normalmente para tabletas, portátiles y ordenadores de escritorio; y ``portrait`` (vertical), que se usa generalmente en teléfonos móviles.
it: ``NATIVE_ORIENTATION` configura l'orientazione del dispositivo per il suo schermoil. Tale valore usato qualora non funzionasse correttamente l'autorotazione o quando una applicazione desidera bloccare l'orienzazione nativa del dispositivo. Valori accettabili sono ``orizzontale``, che è usato normalmente per tabla, computer portatili e da tavolo; ``verticale``, per apparecchi cellulari.
zh_hant: "NATIVE_ORIENTATION" 設置裝置內置屏幕的顯示方向。 無論何時自動旋轉不正常或應用程序希望鎖定到設備的本機方向，都會使用此值。可接受的值是 “landscape”，通常用於平板電腦、筆記型電腦和桌上型電腦，和 "portrait"，通常適用於手機。

source: The graphical UI
de: Die grafische Benutzeroberfläche

source: Bring up Unity 8 (the graphical UI)
de: Starten Sie Unity 8 (die grafische Benutzeroberfläche)

source: Now that you're logged in, there remain a number of things to be configured before Ubuntu Touch will be fully functional on your device. The correct way to do this is by storing these settings in overlay files (:ref:`Overlay-files`), and not by making the root directory writeable, as described below. However, in order to quickly set up udev rules which are necessary to complete subsequent steps, you can use this method for first time setup.
de: Nachdem Sie sich nun angemeldet haben, müssen Sie noch einige Dinge konfigurieren, bevor Ubuntu Touch auf Ihrem Gerät voll funktionsfähig ist. Der korrekte Weg, dies zu tun, besteht darin, diese Einstellungen in Overlay-Dateien (:ref:`Overlay-files`) zu speichern, und nicht darin, das Root-Verzeichnis beschreibbar zu machen, wie unten beschrieben. Um jedoch schnell udev-Regeln einzurichten, die für die nachfolgenden Schritte notwendig sind, können Sie diese Methode für die Ersteinrichtung verwenden.

source: Make / writable
de: / beschreibbar machen
es: Hacer / editable
zh_hans: 让 / （根目录）可写
zh_hant: 製作 / 寫入

source: Add udev rules
de: udev-Regeln hinzufügen
es: Añadir reglas udev
it: Aggiungi le regole di udev
zh_hans: 添加 udev 规则
zh_hant: 添加 udev 規則

source: You must create some udev rules to allow Ubuntu Touch software to access your hardware. Run the following command, replacing [codename] with your device's codename::
de: Sie müssen einige udev-Regeln erstellen, damit die Ubuntu Touch-Software auf Ihre Hardware zugreifen kann. Führen Sie den folgenden Befehl aus und ersetzen Sie [Codename] durch den Codenamen Ihres Geräts::
es: Debe crear algunas reglas de udev para permitir al software de Ubuntu Touch acceso a su hardware. Ejecute la siguiente orden, sustituyendo «[codename]» ([nombre en código]) por el nombre en código de su dispositivo::
zh_hans: 你必须创建一些udev规则以允许Ubuntu Touch软件访问你的硬件。运行以下命令，替换[codename]为你设备的codename::
zh_hant: 您必須建立一些 udev 規則以允許 Ubuntu Touch 軟體存取您的硬體。 執行以下命令，將 [codename] 替換為您設備的代號::

source: Now, reboot the device. If all has gone well, you will eventually see the Ubuntu Touch spinner followed by Unity 8. Your lock password is the same as you set for SSH.
de: Nach einem Neustart, falls alles gut gegangen ist, sieht man hoffentlich die Ubuntu Touch Ladeanimation und dann Unity 8. Das Sperrpasswort ist dasselbe, das man für SSH genutzt hat.
es: Ahora reinicie el dispositivo. Si todo ha ido bien, acabará viendo el «spinner» (rueda girando) de Ubuntu Touch seguido de Unity 8. La contraseña de bloqueo es la misma que la que puso para SSH.
it: A questo punto, riavvia il dispositivo. Se tutto è andato bene, eventualmente potresti vedere lo spinner di Ubuntu Touch seguito da Unity 8. La tua parola di accesso è la stessa che si è scelto per entrare con SSH.
zh_hans: 现在重启设备。如果一切正常，你最终将看到Ubuntu Touch spinner紧跟着Unity 8。锁定密码和你SSH设置的密码相同。
zh_hant: 現在，重新啟動裝置。 如果一切順利，您最終會看到 Ubuntu Touch 微調器，然後是 Unity 8。您的鎖密碼與您為 SSH 設置的密碼相同。

source: Problems when bringing up Unity 8
de: Probleme beim Aufrufen von Unity 8

source: Refer to :ref:`Known-issues-when-bringing-up-Unity-8`.
de: Siehe :ref:`Known-issues-when-bringing-up-Unity-8`.
zh_hans: 参考 :ref:`Known-issues-when-bringing-up-Unity-8`.

source: The four first sections below will take you through the porting steps described in the introduction.
de: Die folgenden vier Abschnitte führen Sie durch die in der Einleitung beschriebenen Portierungsschritte.
zh_hans: 下面的四个第一部分将带领你完成介绍中描述的移植步骤。

source: The next section is a collection of documented errors and how to deal with them. These have been kept separate from the porting instructions themselves for the sake of keeping these brief. However, each section of the porting instructions concludes with a direct link to the relevant information on issues and errors.
de: Der nächste Abschnitt ist eine Sammlung von dokumentierten Fehlern und wie man mit ihnen umgeht. Diese sind von den eigentlichen Portierungsanweisungen getrennt, um diese kurz zu halten. Jeder Abschnitt der Portierungsanleitung schließt jedoch mit einem direkten Link zu den entsprechenden Informationen über Probleme und Fehler ab.
zh_hans: 下一章节是记录的错误和如何处理它们的集合。为了保持简短，这些内容与移植说明本身是分开的。然而，移植说明的每一章节最后都有一个与问题和错误的相关信息的直接链接。

source: The final section contains reference material that may be useful.
de: Der letzte Abschnitt enthält Referenzmaterial, das nützlich sein kann.
zh_hans: 最后一节包含可能会很有用的参考材料。

source: GSI Porting
de: GSI Portierung
zh_hans: GSI 移植
