Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: The device may reboot cleanly after about a minute of uptime. If you are logged in when the reboot occurs, you will see the following message::
de: Das Gerät kann nach etwa einer Minute Betriebszeit sauber neu gestartet werden. Wenn Sie zum Zeitpunkt des Neustarts eingeloggt sind, wird die folgende Meldung angezeigt::
es: El dispositivo puede reiniciarse tras aproximadamente un minuto de funcionamiento. Si tiene su sesión activa cuando ocurre el reinicio, verá el siguiente mensaje::
zh_hans: 在正常运行一分钟后，设备将可以顺利地重启。 如果您在重新启动时登录，您将看到以下消息:
zh_hant: 在正常進行一分鐘後，裝置可以乾淨地重啟。 如果您在重新啟動時登入，您將看到以下訊息::

source: This happens because ``lightdm``, the Ubuntu Touch display manager, is crashing repeatedly. The system watchdog process sees this and reboots the device.
de: Dies geschieht, weil ``lightdm``, der Ubuntu Touch Display Manager, immer wieder abstürzt. Der System-Watchdog-Prozess sieht dies und startet das Gerät neu.
es: Esto ocurre por que ``lightdm``, el gestor de pantalla de Ubuntu Touch se se está cerrando de forma inesperada repetidamente. El proceso del sistema «watchdog» (perro guardián) lo detecta y reinicia el dispositivo.
zh_hans: 发生这种情况的原因是 Ubuntu Touch 的显示管理器 ``lightdm`` 反复崩溃，系统 watchdog 进程看到了于是重启了设备。
zh_hant: 這是因為 Ubuntu Touch 顯示管理器 "lightdm" 反覆崩潰。系統監視程序進程會看到此情況並重新啟動裝置。

source: To fix this problem, log in before the reboot occurs and run the following command::
de: Um dieses Problem zu beheben, melden Sie sich vor dem Neustart an und führen Sie den folgenden Befehl aus::
es: Para solucionar este problema, inicie sesión antes de que ocurra el problema y ejecute la siguiente orden::
zh_hans: 要解决此问题，请在重新引导之前登录并运行以下命令::
zh_hant: 要解決此問題，請在重新開機之前登入並執行以下命令::

source: Known issues when bringing up Unity 8
de: Bekannte Probleme beim Aufrufen von Unity 8
zh_hans: 调用 Unity 8 时的已知问题

source: Below is are a few things to check when you are having trouble bringing up Unity 8.
de: Im Folgenden sind einige Dinge aufgeführt, die Sie überprüfen sollten, wenn Sie Probleme beim Starten von Unity 8 haben.
zh_hans: 下面是当你在调出Unity 8时遇到问题时需要检查的一些事项。

source: Nothing shows on screen
de: Auf dem Bildschirm wird nichts angezeigt
es: No se muestra nada en la pantalla
zh_hans: 屏幕上没有显示任何内容
zh_hant: 螢幕上沒有顯示任何內容

source: Mir servers crashing can be caused by many different problems with the port. To troubleshoot more, you can try the following:
de: Der Absturz von Mir-Servern kann durch viele verschiedene Probleme mit dem Port verursacht werden. Um weitere Fehler zu beheben, können Sie Folgendes versuchen:
es: Los cierres inesperados del servidor Mir pueden ser causados por diferentes problemas con el portado. Para identificar el problema, puede intentar lo siguiente:
zh_hans: Mir服务器崩溃可能是由端口的许多不同问题引起的。 要解决更多问题，您可以尝试以下操作：
zh_hant: Mir 伺服器崩潰可能是由端口的許多不同問題引起的。 要解決更多問題，您可以嘗試以下操作：

source: Is the Android container running?
de: Läuft der Android-Container?
es: ¿Está el contenedor de Android ejecutándose?
zh_hans: Android容器是否正在运行？
zh_hant: Android 容器是否正在運行？

source: If the Android container is not running, many parts of Ubuntu Touch will not work. Run this command to check on the container's status::
de: Wenn der Android-Container nicht ausgeführt wird, funktionieren viele Teile von Ubuntu Touch nicht. Führen Sie diesen Befehl aus, um den Status des Containers zu überprüfen::
es: Si el contenedor de Android no se está ejecutando, muchas partes de Ubuntu Touch no funcionarán. Ejecute esta orden para comprobar el estado del contenedor::
zh_hans: 如果Android容器未运行，Ubuntu Touch的许多部分将无法运行。 运行此命令以检查容器的状态::
zh_hant: 如果 Android 容器未運行，則 Ubuntu Touch 的許多部分將無法運行。 執行此命令以檢查容器的狀態::

source: If you get output similar to the following, the Android container is running and you can move on to the next troubleshooting step::
de: Wenn Sie eine Ausgabe ähnlich der folgenden erhalten, läuft der Android-Container und Sie können mit dem nächsten Schritt zur Fehlerbehebung fortfahren::
es: Si tiene una salida similar a la siguiente, el contenedor de Android estará ejecutándose y podrá continuar con el siguiente paso de la identificación del problema::
zh_hans: 如果输出类似于以下内容，则Android容器正在运行，您可以继续执行下一个故障排除步骤::
zh_hant: 如果出現類似於以下內容，則 Android 容器正在執行，您可以繼續進行下一個故障排除步驟::

source: Are all of the Android partitions mounted?
de: Sind alle Android-Partitionen gemountet?
es: ¿Están montadas todas las particiones de Android?
zh_hans: 所有 Android 分区都被挂载了么？
zh_hant: 是否安裝了所有 Android 分區？

source: If some partitions used for Android drivers are not mounted, the container may start but not work correctly.
de: Wenn einige Partitionen, die für Android-Treiber verwendet werden, nicht gemountet sind, kann es sein, dass der Container startet, aber nicht richtig funktioniert.
es: Si algunas particiones usadas por los controladores de Android no están montadas, el contenedor puede arrancar pero no funcionar correctamente.
zh_hans: 如果未安装用于Android驱动程序的某些分区，则容器可能会启动但无法正常工作。
zh_hant: 如果未安裝用於 Android 驅動程式的某些分區，則容器可能會啟動但無法正常工作。

source: To check the mounted Android partitions, run ``ls /android``. At least the following folders should be contained within::
de: Um die gemounteten Android-Partitionen zu überprüfen, führen Sie ``ls /android`` aus. Mindestens die folgenden Ordner sollten enthalten sein::
es: Para comprobar las particiones de Android montadas, ejecute ``ls /android``. Al menos las siguientes carpetas deberían estar contenidas en su interior::
zh_hans: 要检查已安装的Android分区，请运行“ls /android”。 至少应包含以下文件夹::
zh_hant: 要檢查已安裝的 Android 分區，請執行 "ls / android"。 至少應包含以下文件夾::

source: If any of these are missing, run ``dmesg`` to get the kernel log. Mounting Android partitions will start after the following line::
de: Wenn eine davon fehlt, führen Sie ``dmesg`` aus, um das Kernelprotokoll zu erhalten. Das Mounten von Android-Partitionen beginnt nach der folgenden Zeile::
es: Si falta alguna de ellas, ejecute ``dmesg`` para obtener el registro del núcleo. El montaje de las particiones de Android comenzará después de la siguiente línea::
zh_hans: 如果确实这些内容，运行``dmesg``以得到内核日志。将在以下行后开始挂载Android分区::
zh_hant: 如果缺少其中任何一個，執行 "dmesg" 來獲取核心日誌。 安裝 Android 分區將在以下行之後開始::

source: Try to diagnose and fix any mounting errors that you find in the log for the partitions listed above.
de: Versuchen Sie, alle Mounting-Fehler zu diagnostizieren und zu beheben, die Sie im Protokoll für die oben aufgeführten Partitionen finden.
es: Intente diagnosticar y solucionar cualquier error de montaje que encuentre en el registro para las particiones listadas anteriormente.
zh_hans: 试着诊断与修复dmesg列出的分区日志中找到的任何挂载错误。
zh_hant: 嘗試診斷並修復在上面列出的分區的日誌中找到的任何安裝錯誤。

source: Some devices have a ``vendor`` partition that contains proprietary libraries and executables required to run Android. If your device has this partition, make sure that it is mounted in addition to the others listed above.
de: Einige Geräte haben eine ``vendor`` Partition, die proprietäre Bibliotheken und ausführbare Dateien enthält, die für den Betrieb von Android erforderlich sind. Wenn Ihr Gerät über diese Partition verfügt, stellen Sie sicher, dass sie zusätzlich zu den anderen oben aufgeführten Partitionen gemountet ist.
es: Algunos dispositivos tienen una partición ``vendor``que contiene bibliotecas propietarias y ejecutables necesarios para ejecutar Android. Si su dispositivo tiene esta partición, asegúrese de que está montada además de las otras listadas anteriormente.
zh_hans: 一些设备有个包含Android所需运行的专有库和可执行文件的``vendor``分区。如果你的设备有此分区，确保除上面列出的其他分区之外还挂载了此分区。
zh_hant: 有些設備有一個 "vendo" 分區，其中包含運行 Android 所需的專有庫和可執行文件。 如果您的設備具有此分區，請確保除了上面列出的其他分區之外還安裝了該分區。

source: Getting more Mir logs
de: Mehr Mir-Logs erhalten
es: Obteniendo mas registros de Mir
zh_hans: 获取更多 Mir 日志
zh_hant: 獲得更多 Mir 日誌

source: If the Android container is running and all of its partitions seem to be mounted, you will need to get a few more logs before enlisting community help.
de: Wenn der Android-Container läuft und alle seine Partitionen gemountet zu sein scheinen, müssen Sie ein paar weitere Protokolle anfordern, bevor Sie die Hilfe der Community in Anspruch nehmen können.
es: Si el contenedor de Android está ejecutándose y todas sus particiones parecen estar montadas, necesitará obtener algunos registros más antes de solicitar ayuda a la comunidad.
zh_hans: 如果Android容器正在运行且其所有分区已挂载，在征求社区帮助前你需要抓取更多日志。
zh_hant: 如果 Android 容器正在運行並且其所有分區似乎都已掛載，則需要在獲得社區幫助之前獲取更多日誌。

source: First, stop the display manager if it is not already::
de: Stoppen Sie zunächst den Display-Manager, wenn er es noch nicht ist::
es: Primero, detenga el gestor de pantalla si no lo está ya::
zh_hans: 首先，如果你还没有停止显示管理器，先停止它：
zh_hant: 首先，如果顯示管理器尚未顯示，請先其停止::

source: If you have Wi-Fi working (See `the Halium docs for Wi-Fi`_), install the ``libc6-dbg`` package first::
de: Wenn Wi-Fi funktioniert (siehe `die Halium-Dokumentation für Wi-Fi`_), installiere zuerst das Paket ``libc6-dbg``::
es: Si tiene la wifi funcionando (vea `los documentos de Halium para la wifi`_), instale primero el paquete ``libc6-dbg``::
zh_hans: 如果你的Wi-Fi能工作（参见`the Halium docs for Wi-Fi`_），先安装``libc6-dbg``包::
zh_hant: 如果你有 Wi-Fi 正在工作（請參閱 "用於Wi-Fi的Halium文檔"_），首先安裝 "libc6-dbg" 套件::

source: Then, run the following commands to get all of the needed logs::
de: Führen Sie dann die folgenden Befehle aus, um alle benötigten Protokolle abzurufen::
es: Después, ejecute las siguientes órdenes para obtener todos los registros necesarios::
zh_hans: 然后运行以下命令以抓取所有需要的日志::
zh_hant: 然後，執行以下命令以獲取所有需要的日誌::

source: Use ``scp`` or a similar program to copy the ``usc.log``, ``usc-gdb.log``, and ``usc-logcat.log`` files from phablet's home folder to your computer. Then, post the content of these files to `paste.ubuntu.com`_, Pastebin, GitHub Gists, or a similar service so the people helping you can view them easily.
de: Verwenden Sie ``scp`` oder ein ähnliches Programm, um die Dateien ``usc.log``, ``usc-gdbdb.log`` und ``usc-logcat.log`` vom Heimatordner von phablet auf Ihren Computer zu kopieren. Veröffentlichen Sie dann den Inhalt dieser Dateien unter `paste.ubuntu.com`_, Pastebin, GitHub Gists oder einem ähnlichen Dienst, damit die Personen, die Ihnen helfen, sie einsehen können.
es: Utilice ``scp`` o un programa similar para copiar los archivos ``usc.log``, ``usc-gdb.log`` y``usc-logcat.log`` de la carpeta principal de «phablet» (/home/phablet/) a su ordenador. Luego, suba el contenido de esos archivos a `paste.ubuntu.com`_, Pastebin,, GitHub Gists,j o a un servicio similar para que la gente que le ayude pueda verlos fácilmente.
zh_hans: 使用``scp``或其他类似程序从phablet的家目录复制``usc.log``、``usc-gdb.log``和``usc-logcat.log``文件到电脑上。接着上传这些文件内容到`paste.ubuntu.com`_，Pastebin，GitHub Gists或帮你的人能够轻松浏览到的相似服务。
zh_hant: 使用 "scp" 或類似的程序將 "usc.log"，"usc-gdb.log" 和 "usc-logcat.log" 文件從 phablet 的主文件夾複製到你的電腦上。 然後將這些文件的內容發佈到 “paste.ubuntu.com"_，"Pastebin"，"GitHub Gists" 或類似服務，以便幫助您的開發人員輕鬆查看。

source: Programs hang before crashing
de: Programme hängen sich auf, bevor sie abstürzen
es: Los programas se cuelgan antes de un cierre inesperado
zh_hans: 程序在崩溃前挂起
zh_hant: 程在崩潰之前掛載

source: Sometimes processes will hang for a very long time and then abort or segfault. The reason for the hang is apport, which attempts to collect useful information about the crash before allowing the program to stop.
de: Manchmal hängen Prozesse sehr lange und werden dann abgebrochen oder erzeugen einen Segfault. Der Grund für den Hang ist apport, der versucht, nützliche Informationen über den Absturz zu sammeln, bevor das Programm gestoppt wird.
es: A veces los procesos dejarán de responder por bastante tiempo y después se interrumpirán o sufrirán un fallo del segmento («segfault»). La razón para el cuelgue es «apport», que intenta recoger información útil sobre el cierre inesperado antes de permitir que el programa se detenga.
zh_hans: 有时进程会挂起很长时间，然后中止或出现段错误。 挂起的原因是 apport，它试图在允许程序停止之前收集有关崩溃的有用信息。
zh_hant: 有時進程會掛起很長時間，然後中止或段錯誤。 掛載的原因是 apport，它試圖在允許程序停止之前收集有關崩潰的有用訊息。

source: If you don't need apport's information and would rather have the programs crash faster while troubleshooting, issue the following commands::
de: Wenn Sie die Informationen von apport nicht benötigen und die Programme bei der Fehlersuche lieber schneller abstürzen lassen möchten, geben Sie folgende Befehle ein::
es: Si no necesita la información de «apport» y prefiere que los programas se cierren mas rápido mientras intenta identificar un problema, ejecute las siguientes órdenes::
zh_hans: 如果你不需要 apport 的信息，宁愿在排除故障时让程序更快地崩溃，请发出以下命令：
zh_hant: 如果您不需要 apport 的訊息，並且希望在排除故障時讓程式崩潰得更快，請輸入以下命令::

source: Normally the writing to the syslog is disabled. During porting it can be useful to enable this::
de: Normalerweise ist das Schreiben in das Syslog deaktiviert. Bei der Portierung kann es sinnvoll sein, dies zu aktivieren::
zh_hans: 通常情况下，写入系统日志的功能被禁用。在移植过程中，启用这个功能可能是有用的：

source: Now rsyslogd will write to the file and you can use it as usual. For example ``less /var/log/syslog`` or ``tail -f /var/log/syslog``.
de: Nun wird rsyslogd in die Datei schreiben und Sie können sie wie gewohnt verwenden. Zum Beispiel ``less /var/log/syslog`` oder ``tail -f /var/log/syslog``.
zh_hans: 现在 rsyslogd 将写入该文件，你可以照常使用它。例如，``less /var/log/syslog`` 或 ``tail -f /var/log/syslog`` 。

source: Known issues when configuring the device
de: Bekannte Probleme beim Konfigurieren des Geräts
zh_hans: 配置设备时已知的问题

source: Apps crash on launch
de: Apps stürzen beim Start ab
zh_hans: 应用程序在启动时崩溃

source: Check if keyboard vibration works. If it does not, this is a good indication that you have not properly applied the apparmor kernel patches.
de: Prüfen Sie, ob die Tastaturvibration funktioniert. Wenn dies nicht der Fall ist, ist dies ein guter Hinweis darauf, dass Sie die Apparmor-Kernel-Patches nicht richtig angewendet haben.
zh_hans: 检查键盘振动是否工作。如果不能，这很好地说明你没有正确应用 apparmor 内核补丁。

source: Refer to section :ref:`Apply-apparmor-kernel-patches`.
de: Siehe Abschnitt :ref:`Apply-apparmor-kernel-patches`.
zh_hans: 参考章节 :ref:`Apply-apparmor-kernel-patches` 。

source: This section is a *Work in progress*
de: Dieser Bereich ist ein *Work in progress*
zh_hans: 这一章节是 *进行中的工作*

source: Configuring Ubuntu Touch
de: Ubuntu Touch konfigurieren

source: In the previous section you adjusted a configuration file directly in the UBports rootfs. The rootfs contains a number of other configuration files with some standard settings that do not necessarily conform to your device. These must be modified to fit your device. The rootfs itself is read only and identical for all devices. You cannot modify the rootfs itself. Instead, the correct way to adjust the configuration is with overlay files, as described below.
de: Im vorherigen Abschnitt haben Sie eine Konfigurationsdatei direkt im UBports-Rootfs angepasst. Das rootfs enthält eine Reihe weiterer Konfigurationsdateien mit einigen Standardeinstellungen, die nicht unbedingt mit Ihrem Gerät übereinstimmen. Diese müssen an Ihr Gerät angepasst werden. Die rootfs selbst ist schreibgeschützt und für alle Geräte identisch. Sie können die rootfs selbst nicht ändern. Stattdessen ist der richtige Weg, die Konfiguration mit Overlay-Dateien anzupassen, wie unten beschrieben.
zh_hans: 在之前的章节中，你直接在 UBports rootfs 中调整了一个配置文件。rootfs 包含一些其他的配置文件，其中有一些标准的设置，不一定符合你的设备。这些必须被修改以适应你的设备。rootfs 本身是只读的，对所有设备都是一样的。你不能修改 rootfs 本身。相反，调整配置的正确方法是使用覆盖文件，如下所述。

source: Overlay files
de: Überlagerte Dateien
zh_hans: 覆盖文件（Overlay files）

source: Note that as a rule of thumb, the method described below applies if the file you need to edit can be found in the /etc directory (or a subdirectory of this) on your device. You should not attempt to overwrite files located elsewhere with overlay files using this method.
de: Beachten Sie, dass die unten beschriebene Methode als Faustregel gilt, wenn sich die zu bearbeitende Datei im Verzeichnis /etc (oder einem Unterverzeichnis davon) auf Ihrem Gerät befindet. Sie sollten nicht versuchen, mit dieser Methode Dateien, die sich an anderer Stelle befinden, mit Overlay-Dateien zu überschreiben.
zh_hans: 注意，作为经验法则，如果你需要编辑的文件能在设备上的/etc目录（或其子目录）中找到，那么下面描述的方法就适用。你不应该用这种方法试图用覆盖文件来覆盖位于其他地方的文件。

source: In your device directory, create a subdirectory named 'ubuntu'. Collect the files you wish to inject into your build in this directory.
de: Erstellen Sie in Ihrem Geräteverzeichnis ein Unterverzeichnis namens "ubuntu". Sammeln Sie die Dateien, die Sie in Ihr Build einfügen möchten, in diesem Verzeichnis.
zh_hans: 在你的设备目录中，创建一个名为 "ubuntu "的子目录。在这个目录中收集你希望注入到你的构建中的文件。

source: Relevant files are for example (but this list is incomplete):
de: Einschlägige Dateien sind zum Beispiel (diese Liste ist jedoch unvollständig):
zh_hans: 相关的文件如下例子（但这个列表是不完整的）：

source: 70-android.rules (the udev rules for your device, see previous section)
de: 70-android.rules (die udev-Regeln für Ihr Gerät, siehe vorheriger Abschnitt)
zh_hans: 70-android.rules (适用于你的设备的 udev 文件, 见之前的章节)

source: android.conf (for display scaling, see below)
de: android.conf (für die Skalierung der Anzeige, siehe unten)
zh_hans: android.conf (用于屏幕缩放, 见下方)

source: touch.pa (for pulseaudio sound configuration/initialization, see below)
de: touch.pa (für die Konfiguration/Initialisierung des pulseaudio-Sounds, siehe unten)
zh_hans: touch.pa (用于 pulseaudio 音频设置或者初始化, 见下方)

source: These files are then injected by adding a code block to the file ``device.mk`` in your device directory. For the three files above add the following code::
de: Diese Dateien werden dann durch Hinzufügen eines Code-Blocks in die Datei ``device.mk`` in Ihrem Geräteverzeichnis eingefügt. Für die drei oben genannten Dateien fügen Sie den folgenden Code ein::
zh_hans: 然后通过在你的设备目录中的 ``device.mk`` 文件中添加一个代码块来注入这些文件。对于上面的三个文件，添加以下代码：

source: Explanation:
de: Erläuterung:
zh_hans: 解释如下：

source: The string before the colon '$(LOCAL_PATH)/ubuntu/70-android.rules' specifies the path to the source file to be injected. The string after the colon 'system/halium/lib/udev/rules.d/70-android.rules' specifies where you want it placed on the device.
de: Die Zeichenkette vor dem Doppelpunkt '$(LOCAL_PATH)/ubuntu/70-android.rules' gibt den Pfad zu der zu injizierenden Quelldatei an. Die Zeichenfolge nach dem Doppelpunkt 'system/halium/lib/udev/rules.d/70-android.rules' gibt an, wo sie auf dem Gerät platziert werden soll.
zh_hans: 冒号之前的字符串 '$(LOCAL_PATH)/ubuntu/70-android.rules' 指定了要注入的源文件的路径。冒号之后的字符串 'system/halium/lib/udev/rules.d/70-android.rules' 指定了你希望它放在设备上的位置。

source: The general steps to follow are thus:
de: Die allgemeinen Schritte sind wie folgt:
zh_hans: 要遵循的一般步骤是这样的：

source: Copy the file you wish to modify to the 'ubuntu' directory you have created in your device source tree.
de: Kopieren Sie die Datei, die Sie ändern möchten, in das Verzeichnis 'ubuntu' , das Sie in Ihrem Gerätequellbaum erstellt haben.
zh_hans: 将你想修改的文件复制到你在设备树源码中创建的 'ubuntu' 目录中。

source: Edit the file as needed.
de: Bearbeiten Sie die Datei nach Bedarf.
zh_hans: 根据需要编辑该文件。

source: Add a line to the PRODUCT_COPY_FILES section of your device.mk file as shown above.
de: Fügen Sie eine Zeile in den Abschnitt PRODUCT_COPY_FILES Ihrer Datei device.mk ein, wie oben gezeigt.
zh_hans: 在你的device.mk文件的PRODUCT_FILES部分添加一行，如上所示。

source: Rebuild your system.img and reflash together with the ubports rootfs.
de: Bauen Sie Ihre system.img neu auf und flashen Sie sie zusammen mit den ubports rootfs.
zh_hans: 重新编译你的 system.img 并且与 ubports rootfs 一同重新刷入。

source: The target paths for the files mentioned above are *not* randomly chosen. You must use the specified paths.
de: Die Zielpfade für die oben genannten Dateien sind *nicht* zufällig gewählt. Sie müssen die angegebenen Pfade verwenden.
zh_hans: 上述文件的目标路径不是*随机选择的。你必须使用指定的路径。

source: When you specify target path 'system/halium/etc/myfilename' your file 'myfilename' will end up in the '/etc' directory of your device (i.e. without the leading 'system/halium')
de: Wenn Sie den Zielpfad 'system/halium/etc/myfilename' angeben, landet Ihre Datei 'myfilename' im Verzeichnis '/etc' Ihres Geräts (d. h. ohne das führende 'system/halium')
zh_hans: 当你指定目标路径 'system/halium/etc/myfilename' 你的文件 'myfilename' 将在你的设备的 '/etc' 目录下结束（即没有前面的 "system/halium"）

source: When you have made the adjustments you need and prepared your source as described above, you have to rebuild your system.img: ``mka systemimage``. When rebuilding the system image after small changes like these, you need not ``mka clean`` first. However, changes to PRODUCT_PROPERTY_OVERRIDES might not get detected by the build system. Go to your output folder, enter the system folder and delete ``build.prop`` in order to get it regenerated.
de: Wenn Sie die notwendigen Anpassungen vorgenommen und Ihre Quelle wie oben beschrieben vorbereitet haben, müssen Sie Ihr system.img neu erstellen: ``mka systemimage``. Wenn Sie das Systemimage nach kleinen Änderungen wie diesen neu erstellen, müssen Sie nicht erst ``mka clean`` durchführen. Allerdings könnten Änderungen an PRODUCT_PROPERTY_OVERRIDES vom Build-System nicht erkannt werden. Gehen Sie zu Ihrem Ausgabeordner, öffnen Sie den Systemordner und löschen Sie ``build.prop``, um es neu zu erstellen.
zh_hans: 当你做了你需要的调整，并按上述方法准备好你的源码后，你必须重建你的system.img。``mka clean`` 。在像这样的小改动后重建系统镜像时，你不需要先 ``mka clean`` 。然而，PRODUCT_PROPERTY_OVERRIDES的变化可能不会被构建系统检测到。进入你的输出文件夹，进入系统文件夹，删除 ``build.prop``，以使其重新生成。

source: Extract the file 70-android.rules which you created in the previous section using ``adb pull`` or ``scp`` and copy it to the 'ubuntu' directory of your device source tree. Complete steps 3 and 4 above.
de: Entpacken Sie die Datei 70-android.rules, die Sie im vorigen Abschnitt erstellt haben, mit ``adb pull`` oder ``scp`` und kopieren Sie sie in das 'ubuntu'-Verzeichnis Ihres Geräte-Quellbaums. Führen Sie die obigen Schritte 3 und 4 aus.
zh_hans: 使用 ``adb pull`` 或 ``scp`` 提取你在上一节创建的 70-android.rules 文件，并将其复制到设备源树的 'ubuntu' 目录下。完成上面的步骤 3 和 4 。

source: Display scaling
de: Anzeigeskalierung
es: Escala de la pantalla
it: Ridimensionamento del display
zh_hans: 显示缩放
zh_hant: 顯示器縮放

source: Once you have adjusted the ``android.conf`` file to the display settings needed for your device, this file should be incorporated into your build.
de: Sobald Sie die Datei ``android.conf`` an die für Ihr Gerät benötigten Anzeigeeinstellungen angepasst haben, sollte diese Datei in Ihren Build integriert werden.
zh_hans: 一旦你将 ``android.conf`` 文件调整为你的设备所需的显示设置，这个文件应该被纳入你的构建中。

source: Create the file android.conf in your 'ubuntu' directory and enter the settings you determined and tested in the previous section. Complete steps 3 and 4 above, taking care to remember the note on how to :ref:`Rebuild-system.img`.
de: Erstellen Sie die Datei android.conf in Ihrem 'ubuntu'-Verzeichnis und tragen Sie die Einstellungen ein, die Sie im vorherigen Abschnitt ermittelt und getestet haben. Führen Sie die obigen Schritte 3 und 4 aus und denken Sie dabei an den Hinweis, wie Sie :ref:`Rebuild-system.img` verwenden.

source: Apply apparmor kernel patches
de: Apparmor-Kernel-Patches anwenden
zh_hans: 应用 apparmor 内核补丁

source: `What is apparmor? <https://wiki.ubuntu.com/AppArmor>`_
de: `Was ist Apparmor? <https://wiki.ubuntu.com/AppArmor>`_
zh_hans: `什么是apparmor? <https://wiki.ubuntu.com/AppArmor>`_

source: Start by downloading the backported `apparmor patch <https://github.com/ubports/apparmor-backports-ut>`_ corresponding to your device's kernel version. Your kernel version is specified at the beginning of your kernel defconfig file, i.e. the one you edited in section :ref:`Edit-kernel-config` above.
de: Beginnen Sie damit, den zurückportierten `apparmor patch <https://github.com/ubports/apparmor-backports-ut>`_ herunterzuladen, der der Kernelversion Ihres Geräts entspricht. Ihre Kernelversion wird am Anfang Ihrer Kernel-Defconfig-Datei angegeben, d.h. der Datei, die Sie im Abschnitt :ref:`Edit-kernel-config` oben bearbeitet haben.
