Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: Introduction to porting
de: Einführung in die Portierung
zh_hans: 移植简介

source: This first section will introduce you to the specifics of porting Ubuntu Touch to an Android device. Note that it is written with the general public in mind, not primarily the experienced porting developer. In subsequent sections we have made an effort to differentiate by keeping the main text more concise in order to meet the needs of the more experienced reader, while providing links to supplementary reading for the less experienced.
de: Dieser erste Abschnitt wird Sie in die Besonderheiten der Portierung von Ubuntu Touch auf ein Android-Gerät einführen. Beachten Sie, dass er für die allgemeine Öffentlichkeit geschrieben ist, nicht primär für den erfahrenen Portierungsentwickler. In den folgenden Abschnitten haben wir uns um eine Differenzierung bemüht, indem wir den Haupttext knapper gehalten haben, um den Bedürfnissen des erfahreneren Lesers gerecht zu werden, während wir Links zu ergänzender Lektüre für den weniger erfahrenen Leser bereitstellen.
zh_hans: 第一节将向您介绍将 Ubuntu Touch移植到安卓设备的细节。请注意，它是针对一般用户而非有经验的移植开发人员准备的。在随后的章节中，我们努力使正文更加简洁，以满足经验丰富的读者的需要，同时为经验不足的读者提供补充阅读的链接，从而使之有所区别。

source: The guide as a whole is written as a sequence of steps describing how an ideal port might proceed. However, porting is unpredictable and messy. Every device is different and in reality you will likely iterate and revisit some steps, skip over other steps and uncover new and undocumented challenges.
de: Der Leitfaden als Ganzes ist als eine Abfolge von Schritten geschrieben, die beschreiben, wie eine ideale Portierung ablaufen könnte. Eine Portierung ist jedoch unvorhersehbar und chaotisch. Jedes Gerät ist anders und in der Realität werden Sie wahrscheinlich einige Schritte wiederholen und überarbeiten, andere Schritte überspringen und neue und undokumentierte Herausforderungen entdecken.
zh_hans: 这篇教程介绍了理想情况下移植的一系列步骤。但是，移植工作经常会遇到烦人的问题。每一个设备都不一样，而且实际上你可能会重复，跳过一些步骤以及发现新的和搜不到的问题。

source: What is Ubuntu Touch?
de: Was ist Ubuntu Touch?
zh_hans: 什么是Ubuntu Touch？

source: Ubuntu Touch is an open source operating system for mobile devices. It can be ported to devices that originally shipped with Android OS. Alas, the majority of these devices are dependent to some degree on proprietary software.
de: Ubuntu Touch ist ein Open-Source-Betriebssystem für mobile Geräte. Es kann auf Geräte portiert werden, die ursprünglich mit Android OS ausgeliefert wurden. Leider sind die meisten dieser Geräte bis zu einem gewissen Grad auf proprietäre Software angewiesen.
zh_hans: Ubuntu Touch 是一个开源的手机系统。它可以被移植到装有安卓的手机上。不过，大部分的设备上依赖一些专有软件。

source: To be specific, device vendors tend to keep the code that speaks directly to the device hardware (the low level device drivers) proprietary. These components are commonly called the 'vendor blobs'. The vendor blobs need to be incorporated into an Ubuntu Touch port. Note that these components are specific not only to each device, but also to each Android version. It is therefore necessary to secure the correct version of these components when building a port.
de: Um genau zu sein, neigen Gerätehersteller dazu, den Code, der direkt mit der Gerätehardware spricht (die Low-Level-Gerätetreiber), proprietär zu halten. Diese Komponenten werden gemeinhin als "Vendor Blobs" bezeichnet. Die Vendor Blobs müssen in eine Ubuntu Touch-Portierung eingebunden werden. Beachten Sie, dass diese Komponenten nicht nur für jedes Gerät, sondern auch für jede Android-Version spezifisch sind. Es ist daher notwendig, die korrekte Version dieser Komponenten beim Erstellen eines Ports zu sichern.
zh_hans: 具体来讲，设备制造商趋向于把直接与设备硬件交互的底层设备驱动代码闭源。这些代码通常叫做“Vendor blobs”。在移植 Ubuntu Touch 时，“Vendor blobs"需要被集成到系统中。有些代码不仅只适用于某个设备，还只适用于某个安卓版本。所以，在移植时必须确保这些代码的版本正确。

source: This is why Ubuntu Touch cannot be built completely from source code for most commercial devices. Instead, porting the system to these devices involves integrating the previously mentioned vendor blobs into the rest of the system, which can be built from source.
de: Aus diesem Grund kann Ubuntu Touch für die meisten kommerziellen Geräte nicht komplett aus dem Quellcode gebaut werden. Stattdessen beinhaltet die Portierung des Systems auf diese Geräte die Integration der zuvor erwähnten Vendor Blobs in den Rest des Systems, der aus dem Quellcode gebaut werden kann.
zh_hans: 这就是为什么 Ubuntu Touch 不能为大多数商业设备完全从源代码构建。相反，将系统移植到这些设备上，需要将前面提到的 vendor blobs 整合到系统的其他部分，而这些部分可以从源代码中构建。

source: The next component of Ubuntu Touch is a pre-compiled root filesystem which needs to be installed on the device. This component does not communicate directly with the device hardware. Instead, this communication is mediated by a Hardware Abstraction Layer (HAL) which needs to be built for each specific device, because each device has its specific hardware architecture. This component is called Halium and is available in different versions (5.1 which is largely obsolete, 7.1, and 9 as of writing) corresponding to different Android versions.
de: Die nächste Komponente von Ubuntu Touch ist ein vorkompiliertes Root-Dateisystem, das auf dem Gerät installiert werden muss. Diese Komponente kommuniziert nicht direkt mit der Gerätehardware. Stattdessen wird diese Kommunikation durch eine Hardware-Abstraktionsschicht (HAL) vermittelt, die für jedes spezifische Gerät gebaut werden muss, da jedes Gerät seine spezifische Hardware-Architektur hat. Diese Komponente heißt Halium und ist in verschiedenen Versionen (5.1, die weitgehend veraltet ist, 7.1 und 9 zum Zeitpunkt des Schreibens) verfügbar, die den verschiedenen Android-Versionen entsprechen.
zh_hans: Ubuntu Touch 的下一个组件是需要安装在设备上的预编译根文件系统， 这个组件不直接与设备硬件通信。 相反，因为每个设备都有其特定的硬件架构，它通过为每个特定设备构建的硬件抽象层 (HAL) 进行通信。 这个组件叫做 Halium，有不同的版本（5.1 已过时，7.1 ，以及9）对应不同的 Android 版本。

source: The Halium project enables Linux systems to run on Android hardware. It is a joint effort by multiple mobile operating systems, notably Plasma mobile, Lune OS and UBports. UBports porting builds on top of Halium porting. Consequently, you will be using both the Halium porting guide and the UBports porting guide. At times it can also be helpful to test with one of the other operating systems to debug a problem from different angles.
de: Das Halium-Projekt ermöglicht es Linux-Systemen, auf Android-Hardware zu laufen. Es ist eine gemeinsame Aufgabe von mehreren mobilen Betriebssystemen, insbesondere Plasma mobile, Lune OS und UBports. Die Portierung von UBports baut auf der Portierung von Halium auf. Folglich werden Sie sowohl die Halium-Portierungsanleitung als auch die UBports-Portierungsanleitung verwenden. Gelegentlich kann es auch hilfreich sein, mit einem der anderen Betriebssysteme zu testen, um ein Problem aus verschiedenen Blickwinkeln zu beheben.
zh_hans: Halium 使得Linux系统能够跑在安卓硬件上。它由多个移动操作系统的共同努力写成，特别是 Plasma mobile、Lune OS 和 UBports 。UBports在Halium的基础上移植。所以，你可能需要阅读Halium移植指南和UBports移植指南。有时，使用其他操作系统之一进行测试以从不同角度调试问题也很有帮助。

source: Halium is thus an indispensible part of an Ubuntu Touch port and is available in the form of open source software. Developing a new version of Halium is a very considerable task which is the why only a few versions of Halium are available. Each port of Ubuntu Touch has to be based on one of the available Halium versions and vendor blobs from the corresponding Android version. See the first two columns of the table below for details.
de: Halium ist somit ein unverzichtbarer Bestandteil einer Ubuntu-Touch-Portierung und liegt in Form von Open-Source-Software vor. Die Entwicklung einer neuen Version von Halium ist eine sehr umfangreiche Aufgabe, weshalb nur wenige Versionen von Halium verfügbar sind. Jede Portierung von Ubuntu Touch muss auf einer der verfügbaren Halium-Versionen und Vendor Blobs der entsprechenden Android-Version basieren. Siehe die ersten beiden Spalten der Tabelle unten für Details.
zh_hans: Halium因此成为Ubuntu Touch移植中不可或缺的一部分，并以开源软件的形式提供。 开发新版本的 Halium 是一项非常艰巨的任务，因此只有少数几个版本的 Halium 可用。

source: Thus an Ubuntu Touch port is composed of the these components:
de: Ein Ubuntu Touch-Port setzt sich also aus diesen Komponenten zusammen:
zh_hans: 所以一个Ubuntu Touch移植基于以下部件：

source: The Ubuntu Touch (UT) root filesystem (rootfs)
de: Das Ubuntu Touch (UT) Root-Dateisystem (rootfs)
zh_hans: Ubuntu Touch根文件系统 (rootfs)

source: `Halium <https://halium.org/>`_ (contained in the boot and system images)
de: `Halium <https://halium.org/>`_ (enthalten in den Boot- und System-Images)
zh_hans: `Halium <https://halium.org/>`_ (包含在启动（boot）和系统镜像（system images）中)

source: The vendor blobs
de: Die Vendor Blobs
zh_hans: 制造商驱动

source: You, the porter, need to build Halium (i.e. halium-boot.img and system.img) and install these together with the Ubuntu Touch rootfs in order to create a functioning Ubuntu Touch port.
de: Sie, der Portierer, müssen Halium bauen (d.h. halium-boot.img und system.img) und diese zusammen mit dem Ubuntu Touch rootfs installieren, um einen funktionierenden Ubuntu Touch Port zu erstellen.
zh_hans: 你，移植者，需要构建Halium（例如，halium-boot.img 和 system.img）并随Ubuntu Touch根目录一起安装以构建一个能用的Ubuntu Touch移植。

source: Halium is built using source code for a modified version of the Android operating system called LineageOS. The required source code is available online and needs to be downloaded and configured to build the correct Halium version for each individual device port. The table below shows which versions are required for the different Halium versions.
de: Halium wird unter Verwendung des Quellcodes für eine modifizierte Version des Android-Betriebssystems namens LineageOS erstellt. Der erforderliche Quellcode ist online verfügbar und muss heruntergeladen und konfiguriert werden, um die richtige Halium-Version für jeden einzelnen Geräteport zu erstellen. Die Tabelle unten zeigt, welche Versionen für die verschiedenen Halium-Versionen erforderlich sind.
zh_hans: Halium 基于 LineageOS 的安卓源代码。 所需的源代码可在线获取。你需要下载和配置才能构建正确的 Halium 版本。 下表显示了不同 Halium 版本所需的版本。

source: Overview of the porting process
de: Überblick über den Portierungsprozess
zh_hans: 移植过程总览

source: Preparations
de: Vorbereitungen
zh_hans: 准备工作

source: In this first stage you will choose a target device, gather information about it and choose a suitable workstation (PC or laptop) on which to do your work.
de: In diesem ersten Schritt wählen Sie ein Zielgerät aus, sammeln Informationen darüber und wählen eine geeignete Arbeitsstation (PC oder Laptop), auf der Sie Ihre Arbeit durchführen.
zh_hans: 首先你需要选择一个目标设备，获得关于它的信息，选择一个合适的工作环境（个人电脑或者笔记本）来移植。

source: Set up your Halium build environment and complete a test build
de: Richten Sie Ihre Halium-Build-Umgebung ein und führen Sie einen Test-Build durch
zh_hans: 设置好Halium构建环境并测试

source: This stage involves downloading all the relevant source code and securing the vendor blobs. You will then build the Halium boot image and system image according to the Halium guide to ensure that all your sources are set up correctly and work in unison.
de: Dieser Schritt beinhaltet das Herunterladen des gesamten relevanten Quellcodes und die Sicherung der Vendor Blobs. Anschließend erstellen Sie das Halium-Boot-Image und das System-Image gemäß dem Halium-Leitfaden, um sicherzustellen, dass alle Ihre Quellen korrekt eingerichtet sind und im Einklang arbeiten.
zh_hans: 这个步骤需要下载所有与设备驱动相关的源代码。然后，你需要根据Halium指南构建Halium启动镜像（boot image）和系统镜像（system image）来确保源代码设置完毕且可以用。

source: Build halium-boot.img and system.img for Ubuntu Touch
de: Erstellt halium-boot.img und system.img für Ubuntu Touch
zh_hans: 为Ubuntu Touch构建halium-boot.img和system.img

source: Now you need to modify your source tree, after which you will proceed to build the halium-boot.img and system.img to be used in your port.
de: Nun müssen Sie Ihren Quellbaum modifizieren, um anschließend die halium-boot.img und system.img zu erstellen, die in Ihrem Port verwendet werden sollen.
zh_hans: 现在你需要修改你的源码树，之后你将继续构建 halium-boot.img 和 system.img，以便在你的移植中使用。

source: Install and debug the boot process
de: Installieren und Debuggen des Bootvorgangs
zh_hans: 安装和调试启动流程

source: The goal of this stage is to successfully boot into Ubuntu Touch. You will be working from the command line.
de: Das Ziel dieser Phase ist es, erfolgreich in Ubuntu Touch zu booten. Sie werden über die Kommandozeile arbeiten.
zh_hans: 在这一阶段的目的是成功启动到Ubuntu Touch。你需要从命令行开始搞起。

source: Bring up the Ubuntu Touch graphical user interface 'Unity 8'
de: Rufen Sie die grafische Benutzeroberfläche von Ubuntu Touch 'Unity 8' auf
zh_hans: 介绍Ubuntu Touch的GUI, "Unity 8"

source: This stage involves adjusting some configuration and further debugging of your build.
de: In dieser Phase müssen Sie einige Konfigurationen anpassen und weitere Fehlerbehebungen an Ihrem Build vornehmen.
zh_hans: 这一部分包括调整一些设置以及对你的构建进行进一步的调试。

source: Complete device configuration
de: Vollständige Gerätekonfiguration
zh_hans: 完成设备设置

source: Now you need to further debug the build and adjust configuration until all broken functionality is fixed. When you complete this stage you will have a fully functional port, but it will not yet be capable of accepting Over The Air (OTA) updates.
de: Nun müssen Sie den Build weiter debuggen und die Konfiguration anpassen, bis alle fehlerhaften Funktionen behoben sind. Wenn Sie diese Phase abschließen, haben Sie einen voll funktionsfähigen Port, der jedoch noch nicht in der Lage ist, Over The Air (OTA)-Updates zu akzeptieren.
zh_hans: 现在你需要进一步的在构建过程中进行调试，并对某些设置进行调整，直到无法运行的功能得以被修复。当你完成了这一过程，你将会拥有一个功能完备的移植版本，但它现在还不能接收 OTA 更新。

source: Build Ubuntu Touch recovery.img
de: Ubuntu Touch recovery.img erstellen
zh_hans: 构建 Ubuntu Touch 的 recovery.img

source: The Ubuntu Touch recovery image is a slightly modified recovery image that is tailored to working with the UBports installer
de: Das Ubuntu Touch-Wiederherstellungsimage ist ein leicht modifiziertes Wiederherstellungsimage, das auf die Arbeit mit dem UBports-Installationsprogramm zugeschnitten ist
zh_hans: Ubuntu Touch的 recovery 镜像是一个稍作修改的 recovery 镜像，专门用于与 UBports installer 一起工作

source: Set up the UBports installer for your device
de: Richten Sie das UBports-Installationsprogramm für Ihr Gerät ein
zh_hans: 为您的设备设置 UBports installer

source: When you have completed this stage you will have made it possible for anyone owning the device in question to install and run Ubuntu Touch on it, including the ability to receive OTA updates as they are made available.
de: Wenn Sie diese Phase abgeschlossen haben, haben Sie es jedem, der das betreffende Gerät besitzt, ermöglicht, Ubuntu Touch darauf zu installieren und auszuführen, einschließlich der Möglichkeit, OTA-Updates zu erhalten, sobald diese verfügbar sind.
zh_hans: 完成此阶段后，您将使拥有相关设备的任何人都可以在设备上安装和运行 Ubuntu Touch，包括接收可用的 OTA 更新的能力。

source: The challenges of the porting process
de: Die Herausforderungen des Portierungsprozesses
zh_hans: 移植过程中的挑战

source: Getting the above components to work properly together always involves an amount of time-consuming configuring and testing. However, it usually also involves a certain amount of modification to parts of the source code, and sometimes quite a bit, depending on your target device.
de: Die oben genannten Komponenten dazu zu bringen, richtig zusammenzuarbeiten, ist immer mit einer Menge zeitaufwändiger Konfigurationen und Tests verbunden. In der Regel ist damit aber auch eine gewisse Modifikation von Teilen des Quellcodes verbunden, je nach Zielgerät manchmal sogar eine ganze Menge.
zh_hans: 让上述组件一起正常的工作总是涉及大量耗时的设置和测试工作。不过，这通常也涉及到对特定的部分源代码的一定程度的修改，有时甚至相当多，这取决于你的目标设备。

source: Luckily, there is a community of porters out there who are eager to see Ubuntu Touch ported to new devices. When you run into trouble, you should search the sources below (Getting help) to see if others before you have solved the issue. There are online Telegram chat groups you can join to ask for help, but please bear in mind that those participating are doing so in their spare time.
de: Glücklicherweise gibt es eine Gemeinschaft von Portierern, die sich dafür einsetzen, dass Ubuntu Touch auf neue Geräte portiert wird. Wenn Sie auf Probleme stoßen, sollten Sie in den Quellen unten (Hilfe erhalten) nachsehen, ob andere vor Ihnen das Problem gelöst haben. Es gibt Online-Telegram-Chatgruppen, denen Sie beitreten können, um um Hilfe zu bitten, aber bitte bedenken Sie, dass die Teilnehmer dies in ihrer Freizeit tun.
zh_hans: 幸运的是，这里有一个移植人员的社区，他们很乐意看到 Ubuntu Touch 被移植到新的设备上。当你遇到问题时，你应该检索以下来源（获取帮助）来看看是否有其他人遇到了相同的问题。这里还有一些 Telegram 聊天群组，你可以加入其中来寻求帮助，但请牢记，所有的参与者都是在他们的业余时间完成这些工作的。

source: Prior knowledge and skills
de: Vorkenntnisse und Fähigkeiten
zh_hans: 预备的知识和技能

source: Porters come in all sizes and shapes, so to speak. Therefore, this guide does not presuppose extensive knowledge or skills in any particular field. You should, however, as a bare minimum be familiar with some common shell commands and be comfortable working from the terminal on you host PC. Furthermore, the guide is based on a host PC running Linux. If you have some knowledge of programming, this will come in handy at some point, especially if you are familiar with C / C++. Also, you should familiarize yourself with git, setup a github account and start documenting your steps as described in this guide and `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html>`_ from the very beginning.
de: Porter gibt es in allen Größen und Formen, um es mal so auszudrücken. Daher setzt diese Anleitung keine umfassenden Kenntnisse oder Fähigkeiten in einem bestimmten Bereich voraus. Sie sollten jedoch mindestens mit einigen gängigen Shell-Befehlen vertraut sein und mit dem Terminal auf Ihrem Host-PC arbeiten können. Außerdem basiert die Anleitung auf einem Host-PC, auf dem Linux läuft. Wenn Sie einige Kenntnisse in der Programmierung haben, wird Ihnen das irgendwann nützlich sein, besonders wenn Sie mit C / C++ vertraut sind. Außerdem sollten Sie sich mit Git vertraut machen, ein Github-Konto einrichten und von Anfang an damit beginnen, Ihre Schritte zu dokumentieren, wie sie in dieser Anleitung und in der `Halium-Portierungsanleitung <http://docs.halium.org/en/latest/porting/first-steps.html>`_ beschrieben sind.
zh_hans: 可以说，移植工作者来自五湖四海，各有所长。因此，本指南并不预先假设任何特定领域的广泛知识或技能。但是，你应当至少对基本的 Shell 命令操作略有所知，并可以在你的主机上自如地使用终端。此外，这个指南是基于运行 Linux 的电脑主机。如果你对编程有所了解，特别是如果你对 C/C++ 编程很熟悉的话，接下来它将很有用。你也应该熟悉 git，建立一个 GitHub 账户，并从一开始记录下你的每个步骤，就像本指南和 `Halium 移植指南<http://docs.halium.org/en/latest/porting/first-steps.html>`_ 中描述的那样。

source: We have attempted to give a certain amount of explanations along the way, but this guide is in not an in-depth reference into architecture and inner workings of Ubuntu Touch, and gaining a deeper understanding will consequently require an amount of research on your part.
de: Wir haben versucht, ein gewisses Maß an Erklärungen mit auf den Weg zu geben, aber dieser Leitfaden ist keine tiefgehende Referenz für die Architektur und das Innenleben von Ubuntu Touch, und um ein tieferes Verständnis zu erlangen, ist folglich eine gewisse Recherche Ihrerseits erforderlich.
zh_hans: 我们试图附带着给出一定量的补充解释，但本指南并不是对 Ubuntu Touch 的架构和内部工作的深入参考，因此要获得更深入的理解，需要你自己做一定量的研究。

source: Getting community help
de: Hilfe der Community erhalten
es: Obtener ayuda de la comunidad
zh_hans: 获取社区帮助
zh_hant: 獲得社區幫助

source: When you run into trouble, and you will, refer to one or more of the sources below:
de: Wenn Sie auf Schwierigkeiten stoßen, und das werden Sie, beziehen Sie sich auf eine oder mehrere der unten aufgeführten Quellen:
zh_hans: 当你遇到麻烦时（你肯定会遇到的），请参考以下一个或多个来源：

source: `The UBports Forum <https://forums.ubports.com/category/33/porting>`_
de: `UBports Forum <https://forums.ubports.com/category/33/porting>`_
zh_hans: `UBports 论坛 <https://forums.ubports.com/category/33/porting>`_

source: General advice
de: Allgemeiner Hinweis
zh_hans: 一般性建议

source: The more rigorous you are at making notes and documenting your steps, the less time you will spend backtracking your steps and guessing your way along. When dealing with issues that arise along the way, it is wise to work on them one at a time. If you try to correct several things at once, you risk ending up trying to guess which changes solved a given issue, which easily leads to breaking the issue in question once more.
de: Je konsequenter Sie sich Notizen machen und Ihre Schritte dokumentieren, desto weniger Zeit werden Sie damit verbringen, Ihre Schritte zurückzuverfolgen und Ihren Weg zu erraten. Wenn Sie sich mit Problemen beschäftigen, die auf dem Weg auftauchen, ist es ratsam, diese nacheinander zu bearbeiten. Wenn Sie versuchen, mehrere Dinge auf einmal zu korrigieren, riskieren Sie, dass Sie am Ende versuchen zu erraten, welche Änderungen ein bestimmtes Problem gelöst haben, was leicht dazu führt, dass das betreffende Problem erneut auftaucht.
zh_hans: 你越是严谨地做笔记和记录你的步骤，你就越少花时间回溯你的步骤和猜测你自己原先干了什么。当处理遇到的问题时，明智的做法是一次解决一个问题。如果你试图一次解决几个问题，你最后可能搞不清楚是哪些修改解决了某一问题，这很容易导致本已修复的问题重现。

source: If you are not discouraged after reading this, we wish you the best of luck!
de: Wenn Sie nach der Lektüre nicht entmutigt sind, wünschen wir Ihnen viel Erfolg!
zh_hans: 如果你在看完以后并不感觉气馁，我们祝你好运！

source: Not all devices can be made to run Ubuntu Touch. Research your target device before you start.
de: Nicht alle Geräte können zum Ausführen von Ubuntu Touch gebracht werden. Recherchieren Sie Ihr Zielgerät, bevor Sie beginnen.
zh_hans: 并非所有设备都可以运行 Ubuntu Touch。在开始之前对您的目标设备需要做点研究。

source: To determine your device's specifications, search for it on `GSM Arena <https://www.gsmarena.com>`_ and/or `Device Specification <https://www.devicespecifications.com/en>`_.
de: Um die Spezifikationen Ihres Geräts zu ermitteln, suchen Sie danach auf `GSM Arena <https://www.gsmarena.com>`_ und/oder `Device Specification <https://www.devicespecifications.com/en>`_.
zh_hans: 要确定你的设备的规格，请在 `GSM Arena <https://www.gsmarena.com>`_ 或者 `Device Specification <https://www.devicespecifications.com/en>`_ 上搜索他。

source: Refer to the `Halium Porting Guide <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>`_ for further information on requirements and how to check if your device qualifies.
de: Weitere Informationen zu den Anforderungen und wie Sie überprüfen können, ob Ihr Gerät die Anforderungen erfüllt, finden Sie im `Halium Porting Guide <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>`_.
zh_hans: 参考 `Halium 移植指南 <http://docs.halium.org/en/latest/porting/first-steps.html#pick-an-android-target-device>`_ 以了解有关要求的进一步信息以及如何检查你的设备是否符合条件。

source: Locate relevant guides and other information
de: Suchen Sie relevante Anleitungen und andere Informationen
zh_hans: 查找相关指南和其他信息

source: If your desired target device complies to the above, the next thing to do is to locate the available guides and other documentation. This step will help you later on when you run into issues developing your port. For now, the main thing to look for is how to unlock your bootloader. (See below).
de: Wenn Ihr gewünschtes Zielgerät den oben genannten Anforderungen entspricht, müssen Sie als Nächstes die verfügbaren Anleitungen und andere Dokumentationen suchen. Dieser Schritt wird Ihnen später helfen, wenn Sie bei der Entwicklung Ihres Ports auf Probleme stoßen. Im Moment sollten Sie vor allem danach suchen, wie Sie Ihren Bootloader entsperren können. (Siehe unten).
zh_hans: 如果你想要的目标设备符合上述要求，你要做的下一件事是找到可用的指南和其他文档。这一步会在你之后的移植开发工作遇到问题时帮助你。现在，最主要的一件事是找到如何解锁你的 bootloader （见后续内容）。
