Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: Head over to the `LineageOS Wiki <https://wiki.lineageos.org/>`_. Look up your device and read and bookmark the guides that are listed there. Try a web search for additional information, specifying both its retail name and the code name you found on the LineageOS site. Be careful to check that the information you gather applies to your specific device, keeping in mind that many devices are sold in a number of different variants with different hardware specifications.
de: Besuchen Sie das `LineageOS-Wiki <https://wiki.lineageos.org/>`_. Suchen Sie nach Ihrem Gerät und lesen Sie die dort aufgeführten Anleitungen und setzen Sie ein Lesezeichen. Versuchen Sie eine Websuche für zusätzliche Informationen, indem Sie sowohl den Verkaufsnamen als auch den Codenamen angeben, den Sie auf der LineageOS-Website gefunden haben. Achten Sie darauf, dass die gesammelten Informationen auf Ihr spezifisches Gerät zutreffen, da viele Geräte in verschiedenen Varianten mit unterschiedlichen Hardware-Spezifikationen verkauft werden.
zh_hans: 前往 `LineageOS Wiki <https://wiki.lineageos.org/>`_. 找到你的设备，并且阅读并且给列出的指南加个书签。 尝试在网络上搜索额外的信息, 特别是他的零售型号以及 LineageOS 网站上给出的设备代号。要注意检查你收集到的信息是否适用于你的特定设备，要牢记，许多设备都有许多硬件规格不同变体（variants）出售。

source: Another rich source of information is the `XDA Developers Forum <https://www.xda-developers.com/>`_.
de: Eine weitere reichhaltige Informationsquelle ist das `XDA Developers Forum <https://www.xda-developers.com/>`_.
zh_hans: 另一个资源丰富的信息来源是 `XDA 开发者论坛 <https://www.xda-developers.com/>`_ 。

source: Unlock the bootloader
de: Entsperren des Bootloaders
zh_hans: 解锁 bootloader

source: Vendors usually provide their devices in a locked bootloader state. This is a kind of software "seal" intended to prevent modifications directly to the operating system and system software. If you unlock the bootloader, you will be able to make such modifications, but in this state your device's warranty might be void. The choice is yours, but this step is mandatory if you wish to install Ubuntu Touch on the device.
de: Die Hersteller liefern ihre Geräte meist in einem gesperrten Bootloader-Zustand aus. Dies ist eine Art Software-"Siegel", das Änderungen direkt am Betriebssystem und der Systemsoftware verhindern soll. Wenn Sie den Bootloader entsperren, können Sie solche Änderungen vornehmen, aber in diesem Zustand kann die Garantie Ihres Geräts erlöschen. Sie haben die Wahl, aber dieser Schritt ist zwingend erforderlich, wenn Sie Ubuntu Touch auf dem Gerät installieren möchten.
zh_hans: 供应商通常在锁定的引导程序状态下提供他们的设备。这是一种软件 "密封"，旨在防止直接修改操作系统和系统软件。如果你解锁引导程序，你将能够进行这样的修改，但在这种状态下，你的设备的保修可能是无效的。选择权在你，但如果你想在设备上安装 Ubuntu Touch，这一步骤是强制性的。

source: Devices differ and there is no general method that covers all makes and models. Therefore, you need to check the aforementioned guides for instructions on how to unlock the bootloader of your particular device.
de: Geräte unterscheiden sich und es gibt keine allgemeine Methode, die alle Marken und Modelle abdeckt. Daher müssen Sie in den oben genannten Anleitungen nachsehen, wie Sie den Bootloader Ihres speziellen Geräts entsperren können.
zh_hans: 设备不同，没有涵盖所有品牌和型号的通用方法。因此，你需要查看上述指南，了解如何解锁你的特定设备的引导程序。

source: Install TWRP recovery
de: TWRP-Wiederherstellung installieren
zh_hans: 安装 TWRP recovery

source: You need to install a custom recovery image on your device in order to handle formatting and flashing image files onto it. Head over to the `Team Win Recovery Project <https://twrp.me/Devices/>`_ and locate the image file for your device. Follow the installation instructions provided on the website.
de: Sie müssen ein benutzerdefiniertes Wiederherstellungsabbild auf Ihrem Gerät installieren, um die Formatierung und das Flashen von Bilddateien auf dem Gerät zu ermöglichen. Rufen Sie das `Team Win Recovery Project <https://twrp.me/Devices/>`_ auf und suchen Sie die Image-Datei für Ihr Gerät. Folgen Sie den Installationsanweisungen auf der Website.
zh_hans: 你需要安装一个定制的 recovery 镜像到你的设备是，从而能处理格式化并刷入镜像文件到设备上，前往 `Team Win Recovery Project <https://twrp.me/Devices/>`_ ，找到适合你的设备的图像文件。按照网站上提供的安装说明进行操作。

source: Recommendations for the host/build PC
de: Empfehlungen für den Host-/Build-PC
zh_hans: 对主机/编译用 PC 的建议

source: The remainder of this guide presumes you are using a build PC running Linux. Although high performance always is nice, stability and sufficient RAM and harddisk space are the main concerns here. You do not need the latest and the best hardware, nor do you need the latest distribution release. In fact, it is not uncommon to run into issues when choosing the very newest release, as some of the software needed may not yet have been built for it. For example, as of writing the latest release of Ubuntu Linux is 20.04, but many still recommend using the previous long term support release, 18.04.
de: Der Rest dieser Anleitung geht davon aus, dass Sie einen Build-PC mit Linux verwenden. Obwohl hohe Leistung immer schön ist, geht es hier vor allem um Stabilität und ausreichend RAM und Festplattenplatz. Sie brauchen weder die neueste und beste Hardware, noch brauchen Sie die neueste Version der Distribution. In der Tat ist es nicht ungewöhnlich, dass man auf Probleme stößt, wenn man die allerneueste Version wählt, da einige der benötigten Software noch nicht dafür gebaut wurde. Zum Beispiel ist die neueste Version von Ubuntu Linux 20.04, aber viele empfehlen immer noch die vorherige Long-Term-Support-Version, 18.04.
zh_hans: 本指南的其余部分假定你使用的是一台运行 Linux 的内置 PC。虽然高性能总是好的，但稳定性和足够的内存和硬盘空间是这里的主要关注点。你不需要最新、最好的硬件，也不需要最新的发行版。事实上，在选择最新的发行版时，遇到问题是很常见的，因为一些需要的软件可能还没有为该版本构建。例如，截至目前，Ubuntu Linux的最新版本是20.04，但许多人仍然建议使用以前的长期支持版本，即18.04。

source: Having completed the steps above, you are now ready to set up your build environment and start the porting process per se (next section).
de: Nachdem Sie die obigen Schritte durchgeführt haben, sind Sie nun bereit, Ihre Build-Umgebung einzurichten und den Portierungsprozess an sich zu starten (nächster Abschnitt).
zh_hans: 在完成上述步骤后，你现在已经准备好搭建你的编译环境并开始移植过程本身（下一章节）。

source: Configuring the UBports installer
de: Konfigurieren des UBports-Installationsprogramms
zh_hans: 设置 UBports installer

source: For the time being, Halium 7.1 porters should refer to the UBports porting notes on `the UBPorts installer and System image <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System-Image-(Halium-7.1)>`_.
de: Bis auf Weiteres sollten sich Halium-7.1-Portierer auf die UBPorts-Portierungshinweise zum `the UBPorts installer and System image <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System-Image-(Halium-7.1)>`_ beziehen.
zh_hans: 目前，Halium 7.1 的移植者应该参考 UBports 的移植说明 `the UBPorts installer and System image <https://github.com/ubports/porting-notes/wiki/HowTo:-UBports-Installer-&-System-Image-(Halium-7.1)>`_.

source: Building the images
de: Abbilder erzeugen
zh_hans: 构建镜像

source: A Halium 7.1 - Ubuntu Touch port consists of the following parts:
de: Ein Halium 7.1 - Ubuntu Touch Port besteht aus den folgenden Teilen:
zh_hans: 一个 Halium 7.1 - Ubuntu Touch 移植由以下部分组成：

source: The boot image, halium-boot.img
de: Das Boot-Image, halium-boot.img
zh_hans: 启动镜像，即“Halium-boot.img”

source: The system image, system.img
de: Das System-Image, system.img
zh_hans: 系统镜像，即"system.img"

source: The UBports - Ubuntu Touch - root file system (hereafter referred to as the *rootfs*)
de: Das UBports - Ubuntu Touch - Root-Dateisystem (im Folgenden als *rootfs* bezeichnet)
zh_hans: UBports - Ubuntu Touch - 根文件系统（以下简称*rootfs*）

source: The boot image contains the Linux kernel, the heart of the operating system, which needs to be built from source code for each specific device. The system image is also specific to the device and is similarly built from source code. The rootfs, on the other hand, is maintained by the UBports project and is downloadable in the form of a prebuilt .tar.gz bundle which is then installed together with the system.img.
de: Das Boot-Image enthält den Linux-Kernel, das Herzstück des Betriebssystems, das für jedes spezifische Gerät aus dem Quellcode erstellt werden muss. Das Systemabbild ist ebenfalls spezifisch für das Gerät und wird ebenfalls aus dem Quellcode erstellt. Das rootfs hingegen wird vom UBports-Projekt gepflegt und ist in Form eines vorgefertigten .tar.gz-Bündels herunterladbar, das dann zusammen mit dem system.img installiert wird.
zh_hans: 启动镜像包含 Linux 内核，是操作系统的核心，它需要为每个特定的设备从源代码中构建。系统镜像也是特定于设备的，同样也是从源代码中构建的。另一方面，rootfs 是由 UBports 项目维护的，可以以预先构建的 .tar.gz 包的形式下载，然后与 system.img 一起安装。

source: Build the Halium system image
de: Halium System-Image erzeugen

source: First you need to build the Halium system image according to the Halium porting guide. This is not a build you need to install. It is simply a preparation for the actual build for your port. In other words it a test to confirm that you have set up a viable source tree that can be used to do the final build.
de: Zuerst müssen Sie das Halium-Systemabbild gemäß der Halium-Portierungsanleitung erstellen. Dies ist kein Build, das Sie installieren müssen. Es ist einfach eine Vorbereitung für den eigentlichen Build für Ihren Port. Mit anderen Worten, es ist ein Test, um zu bestätigen, dass Sie einen brauchbaren "Source-Tree" erstellt haben, der für den endgültigen Build verwendet werden kann.
zh_hans: 首先，你需要根据 Halium 移植指南建立 Halium 系统镜像。这并不是你需要安装的构建。它只是为你的移植的实际构建做准备。换句话说，这是一个测试，以确认你已经建立了一个可行的源码树，可以用来做最终的构建。

source: Head over to `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html#set-up-your-build-device>`_ and follow the steps described there remembering that you are building Halium 7.1.
de: Gehen Sie zu `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html#set-up-your-build-device>`_ und folgen Sie den dort beschriebenen Schritten und denken Sie daran, dass Sie Halium 7.1 bauen.

source: Once the system image has been successfully built (without errors), you then know that your source tree is correctly set up to proceed. You then return here and proceed.
de: Wenn das Systemabbild erfolgreich (ohne Fehler) erstellt wurde, wissen Sie dann, dass Ihr Quellbaum korrekt eingerichtet ist, um fortzufahren. Sie kehren dann hierher zurück und fahren fort.
zh_hans: 一旦系统镜像成功建立（没有错误），你就知道你的源树已经正确设置好了，然后你可以回到这里，继续进行。

source: Build the images for Ubuntu Touch
de: Abbilder für Ubuntu Touch erzeugen
zh_hans: 为 Ubuntu Touch 构建镜像

source: With the file open, remove all ``context=`` options from all block devices in the file. The option will start at the text ``context=`` and end at the comma following it.
de: Entfernen Sie bei geöffneter Datei alle ``context=``` Optionen von allen Blockgeräten in der Datei. Die Option beginnt mit dem Text ``context=``` und endet mit dem Komma danach.
es: Con el archivo abierto, elimine todas las opciones ``context=`` de todos los dispositivos de bloque en el archivo. La opción comenzará en el texto ``context=`` y finalizará en la coma que lo sigue.
zh_hans: 打开文件后，从文件中的所有块设备中删除所有``context =``选项。 该选项将从文本``context =``开始，并以逗号后面的逗号结束。
zh_hant: 打開文件後，從文件中的所有塊設備中刪除所有 "context=" 選項。 該選項將從文本 "context=" 開始，並以英文逗號作為後面的結尾處結束。

source: For example, the line ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` should become ``ro,nosuid,nodev,barrier=0``
de: Zum Beispiel sollte die Zeile ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` zu ``ro,nosuid,nodev,barrier=0`` werden
es: Por ejemplo, la línea ``ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0`` debe convertirse en ``ro,nosuid,nodev,barrier=0``
zh_hans: 例如，这一行``ro，nosuid，nodev，context = u：object_r：firmware_file：s0，barrier = 0``应该变为``ro，nosuid，nodev，barrier = 0``
zh_hant: 例如:在字行中 "ro,nosuid,nodev,context=u:object_r:firmware_file:s0,barrier=0" 應該變為 "ro,nosuid,nodev,barrier=0"

source: Save and exit.
de: Speichern und beenden.
es: Guardar y salir.
zh_hans: 保存并退出。
zh_hant: 保存並退出。

source: Edit kernel config
de: Kernel-Konfiguration bearbeiten
es: Editar la configuración del núcleo
it: Modifica la configurazione del kernel
zh_hans: 修改内核配置
zh_hant: 編輯核心配置

source: You may have to do this twice. It will likely fix things both times. Then, run the script without the ``-w`` flag to see if there are any more errors. If there are, fix them manually. Once finished, run the script without the ``-w`` flag one more time to make sure everything is correct.
de: Dies muss man mitunter zwei Mal machen. Es korrigiert beide Male etwas. Dann führt man das Skript ohne ``-w``-Schalter aus, um zu sehen, ob es noch weitere Fehler gibt. Wenn ja, korrigiert man diese manuell. Sobald das erledigt ist, führt man das Skript erneut ``-w``-Schalter aus, um sicherzustellen, dass alles korrekt ist.
es: Puede que tenga que hacerlo dos veces. Seguramente arreglará el tema en ambas ocasiones. Luego, ejecute el guión («script») sin la bandera («flag») ``-w`` para ver si hay algún error más. Si lo hay, arréglelo manualmente. Una vez finalizado, ejecute el guión («script») sin la bandera («flag») ``-w`` una vez mas para asegurarse de que todo está correcto.
it: Devi farlo due volte. Dovrebbe risolvere in entrambe. Quindi, esegui lo script con il flag ``-w`` per vedere se c'è qualche altro errore. In caso ci fossero, risolvili manualmente. Una volta terminato, esegui lo script senza il flag ``-w`` di nuovo e accertati che ogni cosa sia corretta.
zh_hans: 你可能要做两次。 它可能会解决问题。 然后，运行没有`-w``标志的脚本，看看是否还有错误。 如果有，请手动修复它们。 完成后，再次运行不带“-w``标志的脚本，以确保一切正确。
zh_hant: 您可能需要兩次這樣做。 它可能會解決問題。 然後，執行沒有 "-w" 標誌的腳本，看看是否還有錯誤。 如果有，請手動修復它們。 完成後，再次運行不帶 "-w" 標誌的腳本，以確保一切正確。

source: Ubuntu Touch requires setting console=tty0
de: Ubuntu Touch erfordert die Einstellung console=tty0
zh_hans: Ubuntu Touch 需要设置 console=tty0

source: The halium-boot initramfs expects ``/dev/console`` to be a console device and will not start init if it is not available. This is commonly the case on recent devices, because they either have UART disabled or ``console=`` is not specified (null) by default. This can be fixed by supplying ``console=tty0`` as the last argument in the kernel cmdline. To achieve this, proceed as follows:
de: Das halium-boot initramfs erwartet, dass ``/dev/console`` ein Konsolengerät ist und wird init nicht starten, wenn es nicht verfügbar ist. Dies ist bei neueren Geräten häufig der Fall, da sie entweder UART deaktiviert haben oder ``console=`` standardmäßig nicht angegeben ist (null). Dies kann behoben werden, indem man ``console=tty0`` als letztes Argument in der Kernel-Cmdline angibt. Um dies zu erreichen, gehen Sie wie folgt vor:
zh_hans: halium-boot initramfs 希望 ``/dev/console``是一个控制台设备，如果它不存在，就不会启动 init。这种情况通常发生在最近的设备上，因为它们要么禁用了 UART，要么默认没有指定 `console=``（为空）。这可以通过提供 ``console=tty0`` 作为内核 cmdline 的最后一个参数来解决。要做到这一点，请按以下步骤操作：

source: It should be done in the makefile named ``BoardConfig.mk`` (or ``BoardConfigCommon.mk``) located in the root directory of your device tree, e.g. ``~/halium/device/<vendor>/<model_codename>/BoardConfig.mk``
de: Dies sollte in der Makefile mit dem Namen ``BoardConfig.mk`` (oder ``BoardConfigCommon.mk``) geschehen, die sich im Hauptverzeichnis Ihres Gerätebaums befindet, z.B. ``~/halium/device/<vendor>/<model_codename>/BoardConfig.mk``
zh_hans: 这应该在一个在你的设备树根目录下名为 ``BoardConfig.mk`` (or ``BoardConfigCommon.mk``) 的 makefile 文件中完成，例如 ``~/halium/device/<vendor>/<model_codename>/BoardConfig.mk``

source: Add the following line::
de: Fügen Sie folgende Zeile ein::
zh_hans: 添加如下行：

source: If your makefile already includes a line beginning with ``BOARD_KERNEL_CMDLINE``, you may add it just below that to keep things tidy.
de: Wenn Ihr Makefile bereits eine Zeile enthält, die mit ``BOARD_KERNEL_CMDLINE`` beginnt, können Sie sie der Ordnung halber direkt darunter einfügen.
zh_hans: 如果你的 makefile 已经包含了 ``BOARD_KERNEL_CMDLINE`` 开头的行，你可以把它加在下面，以保持整洁。

source: The above method, although the preferred one, may not work for some Samsung devices. The result will be that you cannot get access to the device through ssh after boot, and Unity 8 will not be able to start. If you run into this problem, you can specify the setting in your device's kernel config file instead. Add the following lines::
de: Die obige Methode ist zwar die bevorzugte, funktioniert aber möglicherweise bei einigen Samsung-Geräten nicht. Das Ergebnis wird sein, dass Sie nach dem Booten keinen Zugriff auf das Gerät über ssh erhalten und Unity 8 nicht starten kann. Wenn Sie auf dieses Problem stoßen, können Sie die Einstellung stattdessen in der Kernelkonfigurationsdatei Ihres Geräts festlegen. Fügen Sie die folgenden Zeilen hinzu::
zh_hans: 上述方法虽然是首选，但对某些三星设备可能不适用。其结果是，启动后你无法通过ssh访问设备，Unity 8也无法启动。如果你遇到这个问题，你可以在设备的内核配置文件中指定设置来代替。添加以下几行：

source: In rare cases the bootloader overwrites the kernel command line argument, rendering the setting above useless. This is the case for the Google Pixel 3a (sargo). To deal with this issue, replicate `this commit <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>`_.
de: In seltenen Fällen überschreibt der Bootloader das Kernel-Befehlszeilenargument, wodurch die obige Einstellung unbrauchbar wird. Dies ist der Fall für das Google Pixel 3a (sargo). Um dieses Problem zu beheben, replizieren Sie `this commit <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>`_.
zh_hans: 在极少数情况下，bootloader会覆盖内核命令行参数，使上面的设置失去作用。谷歌Pixel 3a（sargo）就属于这种情况。要处理这个问题，请依照`这个commit <https://github.com/fredldotme/android_kernel_google_bonito/commit/d0741dded3907f2cf4ecdc02bfcb74fc252763ff>`_ 。

source: Build halium-boot.img and system.img
de: Halium-boot .img und system.img erzeugen

source: You are now ready to build the two image files to incorporate the changes you have made. These changes have an impact on both the boot image and the system image, so you will need to rebuild both. The procedure is a simple and straight forward one. Run the sequence of commands below, where BUILDDIR is the root of your halium source tree (e.g. ``~/halium``):
de: Sie können nun die beiden Abbilddateien erstellen, um die von Ihnen vorgenommenen Änderungen zu übernehmen. Diese Änderungen wirken sich sowohl auf das Boot-Image als auch auf das System-Image aus, sodass Sie beide neu erstellen müssen. Das Verfahren ist einfach und geradlinig. Führen Sie die folgende Befehlssequenz aus, wobei BUILDDIR die Wurzel Ihres Halium-Quellbaums ist (z.B. ``~/halium``):
zh_hans: 现在你已经准备好建立这两个镜像文件，以应用你所做的改变。这些变化对启动镜像和系统镜像都有影响，所以你需要重构这两个镜像。这个过程是一个简单而直接的过程。运行下面的命令序列，其中 BUILDDIR 是你的halium源码树的根（例如：``~/halium`` ）：

source: Troubleshooting the build process
de: Fehlerbehebung beim Build-Prozess
zh_hans: 构建过程的故障排除

source: Refer to the `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_
de: Siehe `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_
zh_hans: 参考 `Halium 移植指南 <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_

source: Common errors
de: Häufige Fehler

source: Known issues when building the images for UT
de: Bekannte Probleme beim Erstellen der Images für UT
zh_hans: 为 UT 构建镜像时的已知问题

source: Some known issues you may encounter when building the boot and system images are described in the `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_.
de: Einige bekannte Probleme, die beim Erstellen der Boot- und System-Images auftreten können, sind im `Halium porting guide <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_ beschrieben.
zh_hans: 在构建和启动系统镜像时，你可能遇到的一些已知问题，在 `Halium 移植指南 <http://docs.halium.org/en/latest/porting/build-sources.html#documented-errors>`_ 中有所提及。

source: Known issues with initial boot
de: Bekannte Probleme beim ersten Booten
zh_hans: 已知的初始化启动问题

source: The following are some of the known issues you may encounter in connection with the initial boot process.
de: Nachfolgend sind einige der bekannten Probleme aufgeführt, die im Zusammenhang mit dem ersten Startvorgang auftreten können.
zh_hans: 以下是你可能遇到的与初始化启动过程有关的一些已知问题。

source: SSH hangs when trying to connect
de: SSH hängt sich auf, wenn versucht wird, eine Verbindung herzustellen
es: SSH se cuelga mientras intenta conectar
zh_hans: 尝试连接时 SSH 挂起
zh_hant: 嘗試連接時 SSH 掛載

source: The SSH connection may hang indefinitely when trying to connect. Attempts to stop the connection with Control-C may or may not return you to a shell prompt. If you run ``ssh -vvvv phablet@10.15.19.82``, you only get the following output before the program stops::
de: Die SSH-Verbindung kann beim Verbindungsaufbau auf unbestimmte Zeit hängen bleiben. Der Versuch, die Verbindung mit Control-C zu beenden, kann dazu führen, dass Sie zu einem Shell-Prompt zurückkehren. Wenn Sie ``ssh -vvvvvv phablet@10.15.19.82`` ausführen, erhalten Sie nur die folgende Ausgabe, bevor das Programm stoppt::
es: La conexión SSH se puede colgar indefinidamente cuando intenta conectar. Intentar parar la conexión con «Control-C» puede, o no, devolverle al cursor del intérprete de órdenes. Si ejecuta `ssh -vvvv phablet@10.15.19.82``, sólo obtendrá la siguiente salida antes de que el programa se detenga::
zh_hans: 尝试连接时，SSH连接可能会无限期挂起。 尝试停止与Control-C的连接可能会也可能不会返回到shell提示符。 如果你运行``ssh -vvvv phablet @ 10.15.19.82``，你只能在程序停止之前得到以下输出::
zh_hant: 嘗試連接時，SSH 連接可能會無限期掛載。 嘗試停止與 Control-C 的連接可能會也可能不會返回到 shell 提示符。 如果你執行 "ssh -vvvv phablet @ 10.15.19.82"，你只能在程序停止之前獲得以下輸出::

source: This seems to be a common error on arm64 devices with kernel 3.10 when rsyslogd is enabled. If you have this error, please add your voice to `ubports/ubuntu-touch#560`_ and then try the following workaround:
de: Dies scheint ein häufiger Fehler auf arm64-Geräten mit Kernel 3.10 zu sein, wenn rsyslogd aktiviert ist. Wenn Sie diesen Fehler haben, melden Sie sich bitte bei `ubports/ubuntu-touch#560`_ und versuchen Sie dann den folgenden Workaround:
es: Este parece ser un error común de los dispositivos arm64 con núcleo 3.10 cuando rsyslogd está habilitado. Si tiene este error, comuníquelo en `ubports/ubuntu-touch#560`_ y después intente el siguiente método alternativo:
zh_hans: 启用rsyslogd时，这似乎是内核3.10的arm64设备上的常见错误。 如果您有此错误，请将您的声音添加到`ubports / ubuntu-touch＃560`_然后尝试以下解决方法：
zh_hant: 當啟用 rsyslogd 時，這似乎是 3.10 的 arm64 核心裝置上的常見錯誤。 如果您有此錯誤，請將您的聲音添加到 "ubports / ubuntu-touch＃560"_ 然後嘗試以下解決方法：

source: Reboot the device to recovery and connect with ``adb shell``
de: Starten Sie das Gerät neu ins Recovery und verbinden Sie es mit ``adb shell``
es: Reinicie el dispositivo al modo de recuperación («recovery») y conéctelo con ``adb shell``
zh_hans: 重新启动设备进入恢复模式并连接“adb shell”
zh_hant: 重新啟動裝置來恢復並連接 "adb shell"

source: Run the following commands to disable rsyslogd::
de: Führen Sie folgende Befehle aus, um rsyslog zu deaktivieren::
es: Ejecute las siguientes órdenes para desactivar rsyslogd::
zh_hans: 运行以下命令来禁用 rsyslogd::
zh_hant: 執行以下命令禁用 rsyslogd ::

source: You may now reboot the device. You should be able to connect to SSH once it comes back online.
de: Du kannst das Gerät nun neu starten. Du solltest in der Lage sein, dich mit SSH zu verbinden, sobald es wieder eingeschaltet ist.
es: Ahora puede reiniciar el dispositivo. Debería de ser capaz de conectar por SSH una vez que vuelva a estar en línea.
zh_hans: 您现在可以重启设备。 一旦重新联机，您应该能够连接到 SSH。
zh_hant: 您現在可以重啟裝置。 一旦重新上線，您應該能夠連接到 SSH。

source: Device reboots after a minute
de: Das Gerät startet nach einer Minute neu
es: El dispositivo se reinicia después de un minuto
zh_hans: 一分钟后设备重启
zh_hant: 裝置在一分鐘後重新開機
