Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: All of these settings are guessed by Unity 8 if none are set. There are many cases, however, where the guess is wrong (for example, very high resolution phone displays will be identified as desktop computers). To manually set a value for these variables, simply create a file at ``/etc/ubuntu-session.d/[codename].conf`` specifying them. For example, this is the file for the Nexus 7 tablet::
es: Todas estas configuraciones son supuestas por Unity 8 si no hay ninguna configurada. Hay muchos casos, sin embargo, donde la suposición es errónea (por ejemplo, pantallas de teléfono con una resolución muy alta serán identificadas como ordenadores de escritorio). Para configurar manualmente un valor para estas variables, simplemente cree un archivo en ``/etc/ubuntu-session.d/[codename].conf`` especificándolos. Por ejemplo, este es el archivo para la tableta Nexus 7::
it: A tutte queste impostazioni Unity 8 assegna valori ipotetici se nessuna di queste è impostata. Esistono tuttavia molti casi in cui la supposizione è errata (ad esempio, i display del telefono ad altissima risoluzione verranno identificati come computer desktop). Per impostare manualmente un valore a queste variabili, bisogna semplicemente creare un file in ``/etc/ubuntu-session.d/[codename].conf`` con i valori scelti. Per esempio, questo è il file per il tablet Nexus 7::
zh_hant: 如果沒有設置，Unity 8 會猜測所有這些設置。 然而，在許多情況下，猜測是錯誤的（例如，非常高畫質的電話顯示器將被識別為桌上型電腦）。 要手動設定這些變量的值，只需在 "/etc/ubuntu-session.d/ [codename] .conf" 中創建一個指定它們的文件。 例如: 這是Nexus 7平板電腦的文件::

source: Methods for deriving values for these variables are below.
es: Los métodos para obtener los valores para estas variables están mas adelante.
it: I metodi per derivare i valori per queste variabili si trovano qui sotto.
zh_hant: 導出這些變量的值的方法如下。

source: There are two other settings that may be of interest to you.
es: Hay otras dos configuraciones que le pueden ser de interés.
it: Ci sono altre due impostazioni che potrebbero interessarti.
zh_hant: 您可能還有兩個其他設置。

source: ``FORM_FACTOR`` specifies the device's form factor. This value is set as the device's Chassis, which you can find by running ``hostnamectl``. The acceptable values are ``handset``, ``tablet``, ``laptop`` and ``desktop``. Apps such as the gallery use this information to change their functionality. For more information on the Chassis, see `the freedesktop.org hostnamed specification`_.
es: ``FORM_FACTOR`` especifica el factor de forma del dispositivo. Este valor está configurado como el chasis del dispositivo («Chassis»), el cuál puede encontrar ejecutando ``hostnamectl``. Los valores aceptables son ``handset``, ``tablet``, ``laptop`` y ``desktop``. Aplicaciones como la galería usan esta información para cambiar sus características. Para mas información sobre el chasis, vea `the freedesktop.org hostnamed specification`_.
it: ``FORM_FACTOR`` specifica il fattore di forma. Il valore èconfigurato alla maniera dello chassis del dispositivo, che si può trovare eseguendo ``hostnamectl``. I valori accettabili sono ``cuffie``, ``tablet``,``computer portatile`` e ``computer da tavolo``. Applicazioni come la galleria usano questa informazione per modificare le proprie funzionalità. Per maggiori informazioni sullo chassis, vai a `freedesktop.org hostnamed specification`_ (specifiche del nome dei dispositivi su freedesktop.org).
zh_hant: "FORM_FACTOR" 指定裝置規格。 此值設置為設備的機箱，您可以通過運行 "hostnamectl" 找到它。可接受的值是 "mobile"，"tablet"， "laptop" 和 "desktop"。 圖庫等應用使用此信息來更改其功能。 有關機箱的更多信息，請參閱 "freedesktop.org 主機名規範"。

source: If you have any errors while performing these steps, check see if any of the following suggestions match what you are seeing. If you have completed these steps successfully, congratulations! You've reached the end of the porting guide for now. Try to check the functionality of your device by following the Smoke Testing information in :doc:`/contribute/quality-assurance`.
es: Si tiene algún error durante la realización de estos pasos, compruebe si alguna de las siguientes sugerencias encaja con lo que está viendo. Si ha completado estos pasos con éxito ¡enhorabuena! Ha alcanzado el final de la guía de portado por ahora. Intente comprobar el funcionamiento de su dispositivo siguiendo la información de las pruebas de humo en :doc:`/contribute/quality-assurance`.
zh_hant: 如果您在執行這些步驟時遇到任何錯誤，請檢查以下任何建議是否與您所看到的相符。 如果您已成功完成這些步驟，恭喜！ 你現在已經到了移植指南的末尾了。 嘗試按照以下網址中的煙霧測試信息檢查裝置的功能 :doc: "/ contribution / quality-assurance"。

source: ``source build/envsetup.sh``
zh_hant: "源碼構建/envsetup.sh"

source: Building ubports-boot
it: Creazione del boot di ubports (ubports-boot)

source: Ubuntu Touch uses Upstart rather than Systemd for its init daemon. Because of this, it is not fully Halium-compatible and is not able to use the vanilla hybris-boot that Halium produces. For this reason, we need to build ubports-boot.
it: Ubuntu Touch usa Upstart piuttosto che Systemd per i sui demoni di init. Perciò, è completamente compatibile con Halium, ma non è possibile usare il hybris-boot convenzionale che creati con Halium. Per questa ragione, abbiamo bisogno di creare un ubports-boot.

source: Add source to Halium tree
it: Aggiungi i sorgenti all'albero di Halium

source: The first thing that needs to be done is adding the ubports-boot source to your Halium tree. You may choose to do this by adding it to your local manifests (recommended) or simply cloning it in place.
it: La prima cosa che bisogna fare è aggiungere i sorgenti di ubports-boot all'albero di Halium.Si può scegliere di farlo aggiungendo il proprio manifesto locale (soluzione raccomandata) o semplicemente clonandolo in loco.

source: Add to local manifest
it: Aggiungi il manifesto locale

source: Create a new file in ``.repo/local_manifests`` called ``ubports-boot.xml``. Add the following to the file:
it: Crea un nuovo file in ``.repo/local_manifests`` chiamato ``ubports-boot.xml``. Aggiungigli quanto segue:

source: Now, just do a ``repo sync`` to download the new source.
it: Ora, esegui ``repo sync`` per scaricare i nuovi sorgenti.

source: Manual clone
it: Clonazione manuale

source: You may also choose to clone the `ubports-boot repository <https://github.com/ubports/ubports-boot>`_ into your tree manually. It should be placed into ``BUILDDIR/halium/ubports-boot``.
it: Puoi pure scegliere di clonare manualmente `il repository di ubports-boot <https://github.com/ubports/ubports-boot>`_ nel proprio albero. Dovresti metterlo in ``BUILDDIR/halium/ubports-boot``.

source: If you share your code and build instructions, please note that you've done this.
it: Se condividi il tuo codice e le istruzioni per creare il boot, evidenzia che lo hai fatto in questo modo.

source: Include in build system
it: Includi nel build system (sistema di creazione)

source: The android build system won't know where to find ubports-boot normally. To fix this, open the file ``BUILDDIR/build/core/main.mk`` in a text editor. Find the comment ``# Specific projects for Halium`` and add ``halium/ubports-boot`` to the list of ``subdirs`` ::
it: Il sistema di creazione di android (android build system) normalmente non saprà dove trovare ubports-boot. Per risolverlo, apri il file ``BUILDDIR/build/core/main.mk`` con un editor di testo. Identifica il commento ``# Specific projects for Halium`` (# Progetti specifici per Halium) e aggiungi ``halium/ubports-boot`` nella lista delle ``subdirs`` ::

source: This is a workaround for `ubports/ubports-boot #1 <https://github.com/ubports/ubports-boot/issues/1>`_ and `ubports/ubports-boot #2 <https://github.com/ubports/ubports-boot/issues/2>`_. It should not be considered a permanent fix. Be prepared to revert this later when these bugs have been fixed.
it: Questa è una scappatoia `ubports/ubports-boot #1 <https://github.com/ubports/ubports-boot/issues/1>`_ e `ubports/ubports-boot #2 <https://github.com/ubports/ubports-boot/issues/2>`_. Non dovrebbe essere considerata una soluzione permanente. Preparati per tornarci indietro quando questi bachi siano stati risolti.

source: The initramfs of the ubports-boot image takes a commandline parameter, ``datapart=``, which points it to the block device that is normally mounted at ``/data`` in Android. This parameter is automatically embedded into the image at build time by finding ``/data`` in your device's default fstab and using its source. Unfortunately, this source is generally a node in ``/dev/block/bootdevice/by-name`` or something else strange, which is only available in an Android initramfs. To fix this, Halium uses the fixup-mountpoints script, which you are probably familiar with by now.
it: Il comando initramfs dell'immagine di ubports-boot prende come parametro, ``datapart=``, che punta al block device (dispositivo a blocchi) che è normalmente montato in ``/data`` in Android. Tale parametro è integrato automaticamente nell'immagine al momento della creazione una volta che nell'fstab predefinito si trovi ``/data`` e si usi il suo sorgente.. Purtroppo, questo sorgente è in genere un nodo nel ``/dev/block/bootdevice/by-name`` o qualche altra strana cosa, che è solo disponibile nell'initramfs di Android. Per risolverlo, Halium usa uno script fixup-mountpoints (per ovviare al problema dei punti di montaggio), che da ora ti diventerà familiare.

source: The ubports-boot initramfs does not use the fixup-mountpoints script, nor does it put block devices in the proper place for mounting without modification. For this reason, we are going to have to edit your device's fstab.
it: L'initramfs di ubports-boot non usa lo script di fixup-mountpoints (per risolvere il punto di montaggio), nemmeno mette i block devices (dispositivi a blocchi) nel punto corretto per montarli senza modifiche. Per ciò, dovreno modificare l'fstab del proprio dispositivo.

source: With the file open, change the ``src``, or first attribute, of the ``/data`` mountpoint to what you put in fixup-mountpoints for ``/data``, but without the ``/block`` folder. For example, on the Moto G5 Plus, the block device is ``/dev/block/mmcblk0p54``, so I put ``/dev/mmcblk0p54`` in this place. Also change the type to ext4, if it is not already.
it: Una volta aperto, cambiagli ``src``, o il primo attributo, del punto di montaggio di ``/data`` con quello deche si è precisato nel fixup-mountpoints (soluzione del punto di montaggio) di ``/data``, ma senza la cartella ``/block``. Ad esempio, nel Moto G5 Plus, il block device (dispositivo a blocchi) è ``/dev/block/mmcblk0p54``, pertanto si metterà ``/dev/mmcblk0p54`` in questo posto. Inoltre cambia il tipo di file di sistema in ext4, qualora non fosse così.

source: Now, remove all ``context=`` options from all block devices in the file. Save and exit.
it: A questo punto, rimuovi tutte le occorrenze delle opzioni ``context=`` dai block devices (dispositivi a blocchi) del file. Salvalo e esci.

source: For an example of this, see `this commit on universalsuperbox/android_device_motorola_potter <https://github.com/UniversalSuperBox/android_device_motorola_potter/commit/9b574967e3a6f07884760b418befe731ccfcb924>`__. Removing the ``wait`` flag is not required and was an accident.
it: Per esempio, guarda `questo commit di universalsuperbox/android_device_motorola_potter <https://github.com/UniversalSuperBox/android_device_motorola_potter/commit/9b574967e3a6f07884760b418befe731ccfcb924>`_. Rimuovi i flag ``wait`` che non sono necessari e sono rimasti per sbaglio.

source: Edit init.rc
it: Modifica init.rc

source: Some Android services conflict with ofono in 16.04 and will cause your device to reboot without warning, about 30-60 seconds after it boots. We will need to disable these services until the issue is resolved.
it: Alcuni dei servizi di Android vanno in conflitto con ofono nella versione 16.04 e provocheranno un riavvio del dispositivo senza preavviso, 30-60 secondi dopo l'avvio. Avremo bisogno di disabilitarli finchè il problema non sia stato risolto.

source: To do this, open up your device's default ``init.rc`` (this is likely init.qcom.rc or init.[codename].rc), comment out any ``import`` statements, and add ``disabled`` to services like rild, qti, and others that interface with the radio. Most of them have a ``user radio`` line. For an example, see `commit 7875b48b on UniversalSuperBox/android_device_motorola_potter <https://github.com/UniversalSuperBox/android_device_motorola_potter/commit/7875b48b5b6f240935d7f327d33128e952a3589b>`__
it: Per farlo, apri l'``init.rc`` predefinito del dispositivo (potrebbe essere init.qcom.rc o init.[codename].rc), commenta tutte le occorrenze di ``import``, e aggiungi ``disabled`` ai servizi come rild, qti, e simili che si interfacciano con il dispositivo cellulare. La maggior parte ha una linea con ``user radio`` (utente radio). Ad esempio, guarda il `commit 7875b48b on UniversalSuperBox/android_device_motorola_potter <https://github.com/UniversalSuperBox/android_device_motorola_potter/commit/7875b48b5b6f240935d7f327d33128e952a3589b>`_

source: Ubuntu Touch requires a slightly different kernel config than Halium, including enabling Apparmor. Luckily, we have a nice script for this purpose, ``check-kernel-config``. It's included in the ubports-boot repository. Simply run it on your config as follows::
it: Ubuntu Touch richiede una configurazione del kernel leggermente diversa rispetto a Halium, incluso abilitare Apparmor. Per fortuna, c'è uno script carino a tal proposito, ``check-kernel-config``. È includo nel repository di ubports-boot. Semplicemente eseguilo in questo modo ::

source: Once ubports-boot is in place, you can build it quite simply. You will also need to rebuild system.img due to our changes.
it: Una volta che ubports-boot è a punto, puoi crear l'immagine piuttosto semplicemente. Dovrai pure ricreare l'immagine system.img per i cambi che si è fatto.

source: Now that you have ubports-boot built, you can move on to :doc:`installing-16-04`.
it: Ora che hai costruito ubports-boot, puoi spostarti al :doc:`installing-16-04`.

source: Now that you've :doc:`built ubports-boot <building-ubports-boot>`, we'll use a script called ``rootstock-touch-install`` to install an Ubuntu Touch rootfs on your device.
it: Ora che hai :doc:`creato ubports-boot <building-ubports-boot>`, useremo lo script chiamato ``rootstock-touch-install`` per installare il filesystem rootfs di Ubuntu Touch sul tuo dispositivo.

source: Install ubports-boot
it: Installazione di ubports-boot

source: We'll need to install the ubports-boot image before installing an image. Reboot your phone into fastboot mode, then do the following from your Halium tree::
it: Avremo bisogno di installare ubports-boot prima di installare una immagine. Riavvia il tuo telefono in modalità fastboot, quindi esegui quanto segue dall'albero di Halium::

source: Download the rootstock-touch-install script from `universalsuperbox/rootstock-ng <https://github.com/universalsuperbox/rootstock-ng/tree/xenial-actuallyfixit>`_. Boot your device into recovery and run the script as follows::
it: Scarica lo script rootstock-touch-install da `universalsuperbox/rootstock-ng <https://github.com/universalsuperbox/rootstock-ng/tree/xenial-actuallyfixit>`_. Avvia il tuo dispositivo in modalità recovery (ripristino) e esegui lo script nel seguente modo::

source: The script will copy and extract the files to their proper places, then allow you to set the phablet user's password. If it gets all the way to ``rebooting device`` and doesn't seem to produce any errors, it's time to continue to the next step. If something goes wrong, please get in touch with us. If your device doesn't reboot automatically, reboot it using your recovery's interface.
it: Lo script copierà e estrarrà i file nel posto giusto, quindi ti permetterà di scegliere la parola di accesso dell'utente phablet. Se ti appare ``rebooting device`` (riavvia il dispositivo) e non sembra che ti appaiano errori, è ora di passare al passo successivo. Se qualcosa andasse male, contattaci. Se il dispositivo non si riavviasse automaticamente, riavvialo con la tua interfaccia di recovery (ripristino).

source: If you get errors similar to ``broken pipe`` or ``out of memory``, use the ``-b`` option to push the busybox or toybox build that came from your tree. These may have fewer bugs than your recovery's busybox. More information about this option is available in the script's README.
it: Se trovassi errori come ``broken pipe`` o ``out of memory``, usa l'opzione ``-b`` per inviare busybox o toybox già compilati che si trovano nel tuo albero. Potrebbero avere meno bachi rispetto a quella del sistema di ripristino. Si possono trovare più informazioni per questa opzione nel LEGGIMI (README) dello script.

source: To confirm that your device has booted correctly, run ``dmesg -w`` and watch for "GNU/Linux device" in the output. If you instead get something similar to "ubports initrd i hit a nail", please get in contact with us so we can find out why. You may also choose to run ``watch ip link`` and look for changes in network devices.
it: Per essere certo che il tuo dispositivo abbia eseguito un avvio corretto, esegui ``dmesg -w`` e cerca occorrenze di "GNU/Linux device". Se trovassi qualcosa tipo "ubports initrd i hit a nail", contattaci per poter capire il perchè. Puoi pure scegliere di eseguire ``watch ip link`` e cercare cambi nei dispositivi di rete.

source: Similar to the Halium reference rootfs, you should set your computer's IP on the newly connected RNDIS interface to ``10.15.19.100`` if you don't get one automatically. Then, run the following to access your device::
it: Simile al filesystem rootfs di riferimento di Halium, dovresti configurare l'indirizzo IP del tuo computer perchè si colleghi con l'interfaccia RNDIS del dispositivo con ``10.15.19.100``, a meno di ottenerne uno automaticamente. Quindi, esegui il seguente comando per accedere al dispositivo::

source: The password will be the one that you set while running rootstock.
it: La parola di accesso sarà quella che hai usato in rootstock.

source: Make / writeable
it: Rendilo/scrivibile

source: Before we make any changes to the rootfs (which will be required for the next step), you'll need to remount it with write permissions. To do that, run the following command::
it: Prima di fare qualsiasi cambio in rootfs (che sarà necessario per il passo successivo), avrai bisogno di rimontarlo coi permessi di scrittura. Per farlo, esegui il comando che segue::

source: Now that you're logged in, you must create some udev rules to allow Ubuntu Touch software to access your hardware. Run the following command, replacing [codename] with your device's codename.::
it: Ora che sei entrato nel sistema, devi creare le regole di udev per permettere ai programmi di Ubuntu Touch di accedere al tuo hardware. Esegui il seguente comando, sostituendo [codename] con il nome in codice del tuo dispositivo::

source: This should be a little heavier on "What to do when something goes wrong" content.
it: Potrebbe essere un po' pesante il contenuto di "What to do when something goes wrong" ("Cosa fare se qualcosa è andato storto").

source: If you are looking for information on installing Ubuntu Touch on a supported device, or if you would like to check if your device is supported, please see `this page <https://ubports.com/page/get-ubuntu-touch>`_.
it: Se stai cercando informazioni su come installare Ubuntu Touch su un dispositivo supportato, o per comprovare che il tuo è supportato, vedi `questa pagina <https://ubports.com/page/get-ubuntu-touch>`_.

source: Start at :doc:`building-ubports-boot` if you'd like to install the UBports Ubuntu Touch 16.04 rootfs.
it: Inizia con il documento :doc:`building-ubports-boot` se vuoi installare il filesystem rootfs Ubuntu Touch 16.04 di UBports.

source: A reference device has been chosen from which we derive the values for all other devices. The reference device is a laptop with a 120ppi screen. However, there is no exact formula since these options are set for *perceived* size rather than *physical* size . Here are some values for other devices so you may derive the correct one for yours:
it: È stato scelto un dispositivo di riferimento dal quale ricaviamo i valori per tutti gli altri dispositivi. Il dispositivo di riferimento è un laptop con uno schermo da 120ppi. Tuttavia, non esiste una formula esatta poiché queste opzioni sono impostate per la dimensione * percepita * anziché * per quella fisica *. Ecco alcuni valori per altri dispositivi in modo da poterne ricavare il valore corretto per il tuo:
