Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/porting.po
Languages: de, es, it, zh_hans, zh_hant

source: For the time being, refer to the UBports porting notes on `the generic system image (GSI) <https://github.com/ubports/porting-notes/wiki/Generic-system-image-(GSI)>`_ and `Halium 9 porting <https://github.com/ubports/porting-notes/wiki/Halium-9>`_.
de: In der Zwischenzeit sollten Sie die UBports-Portierungshinweise zum `generischen Systemabbild (GSI) <https://github.com/ubports/porting-notes/wiki/Generic-system-image-(GSI)>`_ und zur `Portierung von Halium 9 <https://github.com/ubports/porting-notes/wiki/Halium-9>`_ beachten.
zh_hans: 就目前而言，请参考UBports关于 `通用系统镜像（GSI）<https://github.com/ubports/porting-notes/wiki/Generic-system-image-(GSI)>`_ and `Halium 9 移植 <https://github.com/ubports/porting-notes/wiki/Halium-9>`_.

source: Android version
zh_hans: 安卓版本

source: Halium version
zh_hans: Halium版本

source: `Telegram: @ubports_porting <https://t.me/ubports_porting>`_
zh_hans: Telegram: @ubports_porting

source: *Work in progress*
zh_hans: *正在进行的工作*

source: Building UBports recovery
zh_hans: 构建 UBports recovery

source: Fix mount points
zh_hans: 修复挂载点

source: Install and debug initial boot
zh_hans: 安装并调试初始化引导

source: These steps will wipe **all** of the data on your device. If there is anything that you would like to keep, ensure it is backed up and copied to a safe location before continuing.
zh_hans: 这些步骤将清除你设备上**所有**数据。如果有任何你想保留的东西，请确保在继续之前将其备份并复制到一个安全的地方。

source: Now that you have built halium-boot, you are ready to install Ubuntu Touch on your device.
zh_hans: 现在你已经构建了 halium-boot，你已经准备好在你的设备上安装 Ubuntu Touch。

source: Building halium-boot
es: Construyendo halium-boot
zh_hant: 構建 halium-boot

source: Halium-boot is a new proposed boot image in the Halium project, replacing hybris-boot. We will be building and using it for Ubuntu Touch.
es: Halium-boot es una nueva propuesta de imagen de arranque en el proyecto Halium, reemplazando hybris-boot . Lo construiremos y lo usaremos para Ubuntu Touch.
zh_hant: Halium-boot 是 Halium 項目中新提出的啟動映像，取代了 hybris-boot。 我們將為 Ubuntu Touch 構建和使用它。

source: Fix mounts
es: Arreglar los problemas de montaje
it: Risolvi i problemi di montaggio
zh_hant: 修復掛載

source: Halium-boot's ``mount`` is not aware of SELinux contexts. If your device's ``fstab`` file includes any contexts, the partition that they are on will fail to mount and your port will not work correctly.
es: El punto de montaje (``mount``) de halium-boot no está al corriente de los contextos de SELinux. Si el archivo ``fstab`` de su dispositivo incluye algún contexto, la partición en la que está fallará al ser montada y su portado no funcionará correctamente.
zh_hant: Halium-boot 的 "掛載" 不知道 SELinux 上下文。 如果您的裝置的 "fstab" 文件包含任何上下文，則它們所在的分區將無法安裝，並且您的端口將無法正常工作。

source: The first step to this process is figuring out where your fstab actually is. For most, this is inside ``BUILDDIR/device/MANUFACTUER/CODENAME/rootdir/etc`` and it is named either ``fstab.qcom`` or ``fstab.devicename``. Open the file for editing.
es: El primer paso de este proceso es averiguar donde está su fstab. En la mayoría de casos está dentro de ``BUILDDIR/device/MANUFACTUER/CODENAME/rootdir/etc`` y se llama o ``fstab.qcom`` o ``fstab.devicename``. Abra el archivo para editarlo.
it: Il primo passo per questo processo è quello di identificare l'ubicazione di fstab. Nella maggioranza dei casi, si trova in ``BUILDDIR/device/MANUFACTUER/CODENAME/rootdir/etc`` e si chiama o ``fstab.qcom`` o ``fstab.devicename``. Apri il file per modificarlo.
zh_hant: 這個過程的第一步是確定你的 fstab 實際上在哪裡。 對於大多數人來說，這是在 "BUILDDIR/device/MANUFACTUER/CODENAME/rootdir/etc" 裡面，它被命名為 "fstab.qcom" 或 "fstab.devicename"。 打開文件進行編輯。

source: If the type of the 'data' or 'userdata' partition is ``f2fs``, it is required to change it to ``ext4``.
es: Si el tipo de partición de «data» o «userdata» es ``f2fs`` tendrá que cambiarlo por ``ext4``.
zh_hant: 如果 "data" 或 "userdata" 分區的類型是 "f2fs"，則需要更改為 "ext4"。

source: Ubuntu Touch requires a slightly different kernel config than Halium, including enabling Apparmor. Luckily, we have a nice script for this purpose, ``check-kernel-config``. It's included in the halium-boot repository. Simply run it on your config as follows::
es: Ubuntu Touch necesita una configuración del núcleo ligeramente distinta a la de Halium, incluyendo la activación de Apparmor. Afortunadamente tenemos un buen «script» (guión) para este propósito, ``check-kernel-config``. Está incluido en el repositorio de halium-boot. Simplemente ejecútelo en su configuración así::
zh_hant: Ubuntu Touch 需要與 Halium 略有不同的核心配置，包括啟用 Apparmor。 幸運的是，我們有一個很好的腳本用於此目的，"check-kernel-config"。 它包含在 halium-boot 存儲庫中。 只需在您的配置上執行它，如以下::

source: Build the image
es: Construir la imagen
it: Crea l'immagine
zh_hant: 構建映像

source: Once halium-boot is in place, you can build it quite simply. You will also need to rebuild system.img due to our changes.
es: Una vez que halium-boot está en su lugar, puede construirlo sencillamente. También necesitará reconstruir system.img debido a nuestros cambios.
zh_hant: 一旦啟動了 halium-boot，您就可以非常簡單地構建它。 由於我們有經過一些更改，您還得需要重建 system.img。

source: ``cd`` to your Halium BUILDDIR
es: ``cd`` a su BUILDDIR de Halium
it: ``cd`` nella BUILDDIR di Halium
zh_hant: 使用 "cd" 來引到你的 Halium BUILDDIR

source: Run ``breakfast`` or ``lunch``, whichever you use for your device
es: Ejecute ``breakfast`` o ``lunch``, cual sea el que use en su dispositivo
it: Esegui ``breakfast`` o ``lunch``, in funzione di quello che usi per il tuo dispositivo
zh_hant: 執行 "breakfast" 或 "lunch"，無論您使用哪種裝置

source: Continue on
es: Continúe en
it: Continua
zh_hant: 繼續在

source: Now that you have halium-boot built, you can move on to :doc:`installing-16-04`.
es: Ahora que tiene construido halium-boot, puede ir a :doc:`installing-16-04`.
zh_hant: 現在您已經構建了 halium-boot，您可以到 :doc: "安裝-16-04"。

source: Common installation problems
es: Problemas comunes de la instalación
zh_hant: 常見的安裝問題

source: This page details problems commonly faced while following the :doc:`installing-16-04` page.
es: Esta página detalla los problemas que se encuentran normalmente mientras se sigue la página :doc:`installing-16-04`.
zh_hant: 此頁面詳細說明了遵循 :doc: "安裝-16-04" 頁面時常遇到的問題。

source: Common problems when running Ubuntu Touch
es: Problemas comunes cuando se ejecuta Ubuntu Touch
zh_hant: 執行 Ubuntu Touch 時常見的問題

source: This page details problems commonly faced while following the :doc:`running-ut` page.
es: Esta página detalla los problemas que se encuentran comúnmente mientras se sigue la página :doc:`running-ut`.
zh_hant: 此頁面詳細說明了遵循 :doc: "running-ut"頁面時常遇到的問題。

source: If nothing is showing on screen even after adding udev rules to your port, it is likely that you have a problem with graphical applications crashing. See `Mir servers crash`_ for more information.
es: Si no se muestra nada en la pantalla incluso después de añadir reglas udev a su portado, es probable que tenga un problema con las aplicaciones gráficas que se cierran inesperadamente. Vea `Mir servers crash`_para mas información.
zh_hant: 如果即使在向端口添加 udev 規則後屏幕上也沒有顯示任何內容，則可能是圖形應用程式崩潰時出現問題。 有關詳細訊息，請參閱 "Mir 伺服器崩潰"。

source: Mir servers crash
es: Cierres inesperados del servidor Mir
zh_hant: Mir 伺服器崩潰

source: If you do not get ``State: RUNNING``, the container is stopped. You can run ``sudo start lxc-android-config`` to attempt to start it. If the container does not start after that, you can run ``sudo lxc-start -n android -F`` to get a more detailed log of why it has failed.
es: Si no obtiene ``State: RUNNING``, el contenedor está detenido. Puede ejecutar ``sudo start lxc-android-config`` para intentar arrancarlo. Si el contenedor no comienza tras esto, puede ejecutar ``sudo lxc-start -n android -F`` para obtener un registro mas detallado sobre por qué ha fallado.
zh_hant: 如果你沒有得到 "State：RUNNING"，容器就會停止。 你可以運行 "sudo start lxc-android-config" 來嘗試啟動它。 如果容器在此之後沒有啟動，你可以運行 "sudo lxc-start -n android -F" 來獲得更詳細的失敗原因日誌。

source: Installing Ubuntu Touch 16.04 images on Halium
es: Instalando imágenes de Ubuntu Touch 16.04 en Halium
it: Installazione delle immagini di Ubuntu Touch 16.04 su Halium
zh_hant: 在 Halium 上安裝 Ubuntu Touch 16.04 映像

source: These steps will wipe **all** of the data on your device. If there is anything that you would like to keep, ensure it is backed up and copied off of the device before continuing.
es: Estos pasos borrarán **todos** los datos en su dispositivo. Si hay algo que desee mantener, asegúrese de que tiene una copia de seguridad fuera de su dispositivo antes de continuar.
it: Questi passi cancelleranno **tutti** i dati sul dispositivo. Se ci fosse qualcosa che volessi mantenere, assicurati di averlo salvato e copiato fuori dal dispositivo prima di continuare.
zh_hant: 這些步驟 將清除您裝置上的 **所有** 數據。 如果您要保留任何內容，請確保在繼續之前先做好備份並從裝置中複製出來。

source: Now that you've :doc:`built halium-boot <building-halium-boot>`, we're ready to install Ubuntu Touch on your device.
es: Ahora que tiene :doc:`construido hallium-boot <building-halium-boot>`, estamos preparados para instalar Ubuntu Touch en su dispositivo.
zh_hant: 現在您已經 :doc: "built halium-boot <building-halium-boot>"，我們已準備好在您的裝置上安裝 Ubuntu Touch。

source: In order to install Ubuntu Touch, you will need a recovery with Busybox, such as TWRP, installed on your phone. You will also need to ensure the /data partition is formatted with ext4 and does not have any encryption on it.
es: Para poder instalar Ubuntu Touch, necesitará una recuperación con Busybox, tal como TWRP, instalado en su teléfono. También necesitará asegurarse de que la partición «/data» está formateada en «ext4 » y no está cifrada.
it: Per installare Ubuntu Touch, avrai bisogno che sia installato un sistema di recovery (ripristino) con Busybox, come TWRP, sul tuo dispositivo. Inoltre avrai bisogno che la partizione /data sia stata formattata con ext4 e che sia stata crittografata.
zh_hant: 要安裝 Ubuntu Touch，您需要透過手機上安裝的 Busybox 進行恢復，例如 TWRP。 您還需要確保 / data 分區使用 ext4 格式化，並且沒有任何加密。

source: Install halium-boot
es: Instalación de halium-boot
zh_hant: 安裝 halium-boot

source: We'll need to install the halium-boot image before installing an image. Reboot your phone into fastboot mode, then do the following from your Halium tree::
es: Necesitaremos instalar la imagen de hallium-boot antes de instalar una imagen. Reinicie su teléfono en modo «fastboot», después haga lo siguiente desde su árbol de Halium::
zh_hant: 我們需要在安裝映像之前安裝 halium-boot 映像。 重新啟動手機進入快速啟動模式，然後從 Halium 樹中執行以下操作::

source: Download the rootfs
es: Descargar el «rootfs» (sistema de archivos raíz)
it: Scarica rootfs
zh_hant: 下載 rootfs

source: Next we'll need to download the rootfs (root filesystem) that's appropriate for your device. Right now, we only have one available. Simply download ``ubports-touch.rootfs-xenial-armhf.tar.gz`` from `our CI server <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__. If you have a 64-bit ARM (aarch64) device, this same rootfs should work for you. If you have an x86 device, let us know. We do not have a rootfs available for these yet.
es: A continuación necesitaremos descargar el «rootfs» (sistema de archivos raíz) adecuado para su dispositivo. Ahora mismo solo tenemos uno disponible. Simplemente descargue ``ubports-touch.rootfs-xenial-armhf.tar.gz`` desde `nuestro servidor CI <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__. Si tiene un dispositivo ARM de 64-bit (aarch64), este mismo «rootfs» debería servirle. Si tiene un dispositivo x86, díganoslo. No tenemos un «rootfs» disponible para estos aún.
it: Ora, abbiamo bisogno di scaricare il rootfs (contrazione di "root filesystem") adatto al tuo dispositivo. Al momento, è disponibile soltanto uno. Scarica ``ubports-touch.rootfs-xenial-armhf.tar.gz`` dal `nostro server CI <https://ci.ubports.com/job/xenial-rootfs-armhf/>`__. Se possiedi un dispositivo ARM a 64-bit (aarch64), è possibile utilizzare il medesimo rootfs. Se possiedi un dispositivo x86, ti preghiamo di contattarci. Al momento non abbiamo alcun rootfs disponibile per tale architettura.
zh_hant: 接下來，我們需要下載適合您裝置的 rootfs（根文件系統）。 現在，我們只有一個可用。 只需從 "我們的 CI 伺服器<https://ci.ubports.com/job/xenial-rootfs-armhf/>"__下載 "ubports-touch.rootfs-xenial-armhf.tar.gz"。 如果你有一個64位ARM（aarch64）裝置，這個相同的 rootfs 應該適合你。 如果您有 x86 裝置，請告訴我們。 我們還沒有可用的 rootfs。

source: Todo
es: Por hacer

source: Change the rootstock link to point to UBports once the actuallyfixit PR is merged.
es: Cambie el enlace de «rootstock» para que apunte a UBports una vez que la petición de incorporación («PR») de «actuallyfixit» se ha realizado.
it: Cambia il link di rootstock per puntare a UBports una volta che sia stato includo l'actuallyfixit PR.
zh_hant: 一旦合併了 actualfixit PR，將 rootstock 鏈接更改為指向為 UBports。

source: Download the halium-install-standalone script from `jbbgameich/halium-install's releases <https://github.com/JBBgameich/halium-install/releases/>`_ (`direct link to download <https://github.com/JBBgameich/halium-install/releases/download/continuous/halium-install-standalone.sh>`__). Boot your device into recovery and run the script as follows::
es: Descargue el «script» (guión) de halium-install-standalone desde `jbbgameich/halium-install's releases <https://github.com/JBBgameich/halium-install/releases/>`_ (`enlace directo a la descarga <https://github.com/JBBgameich/halium-install/releases/download/continuous/halium-install-standalone.sh>`__). Inicie su dispositivo en modo recuperación y ejecute los guiones como sigue::
zh_hant: 從 "jbbgameich / halium-install的發行版 <https://github.com/JBBgameich/halium-install/releases/>"_下載 halium-install-standalone 腳本（"直接連接到 <https://github.com/JBBgameich/halium-install/releases/download/continuous/halium-install-standalone.sh>"__）。 將裝置引導至恢復並執行腳本，如以下::

source: The script will copy and extract the files to their proper places, then allow you to set the phablet user's password.
es: El «script» (guión) copiará y extraerá los archivos a los lugares adecuados, después le permitirá poner la contraseña del usuario «phablet».
zh_hant: 該腳本將文件複製並解壓縮到適當的位置，然後允許您設置 phablet 用戶的密碼。

source: When your device boots, it will likely stay at the bootloader screen. However, you should also get a new network connection on the computer you have it plugged in to. We will use this to debug the system.
es: Cuando su dispositivo se inicia, seguramente se mantendrá en la pantalla de arranque. Sin embargo, debería tener también una nueva conexión de red en el ordenador al que está conectado. Usaremos esto para depurar el sistema.
it: Quando il dispositivo si avvia, è opportuni rimanere nella schermata di bootloader. Comunque, potresti pure avere una connessione di rete con il computer a cui sei collegato. La useremo per fare il debug del sistema.
zh_hant: 當您的裝置啟動時，它可能會停留在引導加載程序螢幕上。 但是，您還應該在插入的電腦上獲得新的網絡連接。 我們將使用它來偵錯系統。

source: To confirm that your device has booted correctly, run ``dmesg -w`` and watch for "GNU/Linux device" in the output. If you instead get something similar to "Halium initrd Failed to boot", please get in contact with us so we can find out why.
es: Para confirmar que su dispositivo se ha iniciado correctamente, ejecute ``dmesg -w`` y esté atento a «GNU/Linux device» en la salida. Si en vez de ello le aparece algo parecido a «Halium initrd Failed to boot», póngase en contacto con nosotros para que podamos descubrir el motivo.
zh_hant: 要確認您的設備已正確啟動，請運行 "dmesg -w" 並在輸出中注意 "GNU / Linux device"。 如果您反而得到類似 "Halium initrd無法啟動" 的內容，請與我們聯繫，以便我們找到原因。

source: Similar to the `Halium reference rootfs <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>`__, you should set your computer's IP on the newly connected RNDIS interface to ``10.15.19.100`` if you don't get one automatically. Then, run the following to access your device::
es: Parecido al `sistema de archivos raíz de referencia de Halium <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>`__, debería establecer la IP de su ordenador en la nueva interfaz RNDIS como ``10.15.19.100`` si no la obtiene automáticamente. Luego, ejecute lo siguiente para acceder a su dispositivo::
zh_hant: 類似於 "Halium reference rootfs <http://docs.halium.org/en/latest/porting/debug-build/logging-in.html>"__，您應該在新連接的 RNDIS 接口上設置電腦的IP "10.15.19.100" 如果你沒有自動獲得一個。 然後，運行以下命令以訪問您的裝置::

source: Common Problems
es: Problemas comunes
zh_hant: 常見問題

source: If you have any errors while performing these steps, check see if any of the following suggestions match what you are seeing. If you have installed successfully, skip down to `Continue on`_.
es: Si tiene errores durante la realización de estos pasos, compruebe si alguna de las siguientes sugerencias encajan con lo que está viendo. Si ha instalado con éxito, salte a `Continue on`_.
zh_hant: 如果您在執行這些步驟時遇到任何錯誤，請檢查以下任何建議是否與您所看到的相符。 如果已成功安裝，請 "繼續"__。

source: Congratulations! Ubuntu Touch has now booted on your device. Move on to :doc:`running-ut` to learn about more specific steps you will need to take for a complete port.
es: ¡Enhorabuena! Ubuntu Touch ha arrancado ahora en su dispositivo. Pase a :doc:`running-ut` para aprender sobre los pasos mas específicos que necesitará hacer para un portado completo.
it: Congratulazioni! Ubuntu Touch si è avviato sul tuo dispositivo. Spostati su :doc:`running-ut` per imparare di piu sui passi per realizzare un port completo.
zh_hant: 恭喜！ Ubuntu Touch 現已在您的設備上啟動。 轉到 :doc: "running-ut"，了解完整端口需要採取的更具體步驟。

source: Porting information
es: Información sobre portado
it: Informazioni sul porting
zh_hant: 移植訊息

source: If you are looking for information on installing Ubuntu Touch on a supported device, or if you would like to check if your device is supported, please see `this page <https://devices.ubuntu-touch.io/>`_.
es: Si está buscando información sobre como instalar Ubuntu Touch en un dispositivo soportado, o si le gustaría comprobar si su dispositivo está soportado, vea `esta página <https://devices.ubuntu-touch.io/>`_.
zh_hant: 如果您正在尋找有關在支持的裝置上安裝 Ubuntu Touch 的訊息，或者您想檢查您的設備是否受支持，請參閱 "此頁面<https://devices.ubuntu-touch.io/>"_。

source: This section will introduce you to some of the specifics of porting Ubuntu Touch to an Android device.
es: Esta sección le presentará alguna de las particularidades de portar Ubuntu Touch a un dispositivo Android.
it: Questa sezione ti introdurrà a alcune specificità del porting di Ubuntu Touch su un dispositivo Android.
zh_hant: 本節將向您介紹如何 Ubuntu Touch 移植到 Android 裝置的一些細節。

source: Before you begin, you'll want to head over to `the Halium porting guide <http://docs.halium.org/en/latest/porting/first-steps.html>`_ and get your ``systemimage`` built without errors. Once you're at the point of installing a rootfs, you can come back here.
es: Antes de que comience, querrá ir a `la guía de migración de Halium <http://docs.halium.org/en/latest/porting/first-steps.html>`_ y conseguir construir su ``systemimage`` sin errores. Una vez que haya llegado al punto de instalar un «rootfs» (sistema de archivos raíz), puede volver aquí.
it: Prima di iniziare, è meglio dare un'occhiata alla `guida dei porting di Halium <http://docs.halium.org/en/latest/porting/first-steps.html>`_ e ottenere la tua ``systemimage`` (immagine di sistema) senza errori. Una volta che sei arrivato all'installazione del filesystem rootfs, potrai ritornare a questo punto.
zh_hant: 在開始之前，您將要轉到 "Halium 移植指南 <http://docs.halium.org/en/latest/porting/first-steps.html>"_ 並獲取您的 "systemimage" 建立沒有錯誤。 一旦你正在安裝 rootfs，你可以回到這裡。

source: Start at :doc:`building-halium-boot` if you'd like to install the UBports Ubuntu Touch 16.04 rootfs.
es: Comience en :doc:`building-halium-boot` si quiere instalar el sistema de archivos raíz («rootfs») de UBports Ubuntu Touch 16.04.
zh_hant: 如果你想安裝 UBports Ubuntu Touch 16.04 rootfs，請從 :doc: "building-halium-boot" 開始。

source: If you're having trouble with the porting steps after building your Halium systemimage, check out the "Common Problems" section of the page you're stuck on. If none of the suggestions are helpful, you can get help from the community via the following channels:
es: Si está teniendo problemas con los pasos del portado después de construir la imagen de su sistema Halium, eche un vistazo a la sección de «Problemas comunes» en la que se encuentre bloqueado. Si ninguna de las sugerencias es de utilidad, puede obtener ayuda de la comunidad por medio de los siguientes canales:
zh_hant: 如果您在構建 Halium 系統映像後遇到移植步驟的問題，請查看您遇到的頁面的 "常見問題" 部分。 如果這些建議都沒有幫助，您可以通過以下通道獲得社區的幫助：

source: IRC: #ubports-porting on freenode
es: IRC: #ubports-porting en freenode
zh_hant: IRC: #ubports-porting 在 freenode

source: Forum: `forums.ubports.com <https://forums.ubports.com>`__
es: Foro: `forums.ubports.com <https://forums.ubports.com>`__
zh_hant: 論壇: "forums.ubports.com <https://forums.ubports.com>"__

source: Running Ubuntu Touch
es: Ejecutando Ubuntu Touch
it: Esecuzione di Ubuntu Touch
zh_hant: 執行 Ubuntu Touch

source: Now that you're logged in, there are a few more steps before Ubuntu Touch will be fully functional on your device.
es: Ahora que ha iniciado sesión, hay algunos pasos más antes de que Ubuntu Touch sea completamente funcional en su dispositivo.
zh_hant: 現在您已經登入，在 Ubuntu Touch 在您的裝置上完全正常運行之前還有一些步驟。

source: Before we make any changes to the rootfs (which will be required for the next steps), you'll need to remount it with write permissions. To do that, run the following command::
es: Antes de que hagamos algún cambio al «rootfs» (que será necesario para los siguientes pasos), necesitará montarlo de nuevo con permisos de escritura. Para hacer esto, ejecute la siguiente orden::
zh_hant: 在我們對 rootfs 進行任何更改之前（後續步驟將需要這些更改），您需要使用寫入權限來重新安裝它。 為此，請執行以下命令::

source: When the device boots, you'll probably notice that everything is very small. There are two variables that set the content scaling for Unity 8 and Ubuntu Touch applications: ``GRID_UNIT_PX`` and ``QTWEBKIT_DPR``.
es: Cuando el dispositivo arranca, probablemente notará que todo es muy pequeño. Hay dos variables que configuran el escalado del contenido para las aplicaciones de Unity 8 y de Ubuntu Touch: ``GRID_UNIT_PX`` y ``QTWEBKIT_DPR``.
it: Quando il dispositivo si avvia, probabilmente vedrai che tutto è molto piccolo. Ci sono due variabili che regolano il riimensionamento del contenuto di Unity 8 e delle applicazioni Ubuntu Touch: ``GRID_UNIT_PX`` e ``QTWEBKIT_DPR``.
zh_hant: 當裝置啟動時，您可能會注意到一切都很小。 有兩個變量設置 Unity 8 和 Ubuntu Touch 應用程式的內容縮放："GRID_UNIT_PX" 和 "QTWEBKIT_DPR"。

source: There are also some other options available that may be useful for you depending on your device's form factor. These are discussed below.
es: Hay también otras opciones disponibles que pueden ser útiles dependiendo del factor de forma de su dispositivo. Se discuten mas adelante.
it: Ci sono anche altre opzioni disponibili che possono essere utili in base al fattore di forma del tuo dispositivo. Sono discusse in seguito.
zh_hant: 根據您裝置的規格尺寸，還有其他一些可能對您有用的選項。 這些將在下面討論。
