Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: If you select DOWNLOAD ONLY rather than FIRMWARE UPGRADE, you will end up with a useless brick rather than a fancy Ubuntu Touch device. Be sure to select FIRMWARE UPGRADE.
de: Wird DOWNLOAD ONLY statt FIRMWARE UPGRADE ausgewählt, bleibt ein nutzloses, zerstörtes Gerät zurück anstelle eines schicken Ubuntu Touch Gerätes. Stellen Sie deshalb sicher, dass FIRMWARE UPGRADE ausgewählt wurde.
pl: Jeśli wybrałeś/aś DOWNLOAD ONLY zamiast FIRMWARE UPGRADE, skończysz z bezużyteczną cegłą zamiast z urządzeniem działąjącym na Ubuntu Touch. Bądź pewny/a, że zaznaczyłeś/aś FIRMWARE UPGRADE.

source: Also, after selecting the ``*Android_scatter.txt``, the drop-down menu choice is reset to DOWNLOAD ONLY. Be sure to select it after selecting the file.
de: Bitte beachten Sie, dass nach der Auswahl der Datei ``*Android_scatter.txt`` die Drop-Down Menü Auswahl auf DOWNLOAD ONLY zurückgesetzt wird. Stellen Sie sicher, erst nach der Auswahl der Datei FIRMWARE UPGRADE zu selektieren.
pl: Także, po zaznaczeniu ``*Android_scatter.txt``, wybór w menu zostaje zresetowany do DOWNLOAD ONLY. Bądź pewny/a, aby to zaznaczyć po wybraniu tego pliku.

source: Turn your device completely off, but do not connect it yet.
de: Schalten Sie Ihr Gerät vollständig aus, aber verbinden Sie es noch nicht.
nb: Slå enheten din helt av, men ikke koble den til ennå.
pl: Kompletnie wyłącz twoje urządzenie, ale nie odłączaj go jeszcze.

source: Press the button labeled "Download".
de: Auf den Button mit der Aufschrift "Download" klicken.
nb: Trykk på knappen merket "Last ned".
pl: Naciśnij przycisk z napisem "Pobierz".

source: Perform a final sanity-check that you selected the "Firmware Upgrade" option, not "Download Only".
de: Führen Sie einen finale Plausibilitätsprüfung durch, um sicherzustellen, dass die "Firmware Upgrade"-Option gewählt wurde und nicht "Download Only".
pl: Wykonaj ostatni test bezpieczeństwa czy zaznaczyłeś/aś opcje "Firmware Upgrade", nie "Download Only".

source: Make sure your device is off and connect it to your PC. Don't use a USB 3.0 port, since that's known to cause communication issues with your device.
de: Sicherstellen, dass das Gerät ausgeschaltet ist und dann mit dem Rechner verbinden. Keine USB 3.0 Schnittstelle verwenden, weil damit Kommunikationsprobleme auftreten können.
nb: Forsikre deg om at enheten er slått av, og koble den til PC-en din. Ikke bruk en USB 3.0-port, siden det er kjent at det forårsaker kommunikasjonsproblemer med enheten din.
pl: Upewnij się, że twoje urządzenie jest wyłączone i podłączone do komputera. Nie używaj portu USB 3.0, ponieważ może to powodować problemy z komunikacją z twoim urządzeniem.

source: `Magic <https://en.wikipedia.org/wiki/Clarke's_three_laws>`_ happens. Wait till all the progress bars ended.
de: `Magie <https://en.wikipedia.org/wiki/Clarke's_three_laws>`_ geschieht. Warten Sie, bis alle Fortschrittsbalken abgeschlossen sind.
pl: `Czary <https://en.wikipedia.org/wiki/Clarke's_three_laws>`_ mary. Poczekaj, aż proces się zakończy.

source: If the installation fails with a 100% red bar and hangs there (and logs says something like ``COM port is open. Trying to sync with the target...``), remove the ``modemmanager`` package as the one installed `is not compatible <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ with SP flash tool, close it and try again from step 4.
de: Wenn die Installation mit einem 100% roten Fortschrittsbalken fehlschlägt und dort hängt (und im Log etwas steht wie ``COM port is open. Trying to sync with the target...``), entfernen Sie das ``modemmanager`` Paket, da das installierte `inkompatibel mit dem SP flash tool ist <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ , schließen Sie es und beginnen Sie erneut ab Schritt 4.
pl: Jeśli instalacja zatrzyma się na czerwonym paski na 100% (i logi będą mówiły coś jak ``COM port is open. Trying to sync with the target...``), usuń pakiet ``modemmanager`` jako, że ten zainstalowany `nie jest kompatybilny <https://web.archive.org/web/20180118130643/http://www.mibqyyo.com/en-articles/2015/09/16/ubuntu-android-installation-process-for-bq-aquaris-e4-5-and-e5/>`_ z narzędziem SPI flash, zamknij to i spróbuj od nowa od etapu 4.

source: Congratulations! Your device will now boot into a super old version of Ubuntu Touch. You can now use the UBports Installer to install an updated version.
de: Glückwunsch! Das Gerät startet nun eine super veraltete Version von Ubuntu Touch. Sie können nun den UBports Installer verwenden, um eine aktualisierte Version zu installieren.
nb: Gratulerer! Enheten din vil nå starte opp i en eldgammel versjon av Ubuntu Touch. Du kan nå bruke UBports-installasjonsprogrammet til å installere en oppdatert versjon.
pl: Gratulacje! Twoje urządzenie bootuje teraz do bardzo starej wersji Ubuntu Touch. Możesz teraz użyć Instalatora UBports, żeby zainstalować nowszą wersje.

source: Time to first fix
de: Zeit bis zum ersten Fixpunkt
nb: På tide å først fikse

source: `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_: ``ubports-installer-<version-number>.exe``
de: `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_: ``ubports-installer-<Versions-Nummer>.exe``

source: `macOS <https://devices.ubuntu-touch.io/installer/?package=dmg>`_: ``ubports-installer-<version-number>.dmg``
de: `macOS <https://devices.ubuntu-touch.io/installer/?package=dmg>`_: ``ubports-installer-<Versions-Nummer>.dmg``

source: Fairphone 2 Vendor-ID
de: Fairphone 2 Hersteller-ID
nb: Fairphone 2 Leverandør-ID

source: You need then to transfer your public key to your device. There are multiple ways to do this. These are a few options:
nb: Du må da overføre den offentlige nøkkelen til enheten. Det er flere måter å gjøre dette på. Dette er noen få alternativer:

source: To identify the ip-address of your UT device , open Terminal application in your phone and run the following command::
nb: For å identifisere ip-adressen til UT-enheten din, åpne Terminal-applikasjonen på telefonen og kjør følgende kommando:

source: The output is a list of IP addresses separated by spaces . Use the first IP address from the list.
nb: Utgangen er en liste over IP-adresser atskilt med mellomrom. Bruk den første IP-adressen fra listen.

source: `askubuntu.com: How can I access my Ubuntu phone over ssh? <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041>`_
ca: `askubuntu.com: Com puc accedir el meu telefon Ubuntu a través del ssh? (en anglès) <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041>`_
es: `askubuntu.com: ¿Cómo puedo acceder a mi teléfono Ubuntu usando ssh? <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041>`_
nb: `askubuntu.com: Hvordan får jeg tilgang til Ubuntu-telefonen min via ssh? <https://askubuntu.com/questions/348714/how-can-i-access-my-ubuntu-phone-over-ssh/599041#599041> `_

source: Please do **not** start the installer with ``sudo``. It is meant to be run as a normal user, not as root. Using the installer with sudo will mess up permissions in the installer's cached files and lead to problems down the road. If the installer does not recognize your device, check the troubleshooting information below.
nb: Vennligst **ikke** start installasjonsprogrammet med ``sudo``. Det er ment å kjøres som en vanlig bruker, ikke som root. Å bruke installasjonsprogrammet med sudo vil ødelegge tillatelsene i installasjonsprogrammets hurtigbuffrede filer og føre til problemer på veien. Hvis installasjonsprogrammet ikke gjenkjenner enheten din, kan du sjekke feilsøkingsinformasjonen nedenfor.

source: For Windows, grab the command-line tools only package from `here <https://developer.android.com/studio/index.html#downloads>`_.
ca: Per a Windows, agafeu el paquet sols amb eines de línia d'ordres d' `aquí <https://developer.android.com/studio/index.html#downloads>`_.
es: Para Windows, consiga las herramientas solo para línea de órdenes de `aquí <https://developer.android.com/studio/index.html#downloads>`_.

source: CalDAV and CardDAV are protocols to syncronize calendars and contacts with a remote server. Many email-hosters provide a CalDAV and CardDAV interface.
ca: El CalDAV i el CardDAV són protocols per sincronitzar calendaris i contactes amb un servidor remot. Mols allotjadors de correu electrònic proveeixen una interficiía CalDAV o CardDAV.

source: At the moment, there is no carddav implemention directly accessible from the Ubuntu Touch graphical user-interface, so the only way to sync carddav is by using syncevolution + cron. However, there is a simple way to do that with a script that you can run in the terminal or via phablet SSH connection. These instructions work for caldav as well.
ca: En aquest moment no hi ha cap implementació carddav directament accessible des de la interfície gràfica d'usuari de l'Ubuntu Touch, de manera que l'única manera de sincronitzar el carddav és usant syncevolution + cron. Tanmateix, hi ha una una manera senzilla de fer això amb un script que podeu executar a la terminal o via una connecció SSH de phablet. Aquestes instruccions també funcionen per al caldav.

source: CRON_FREQUENCY (for the frequency of synchronisation)
ca: CRON_FREQUENCY (per a la freqüència de sincronització)

source: Move the file to your UbuntuTouch device, either by file manager or with adb::
ca: Moveu el fitxer al vostre dispositiu Ubuntu Touch, o bé amb el gestor de fitxers o bé amb l'adb::

source: Ubuntu Touch comes with a command line utility called ``mirscreencast`` which dumps screen frames to a file. The idea here is to stream UT display to a listening computer over the network or directy trough adb so that we can either watch it live or record it to a file.
ca: L'Ubuntu Touch ve amb una utilitat de la línia d'ordres anomenada ``mirscreencast`` que bolca els marcs de pantalla a un fitxer. La idea aquí és transmetre la pantalla UT a un ordinador receptor sobre la xarxa o directament mitjançant adb de manera de mirar-la en viu o gravar-la a un fitxer.
es: Ubuntu Touch viene con una utilidad de la línea de órdenes llamada ``mirscreencast`` que vuelca los fotogramas de pantalla a un archivo. La idea aquí es transmitir la salida de pantalla de UT a un ordenador usando la red o directamente a través de adb de tal forma que podamos verla en directo o grabarla a un archivo.

source: demo: https://www.youtube.com/watch?v=HYm4RUwwo5Q
ca: demostració: https://www.youtube.com/watch?v=HYm4RUwwo5Q
es: demostración: https://www.youtube.com/watch?v=HYm4RUwwo5Q

source: Now start the ssh server::
ca: Inicieu ara el servidor ssh::
es: Arranque ahora el servidor ssh::

source: `gurucubano: BQ Aquaris E 4.5 Ubuntu phone: How to get SSH access to the ubuntu-phone via Wifi <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en/chapter1.html>`_
ca: `gurucubano: Telèfon Ubuntu BQ Aquaris E 4.5: com obtenir accés SSH al telefòn ubuntu via Wifi (en anglès) <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en/chapter1.html>`_
es: `gurucubano: teléfono Ubuntu BQ Aquaris E 4.5: como obtener acceso SSH a un teléfono Ubuntu vía conexión inalámbrica (wifi) <https://gurucubano.gitbooks.io/bq-aquaris-e-4-5-ubuntu-phone/content/en/chapter1.html>`_

source: Run android applications
ca: Execució d'aplicacions de l'android

source: `Anbox <https://anbox.io>`_ is a minimal android container and compatibility layer that allows you to run android applications on GNU/Linux operating systems.
ca: L'`Anbox <https://anbox.io>` és un contenidor mínim de l'android i una capa de compatibilitat que us permet executar aplicacions de l'android a sistemes operatius GNU/Linux.

source: Anbox is in early development
ca: L'Anbox està en una etapa inicial de desenvoupament

source: Anbox for Ubuntu Touch is in even more early development
ca: L'Anbox per a l'Ubuntu Touch està en una etapa encara més inicial de desenvolupament

source: Anbox only works on the 16.04 version of Ubuntu Touch, which is also in early development
ca: L'Anbox sols funciona a la versió 16.05 de l'Ubuntu Touch, que també està en l'etapa inicial de desenvolupament

source: Only selected devices are supported for the moment, more will be added in the future.
ca: Sols tenen suport alguns dispositius seleccionats, s'afegiran més en el futur.

source: Meizu Pro 5 (codename: *turbo*, name of the boot partition: *bootimg*) BQ M10 HD (codename: *cooler*, name of the boot partition: *boot*) BQ M10 FHD (codename: *frieza*, name of the boot partition: *boot*)
ca: Meizu Pro 5 (nom de codi: *turbo*, nom de la partició d'arrencada: *bootimg*) BQ M10 HD (nom de codi: *cooler*, nom de la partició d'arrencada: *boot*) BQ M10 FHD (nom de codi: *frieza*, nom de la partició d'arrencada: *boot*)

source: Because this feature is in such an early stage of development, the installation is only recommended for experienced users.
ca: Atès que aquesta funcionalitat està en un punt tan inicial de desenvolupament, sols es recomana la instal·lació als usuaris experimentats.

source: :doc:`Install <../install>` the 16.04/devel channel on your supported device
ca: :doc:`Instal·lar <../install>` el canal 16.04/devel al vostre dispositiu suportat

source: Open a terminal and run ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, but replace the part between the quotes respectively with the codename and name of the boot partition for your device. See the above list.
ca: Obriu una terminal i executeu ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, però reemplaceu la part entre cometes respectivament amb el nom de codi i el nom de la partició d'arrencada del vostre dispositiu. Vegeu la llista de dalt.

source: Connect the device to your computer computer and run the following commands::
ca: Connecteu el dispositiu al vostre ordinador i executeu les ordres següents::

source: wait for the device to reboot, then run::
ca: espereu que el dispositiu es reiniciï, després executeu::

source: Done! Select "Anbox" in the apps scope to use android applications. You might have to refresh the apps scope (pull down from the center of the screen and release) for the app to show up.
ca: Fet! Trieu «Anbox» a la lent d'aplicacions per usar aplicacions de l'android. Potser haureu d'actualitzar la lent d'aplicacions (arrossegueu des del centre de la pantalla i deixeu anar) perquè es mostri l'aplicació.

source: Please :doc:`report any bugs </contribute/bugreporting>` you come accross. Bugs with Ubuntu Touch 16.04 are reported in `the normal Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch/issues>`_ and issues with anbox are reported on `our downstream fork <https://github.com/ubports/anbox/issues>`_. Thank you!
ca: Si us plau :doc:`informeu qualsevol error </contribute/bugreporting>` que trobeu. Els errors a l'Ubuntu Touch 16.04 s'informen al `seguidor normal de l'Ubuntu Touch <https://github.com/ubports/ubuntu-touch/issues>`_ i els errors amb l'anbox es reporten a `la nostra bifurcació a la base de la cadena <https://github.com/ubports/anbox/issues>`_. Gràcies!

source: To display and launch applications you need the *Desktop Apps Scope* which is available in the `Open Store <https://open-store.io/app/libertine-scope.ubuntu>`_. To install applications you need to use the commandline as described below.
ca: Per mostrar i llençar aplicacions us cal la «Lent d'aplicacions d'escriptori» que està disponible a l'`Open Store <https://open-store.io/app/libertine-scope.ubuntu>`_. Per instal·lar aplicacions us cal usar la línia d'ordres com s'explica a sota.

source: The ``create`` command shown above cannot be run directly in the terminal app, due apparmor restrictions. You can run it from another device using either ``adb`` or ``ssh`` connection. Alternatively, you can run it from the terminal app using a loopback ssh connection running this command: ``ssh localhost``.
ca: L'ordre ``create`` que es mostra a dalt no es pot executar directament a l'aplicació de terminal, per causa de restriccions de l'apparmor. La podeu executar des d'un altre dispositiu usant una connexió o bé ``adb`` o bé ``ssh``. Alternativament, podeu executar-la des de l'aplicació de terminal usant una connexió ssh loopback executant l'ordre: ``ssh localhost``.
es: La orden ``create`` mostrada arriba no se puede ejecutar directamente en la aplicación de terminal, debido a las restricciones de apparmor. Puede ejecutarla desde otro dispositivo usando tanto una conexión ``adb`` como ``ssh``. Alternativamente, puede ejecutarla desde la aplicación de terminal usando una conexión ssh loopback ejecutando la orden: ``ssh localhost``.

source: To list all containers created run:
ca: Per fer una llista de tots els contenidors executeu:
es: Para listar todos los contenedores creados ejecute:

source: Once a container is set up, you can list the installed applications:
ca: Un cop heu configurat un contenidor, podeu fer una llista de les aplicacions instal·lades:
es: Una vez que un contenedor está configurado, puede listar las aplicaciones instaladas:

source: Install a package:
ca: Instal·lació d'un paquet:
es: Instalar un paquete:

source: Remove a package:
ca: Eliminació d'un paquet:
es: Eliminar un paquete:

source: Tipps
ca: Consells
es: Consejos

source: To execute any arbitrary command as root inside the container run:
ca: Per executar qualsevol ordre arbitrària com a root a dins del contenidor executeu:
es: Para ejecutar cualquier orden como root dentro de un contenedor ejecute:

source: ``libertine-container-manager exec -c COMMAND``
ca: ``libertine-container-manager exec -c ORDRE``

source: For example, to get a shell into your container you can run:
ca: Per exemple, per obtenir una consola dins del contenidor podeu executar:
es: Por ejemplo, para obtener una terminal en su contenedor puede ejecutar:

source: To get a shell as user ``phablet`` run:
ca: Per obtenir una consola com a l'usuari ``phablet`` executeu:
es: Para obtener una terminal como usuario ``phablet`` ejecute:

source: Installing Ubuntu Touch is easy, and a lot of work has gone in to making the installation process less intimidating to less technical users. The UBports Installer is a nice graphical tool that you can use to install Ubuntu Touch on a `supported device <https://ubuntu-touch.io/devices>`_ from your Linux, Mac or Windows computer.
ca: La instal·lació de l'Ubuntu Touch és fàcil, i s'ha fet molta feina perquè el procés d'instal·lació sigui menys intimidant per als usuaris menys tècnics. L'instal·lador de l'UBports és una eina gràfica maca que podeu usar per instal·lar l'Ubuntu Touch a un `dispositiu amb suport <https://ubuntu-touch.io/devices>`_ des del vostre ordinador Linux, Max o Windows.

source: Go to `the download page <https://github.com/ubports/ubports-installer/releases/latest>`_ and download the version of the installer for your operating system:
ca: Aneu a `la pàgina de descàrrega <https://github.com/ubports/ubports-installer/releases/latest>`_ i descarregueu la versió de l'instal·lador per al vostre sistema operatiu:
es: Vaya a `la página de descargas <https://github.com/ubports/ubports-installer/releases/latest>`_ y descargue la versión adecuada del instalador para su sistema operativo:

source: Windows: ``ubports-installer-<version-number>.exe``
ca: Windows: ``ubports-installer-<número-de-versió>.exe``

source: macOS: ``ubports-installer-<version-number>.dmg``
ca: macOS: ``ubports-installer-<número-de-versió>.dmg``

source: Ubuntu or Debian: ``ubports-installer-<version-number>.deb``
ca: Ubuntu o Debian: ``ubports-installer-<número-de-versió>.deb``

source: Other Linux distribtuions: ``ubports-installer-<version-number>.snap`` or ``ubports-installer-<version-number>.AppImage``
ca: Altres distribucions de Linux: ubports-installer-<número-de-versió>.deb, ubports-installer-<número-de-versió>.snap or ubports-installer-<número-de-versió>.AppImage

source: If you're an experienced android developer and want to help us bring Ubuntu Touch to more devices, visit the :doc:`porting section </porting/introduction>`.
ca: Si teniu experiència en el desenvolupament de l'Android i voleu ajudar-nos a adaptar l'Ubuntu Touch a més dispositius, visiteu la :doc:`secció d'adaptació </porting/introduction>`.
es: Si usted es un experimentado desarrollador de android y quiere ayudarnos a llevar Ubuntu Touch a mas dispositivos, visite :doc:`sección de portado </porting/introduction>`.

source: Disconnect all devices and non-essential peripherals from your PC. Charge your device on a wall-charger (not your PC) to at least 40 percent
ca: Desconnecteu tots els dispositius i perifèrics no essencials del vostre PC. Carregueu el vostre dispositiu a un endoll de pared (no al vostre PC) fins almenys el 40 per cent

source: Download the Ubuntu Touch ROM for your device:
ca: Descarregueu el ROM de l'Ubuntu Touch per al vostre dispositiu:

source: `Bq E4.5 <http://www.mibqyyo.com/de-download/categorias/smartphones/aquaris-e-serie/aquaris-e4-5-ubuntu-edition/>`_ (*krillin*)
ca: `Bq E4.5 <http://www.mibqyyo.com/descargas/categorias/aquaris-e4-5-ubuntu-edition/>`_ (*krillin*)

source: Download `SP flash tool <https://storage.googleapis.com/otas/2015/Tablets/Freezer%20FHD/Ubuntu/SP_Flash_Tool_exe_Linux_v5.1612.00.100.zip>`_ for Linux.
ca: Descarregueu `SP flash tool <https://storage.googleapis.com/otas/2015/Tablets/Freezer%20FHD/Ubuntu/SP_Flash_Tool_exe_Linux_v5.1612.00.100.zip>`_ per a Linux.

source: To display and launch applications you need the *Desktop Apps Scope* which is available in the Canonical App Store. To install applications you need to use the commandline as described below.
es: Para mostrar y lanzar aplicaciones necesita el *Scope aplicaciones de escritorio* que está disponible en la tienda de aplicaciones de Canonical. Para instalar aplicaciones necesita usar la línea de órdenes como se describe abajo.

source: Installing Ubuntu Touch is easy, and a lot of work has gone in to making the installation process less intimidating to less technical users. The UBports Installer is a nice graphical tool that you can use to install Ubuntu Touch on a `supported device <devices.ubports.com>`_ from your Linux, Mac or Windows computer.
es: La instalación de Ubuntu Touch es sencilla y se ha hecho un montón de trabajo para hacer el proceso de instalación menos intimidatorio para los usuarios menos técnicos. El instalador de UBports es una bonita herramienta gráfica que puede usar para instalar Ubuntu Touch en un `dispositivo soportado <devices.ubports.com>`_ desde su ordenador Linux, Mac o Windows.

source: If your're switching your device over from Android, you will not be able to keep any data that is currently on the device. Create an external backup if you want to keep it.
es: Si está cambiando su dispositivo que tiene previamente Android, no podrá guardar ningún dato que esté actualmente en el dispositivo. Cree una copia de seguridad externa antes si quiere mantener los datos.

source: Windows: ubports-installer-<version-number>.exe
es: Windows: ubports-installer-<número-de-versión>.exe

source: macOS: ubports-installer-<version-number>.dmg
es: macOS: ubports-installer-<número-de-versión>.dmg

source: Linux: ubports-installer-<version-number>.deb, ubports-installer-<version-number>.snap or ubports-installer-<version-number>.AppImage
es: Linux: ubports-installer-<número-de-versión>.deb, ubports-installer-<número-de-versión>.snap or ubports-installer-<número-de-versión>.AppImage
