Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: Another challenge is that Ubuntu Touch system updates are released as OTA images. A consequence of this is that the root filesystem is read only. Libertine provides a container with a read-write filesystem to allow the installation of regular Linux desktop applications.
ca: Un altre desafiament és les actualitzacions de sistema de l'Ubuntu Touch s'alliberen com imatges OTA. Això té com a conseqüència que el sistema de fitxers arrel és de sols lectura. El Libertine proveeix un contenidor amb un sistema de fitxers de lectura i escriptura per permetre la instal·lació d'aplicacions d'escriptori regulars del Linux.
de: Eine andere Herausforderung ist, dass Aktualisierungen für das Ubuntu Touch-System als OTA-Abbilder veröffentlicht werden. Als Konsequenz daraus hat man nur Leserechte auf das Wurzeldateisystem. Libertine stellt einen Container mit einem Dateisystem mit Schreib- und Leserechten zur Verfügung, um die Installation regulärer Linux-Desktop-Anwendungen zu ermöglichen.
es: Otro reto es que las actualizaciones de sistema de Ubuntu Touch se publican como imágenes OTA. Una consecuencia de esto es que el sistema de archivos raíz es de solo lectura. Libertine proporciona un contenedor con un sistema de archivos de lectura-escritura para permitir la instalación de aplicaciones de escritorio normales Linux.
pl: Kolejnym wyzwaniem w Ubuntu Touch są aktualizacje systemowe wydawane jako OTA. Konsekwencją tego system plików jest tylko do odczytu (readonly). Libertine to kontener z systemem plików read-write, który pozwala na instalacje normalnych, Linuxowych, desktopowych aplikacji.

source: Using location services
de: Nutzung von Standort-Diensten
nb: Bruke lokasjonstjenester
pl: Używanie usług lokalizacyjnych

source: Location services in Ubuntu Touch allow apps to access your current location. Using this data, apps can `offer turn-by-turn navigation <https://open-store.io/app/navigator.costales>`__, `track your exercise paths <https://open-store.io/app/activitytracker.cwayne18>`__, `locate public transport near you <https://open-store.io/app/transport.zubozrout>`__, and more.
de: Standort-Dienste in Ubuntu Touch erlauben es Apps auf Ihren aktuellen Geostandort zuzugreifen. Apps, die diese Daten nutzen, bieten Turn-by-Turn-Navigation <https://open-store.io/app/navigator.costales>`__, `tracken Ihre Trainings-Pfade <https://open-store.io/app/activitytracker.cwayne18>`__, `lokalisieren öffentliche Verkehrsmittel in Ihrer Nähe <https://open-store.io/app/transport.zubozrout>`__, und mehr.
pl: Usługi lokalizacyjne w Ubuntu Touch pozwalają aplikacją na dostęp do twojej aktualnej lokalizacji. Używając tych danych aplikacje mogą `oferować nawigacje turn-by-turn <https://open-store.io/app/navigator.costales>`__, `śledzenie twoich ścieżek ruchu <https://open-store.io/app/activitytracker.cwayne18>`__, `lokalizowanie środków publicznego transportu niedaleko ciebie <https://open-store.io/app/transport.zubozrout>`__, i wiele więcej.

source: The location services built in to Ubuntu Touch are designed to protect your privacy -- you choose to permit or deny apps access to this data. Apps may only access your location data when the device screen is on and the app is in use.
de: Die Standort-Dienste in Ubuntu Touch sind darauf ausgelegt Ihre Privatsphäre zu schützen -- Sie erlauben oder verbieten Apps auf diese Daten zuzugreifen. Apps dürfen auf Ihre Standort-Daten nur zugreifen, wenn der Bildschirm eingeschaltet ist und die App genutzt wird.
nb: Posisjonstjenestene innebygd i Ubuntu Touch er designet for å beskytte personvernet ditt -- du velger å tillate eller nekte apper tilgang til disse dataene. Apper får bare tilgang til posisjonsdataene dine når enhetsskjermen er på og appen er i bruk.
pl: Usługi lokalizacyjne zbudowane w Ubuntu Touch są zaprojektowane z myślą o twojej prywatności -- ty wybierasz czy zezwolić czy odmówić dostępu aplikacji do tych danych. Aplikacje mają dostęp do twojej lokalizacji tylko gdy ekran jest włączony i aplikacja jest w użyciu.

source: Checking if location services are enabled
de: Überprüfen, ob Standort-Dienste aktiviert sind
nb: Kontrollerer om posisjonstjenester er aktivert
pl: Sprawdzanie czy usługi lokalizacji są włączone

source: The Location Indicator is displayed whenever location services are enabled. Normally, this indicator will appear to be dark.
de: Der Standort Indikator wird immer dann angezeigt, wenn Standort-Dienste aktiviert sind. Normalerweise wird dieser Indikator dunkel dargestellt.
nb: Posisjonsindikatoren vises når posisjonstjenester er aktivert. Normalt ser denne indikatoren ut til å være mørk.
pl: Wskaźnik lokalizacji wyświetla się, zawsze gdy usługi lokalizacji są włączone. Domyślnie ten wskaźnik będzie ciemny.

source: The Location Indicator, showing location enabled but not in use
de: Der Standort-Indikator zeigt eine eingeschaltete Standort-Bestimmung, die aktuell nicht genutzt wird
nb: Posisjonsindikatoren, viser posisjonen aktivert men ikke i bruk
pl: Wskaźnik lokalizacji pokazuje lokalizacje włączoną ale nie w użyciu

source: If an app is accessing location data, the Location Indicator brightens.
de: Wenn eine App auf Standort-Daten zugreift, wird der Standort-Indikator heller dargestellt.
nb: Hvis en app får tilgang til posisjonsdata, lyser posisjonsindikatoren.
pl: Jeśli aplikacja ma dostęp do danych lokalizacyjnych, wskaźnik lokalizacji się rozjaśnia.

source: The Location Indicator, showing location enabled and in use
de: Der Standort-Indikator stellt dar, dass die Standort-Bestimmung aktiviert ist und aktuell genutzt wird
nb: Posisjonsindikatoren, viser posisjonen aktivert og i bruk
pl: Wskaźnik lokalizacji pokazuje lokalizacje włączoną i w użyciu

source: Accessing location services settings
de: Zugriff auf Standort-Dienst Einstellungen
pl: Uzyskiwanie ustawień usług lokalizacyjnych

source: There are several ways to access settings related to location services in Ubuntu Touch.
de: Es gibt verschiedene Möglichkeiten auf die Einstellungen mit Bezug zur Standort-Diensten in Ubuntu Touch zuzugreifen.
nb: Det er flere måter å få tilgang til innstillinger relatert til posisjonstjenester i Ubuntu Touch.
pl: Jest wiele sposobów by dostać się do ustawień usług lokalizacyjnych w Ubuntu Touch.

source: Open location quick settings
de: Öffnen der Standort Schnelleinstellungen
nb: Åpne hurtiginnstillinger for plassering
pl: Otwórz szybkie ustwienia lokalizacji

source: The Location Indicator contains quick settings related to location services, including a switch to turn services on or off.
de: Der Standort-Indikator enthält Schnelleinstellungen mit Bezug zu Standort-Diensten, einschließlich eines Schalters die Dienste ein- oder auszuschalten.
nb: Posisjonsindikatoren inneholder raske innstillinger relatert til posisjonstjenester, inkludert en bryter for å slå tjenester av eller på.
pl: Wskaźnik lokalizacji zawiera szybkie ustawienia dotyczące usług lokalizacyjnych, między innymi przełącznik włączający i wyłączający je.

source: To access these settings, press on the Location Indicator and pull down toward the bottom of the screen.
de: Um auf diese Einstellungen zuzugreifen, drücken Sie auf den Standort-Indikator und streichen Sie in Richtung des unteren Rande des Bildschirms.
nb: For å få tilgang til disse innstillingene, trykk på Posisjonsindikatoren og trekk ned mot bunnen av skjermen.
pl: By dostać się do tych ustawień, naciśnij na Wskaźnik Lokalizacji i pociągnij do w dół, aż do końca ekranu.

source: If location services are disabled, you can access the location quick settings by pressing on any other indicator and pulling down. Then, scroll through the icons at the top of the screen to find Location. Select Location to open the quick settings.
de: Wenn Standort-Dienste deaktiviert sind, können Sie auf die Standort Schnelleinstellungen zugreifen, indem Sie auf jeden anderen Indikator drücken und in Richtung des unteren Bildschirm-Randes ziehen. Anschließend scrollen Sie durch die Symbole am oberen Bildschirmrand bis zum Standort-Symbol. Tippen Sie auf das Standort-Symbol, um die Schnelleinstellungen zu öffnen.
nb: Hvis posisjonstjenester er deaktivert, kan du få tilgang til hurtiginnstillingene for posisjon ved å trykke på en hvilken som helst annen indikator og dra ned. Bla deretter gjennom ikonene øverst på skjermen for å finne plassering. Velg Plassering for å åpne hurtiginnstillingene.
pl: Jeśli ustawienia lokalizacyjne są wyłączone, możesz się do nich dostać poprzez szybkie ustawienia lokalizacji przeciągając pasek powiadomień na dół. Potem scroll'uj ikony na górze, aż zobaczysz Lokalizację. Zaznacz Lokalizacje aby otworzyć szybkie ustawienia.

source: Open location settings in the settings app
de: Öffnen der Standort-Einstellungen in der Systemeinstellungen App
nb: Åpne plasseringsinnstillinger i innstillingsappen
pl: Otwórz ustawienia lokalizacji w aplikacji ustawień

source: The system settings app can be used to control location services. There are more controls in the system settings app than in the Location Indicator.
de: Die Systemeinstellungen App kann genutzt werden, um Standort-Dienste zu kontrollieren. Es gibt mehr Einstellungsmöglichkeiten in der Systemeinstellungen App, als im Standort-Indikator.
nb: Systeminnstillinger-appen kan brukes til å kontrollere posisjonstjenester. Det er flere kontroller i appen Systeminnstillinger enn i Posisjonsindikatoren.
pl: Aplikacja ustawień systemowych może być użyta do kontrolowania usług lokalizacyjnych. W aplikacji ustawień jest więcej opcji niż we wskaźniku lokalizacji.

source: There are two ways to access location services controls in the system settings app.
de: Es gibt zwei Möglichkeiten auf die Steuerung der Standort-Dienste in der Systemeinstellungen App zuzugreifen.
nb: Det er to måter å få tilgang til posisjonstjenestekontroller i systeminnstillingsappen.
pl: Są dwie metody kontroli dostępu do usług lokalizacyjnych w aplikacji ustawień systemowych.

source: Quick settings
de: Schnelleinstellungen
nb: Hurtiginnstillinger
pl: Szybkie ustawienia

source: `Open location quick settings`_, then select ``Location settings...``.
nb: `Åpne hurtig-posisjonsinnstillingene`_, og velg ``Posisjonsinnstillinger …``.
pl: `Otwórz szybkie ustawienia lokalizacji`_, potem wybierz ``Ustawienia lokalizacji...``.

source: System settings app
de: Systemeinstellungen App
nb: Systeminnstillinger-app
pl: Aplikacja ustawień systemowych

source: Launch the ``System Settings`` app. Select ``Security & Privacy``, then select ``Location``.
de: Starten Sie die ``Systemeinstellungen`` App. Wählen Sie ``Sicherheit & Datenschutz`` und dann ``Standort``.
pl: Odpal aplikacje ``Ustawień Systemu``. Wybierz ``Bezpieczeństwo i Prywatność``, potem wybierz ``Lokalizacja``.

source: Enabling or disabling location services
de: Aktivieren oder Deaktivieren der Standort-Dienste
nb: Aktiver eller deaktiver posisjonstjenester
pl: Włączanie i wyłączanie usług lokalizacyjnych

source: If location services are on, apps which you have allowed access to your location data may request your current location. Location services are enabled by default on Ubuntu Touch.
de: Wenn Standort-Dienste eingeschaltet sind können Apps, denen Sie erlaubt haben auf Standort-Daten zuzugreifen, ihren aktuellen Standort abfragen. Standort-Dienste sind in Ubuntu Touch standardmäßig aktiviert.
nb: Hvis posisjonstjenester er på, kan apper som du har gitt tilgang til posisjonsdataene dine be om din nåværende posisjon. Posisjonstjenester er aktivert som standard på Ubuntu Touch.
pl: Jeśli usługi lokalizacyjne są włączone, aplikacje którym pozwoliłeś/aś na dostęp to twoich danych lokalizacyjnych, mogą prosić o twoją obecną lokalizacje. Usługi lokalizacyjne są włączone domyślnie na Ubuntu Touch.

source: If location services are off, apps will not be able to access your current location.
de: Wenn Standortdienste ausgeschaltet sind, können Apps nicht auf Ihren aktuellen Standort zugreifen.
nb: Hvis posisjonstjenester er av, vil ikke apper få tilgang til din nåværende posisjon.
pl: Jeśli usługi lokalizacyjne są wyłączone, aplikacje nie będą wstanie uzyskać twojego obecnego położenia.

source: There are several ways to enable or disable location services in Ubuntu Touch.
de: Es gibt mehrere Möglichkeiten Standortdienste in Ubuntu Touch zu aktivieren oder zu deaktivieren.
nb: Det er flere måter å aktivere eller deaktivere plasseringstjenester i Ubuntu Touch.
pl: Jest dużo sposobów, aby włączyć lub wyłączyć usługi lokalizacyjne w Ubuntu Touch.

source: `Open location quick settings`_. Select the ``Location detection`` switch to enable or disable location services.
de: `Öffnen Sie die Standort Schnelleinstellungen`_. Tippen Sie auf den ``Standortbestimmung`` Schalter, um Standortdienste ein- oder auszuschalten.
pl: `Otwórz szybkie ustawienia lokalizacji`_. Zanzacz ``Wykrywanie lokalizacji`` przłęcz, aby włączyć lub wyłączyć usługi lokalizacyjne.

source: `Open location settings in the settings app`_. Under ``Let the device detect your location:``, select the appropriate option:
de: `Öffnen Sie die Standorteinstellungen in der Systemeinstellungen App`_. Unter ``Standorterkennung durchs Telefon erlauben:``, wählen Sie die entsprechende Option:
pl: `Otwórz ustawiania lokalizacji w aplikacji ustawień`_. Pod ``Niech urządzenie wykryje twoją lokalizację:``, wybierz odpowiednią opcje:

source: ``Using GPS`` turns on location services.
de: ``GPS verwenden`` schaltet die Standortdienste ein.
nb: `` Using GPS '' slår på lokasjonstjenester.
pl: ``Używaj GPS`` włącza usługi lokalizacyjne.

source: ``Not at all`` turns off location services.
de: ``Nie`` schaltet die Standortdienste aus.
nb: ``Ikke i det hele tatt`` slår av posisjonstjenester.
pl: ``Ani trochę`` wyłącza usługi lokalizacyjne.

source: Allowing apps access to location data
de: Apps erlauben auf Standort-Daten zuzugreifen
nb: Tillater apper tilgang til posisjonsdata
pl: Pozwalanie aplikacją na dostęp do danych lokalizacyjnych

source: Ubuntu Touch allows you to allow or deny apps access to your location data. This decision is presented the first time the app tries to access your current location. You can change your decision later.
de: Ubuntu Touch ermöglicht Ihnen den Zugriff auf Standort-Daten für Apps zu erlauben oder zu verbieten. Diese Entscheidung wird angeboten, wenn die App das erste Mal versucht Ihren aktuellen Standort abzufragen. Sie können Ihre Entscheidung später ändern.
nb: Ubuntu Touch lar deg tillate eller nekte apper tilgang til posisjonsdataene dine. Denne avgjørelsen presenteres første gang appen prøver å få tilgang til din nåværende posisjon. Du kan endre avgjørelsen din senere.
pl: Ubuntu Touch pozwala ci zdecydować czy chcesz pozwolić aplikacji na dostęp do danych lokalizacyjnych. Decyzja jest podejmowana przy pierwszej próbie uzyskania dostępu przez aplikacje. Możesz zmienić swoją decyzje później.

source: An app will show the location permission request the first time it tries to access your current location.
de: Eine App zeigt die Standort-Erlaubnis-Anfrage beim ersten Versuch auf Ihren aktuellen Standort zuzugreifen an.
nb: En app viser forespørselen om posisjonstillatelse første gang den prøver å få tilgang til din nåværende posisjon.
pl: Aplikacja pokaże ci prośbe o dostęp do lokalizacji podczas pierwszego uruchomienia.

source: Select ``Allow`` to give the app access to your current location. Select ``Don't Allow`` to deny the app access to your current location. Some app features may not work correctly if you select ``Don't Allow``.
de: Wählen Sie ``Erlauben`` um der App Zugriff auf Ihren aktuellen Standort zu geben. Wählen Sie ``Nicht erlauben``, um der App den Zugriff auf Ihren aktuellen Standort zu verbieten. Einige App Features könnten nicht korrekt funktionieren, wenn Sie ``Nicht erlauben`` wählen.
nb: Velg ``Tillat`` for å gi appen tilgang til din nåværende posisjon. Velg ``Ikke tillat`` for å nekte appen tilgang til din nåværende posisjon. Noen appfunksjoner fungerer kanskje ikke riktig hvis du velger ``Ikke tillat``.
pl: Wybierz ``Zezwalaj`` aby dać aplikacji dostęp do twojej aktualnej lokalizacji. Wybierze ``Nie zezwalaj`` aby odmówić aplikacji dostępu do twojej lokalizacji. Niektóre funkcje aplikacji mogą przestać działać jeśli zaznaczysz ``Nie zezwalaj``.

source: Changing your permissions
de: Ändern der Berechtigungen
nb: Endre dine tillatelser
pl: Zmienianie twoich uprawnień

source: You can change your decision to allow an app access to your location data. This is useful when you gave an app access to your location but you'd like to deny access, or if you denied access but would like to give access.
de: Sie können Ihre Entscheidung einer App Zugriff auf Ihre Standortdaten zu geben ändern. Das ist nützlich, wenn Sie einer App Zugriff auf Ihren Standort gegeben haben, ihn aber verbieten wollen, oder wenn Sie den Zugriff abgelehnt haben, aber den Zugriff gewähren wollen.
nb: Du kan endre avgjørelsen din om å gi en app tilgang til posisjonsdataene dine. Dette er nyttig når du ga en app tilgang til posisjonen din, men du vil nekte tilgang, eller hvis du nektet tilgang, men ønsker å gi tilgang.
pl: Możesz zmienić swoją decyzje aby pozwolić aplikacji na dostęp do twoich danych lokalizacyjnych. Jest to przydatne gdy dałeś/aś aplikacji dostęp do twojej lokalizacji, ale chciałbyś/ałabyś odmówić jej dostępu, albo jeśli odmówiłeś/aś dostępu i chciałbyś/ałabyś nadać dostęp.

source: There are several ways to find these controls.
de: Es gibt verschiedene Wege, diese Steuerelemente zu finden.
nb: Det er flere måter å finne disse kontrollene på.
pl: Jest wiele sposobów, aby znaleźć te ustawienia.

source: Location settings
de: Standorteinstellungen
pl: Ustawienia lokalizacji

source: `Open location settings in the settings app`_. All of the apps which have requested access to your location are listed under ``Let apps access this location:``. Toggle the switch next to an app "on" to allow it to access your location data. Toggle the switch "off" to deny access.
de: `Öffnen der Standorteinstellungen in der Systemeinstellungen App`_. Alle Apps, die Zugriff auf Ihre Standort-Daten angefragt haben, werden unter ``Erlaube Apps den Zugriff auf Ihre Position:`` aufgelistet. Stellen Sie den Schalter neben einer App auf "Ein", um ihr den Zugriff auf ihre Standort-Daten zu erlauben. Stellen Sie ihn auf "Aus", um den Zugriff zu verbieten.
pl: `Otwórz ustawienia lokalizacji w aplikacji ustawień`_. Wszystkie aplikacje, które ubiegały się o dostęp do twojej lokalizacji są wypisane pod ``Zezwól aplikacjom na dostęp do lokalizacji:``. Włącz przełącznik obok aplikacji, aby pozwolić jej na dostęp do danych lokalizacyjnych. Wyłącz, aby odmówić dostępu.

source: App permission settings
de: App Berechtigungs-Einstellungen
pl: Ustawienia uprawnień aplikacji

source: Launch the ``System Settings`` app. Select ``Security & Privacy``, then select ``App permissions``, followed by ``Location``. All of the apps which have requested access to your location are listed. Toggle the switch next to an app "on" to allow it to access your location data. Toggle the switch "off" to deny access.
de: Starten Sie die ``Systemeinstellungen`` App. Wählen Sie ``Sicherheit & Datenschutz``, dann ``App Berechtigungen`` und im Anschluss ``Standort``. Alle Apps, die Zugriff auf Ihre Standort-Dienste angefragt haben, werden aufgelistet. Schalten Sie den Schalter neben jeder App auf "Ein", um den Zugriff auf Ihre Standort-Daten zu erlauben. Schalten Sie ihn auf "Aus", um den Zugriff zu verbieten.
nb: Start appen ``Systeminnstillinger``. Velg ``Sikkerhet og personvern``, velg deretter ``App-tillatelser``, etterfulgt av ``Plassering``. Alle appene som har bedt om tilgang til posisjonen din, er oppført. Veksle bryteren ved siden av en app "på" for å la den få tilgang til posisjonsdataene dine. Slå bryteren "av" for å nekte tilgang.
pl: Uruchom aplikacje ``Ustawienia systemowe``. Zaznacz ``Prywatność i zabezpieczenia``, potem zaznacz ``Zezwolenia aplikacji``, a potem ``Lokalizacja``. Wszystkie aplikacje, które prosiły o dostęp to lokalizacji są tutaj. Przełącz przełącznik obok aplikacji, by zazwolić lub odmówić jej dostępu do lokalizacji.

source: Using apps with location services
de: Apps mit Standort-Diensten nutzen
pl: Używanie aplikacji używających usług lokalizacyjnych

source: Apps will be able to access your current location after they are granted access to location data. However, there are some things to note while using apps with location services.
de: Apps werden auf Ihre aktuellen Standort zugreifen können, nachdem ihnen Zugriff auf die Standortdaten gewährt wurde. Jedoch gibt es einige Dinge, die bei der Nutzung von Standort-Diensten zu beachten sind.
nb: Apper vil kunne få tilgang til din nåværende posisjon etter at de får tilgang til posisjonsdata. Imidlertid er det noen ting å merke seg når du bruker apper med posisjonstjenester.
pl: Aplikacje będą miały dostęp do twojej lokalizacji po tym jak uzyskają dostęp do danych lokalizacyjnych. Jednakże, są kwestie które warto zaznaczyć odnośnie używania aplikacji z usługami lokalizacyjnymi.

source: A "fix" is a data point generated by GPS hardware that contains its current location and the expected accuracy of that location. GPS hardware is rated by how long it takes to return one of these data points after the device is activated. This rating is called "`Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_," or TTFF.
de: Ein "Fixpunkt" ist ein von GPS-Hardware generierter Datenpunkt, der die aktuelle Position und die erwartete Genauigkeit dieser Position enthält. GPS-Hardware wird danach bewertet, wie lange es dauert einen dieser Fixpunkte zurückzugeben, nachdem das Gerät aktiviert wurde. Dieses Rating wird "`Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_," oder TTFF genannt.
pl: "Fix" to punkt danych wygenerowany przez sprzęt GPS, który zawiera swoją obecną lokalizacje i spodziewaną dokładność twojej lokalizacji. Sprzęt GPS jest oceniany jak długi zajmie na powrót tych danych po tym jak urządzenie zostało aktywowane. Ten rating jest nazywany "`Time To First Fix <https://en.wikipedia.org/wiki/Time_to_first_fix>`_," or TTFF.

source: A device with a mobile data connection should take one to four minutes to receive its first fix. If location services have not been used for a long time *and* the device does not have a mobile data connection, the first fix can take up to an hour. To prevent this from causing problems for you, follow these instructions:
de: Ein Gerät mit einer mobilen Datenverbindung sollte nur 1 bis 4 Minuten benötigen, um seinen ersten Fixpunkt zu empfangen. Wenn Standortdienste für eine längere Zeit nicht genutzt wurden *und* das Gerät keine mobile Datenverbindung besitzt, kann es bis zu eine Stunde dauern, den ersten Fixpunkt zu erhalten. Um zu verhindern, dass das Probleme für Sie verursacht, folgen Sie diesen Anweisungen:
pl: Urządzeniu z połączeniem danych mobilnych powinno zająć od jednej do czterech minut, aby otrzymać pierwszy fix. Jeśli usługi lokalizacji nie były używane przez długi czas *i* urządzenie nie ma połączenia danych mobilnych, pierwszy fix może trwać nawet do godziny. Aby zapobiec się od występujących problemów zobacz te instrukcje:

source: Do not leave your device in direct sunlight. The heat can damage the device.
de: Lassen Sie Ihr Gerät nicht in direkter Sonneneinstrahlung liegen. Die Hitze kann das Gerät beschädigen.
nb: Forlat ikke enheten din i direkte sollys. Varmen kan skade enheten.
pl: Nie zostawiaj swojego urządzenia na bezpośrednim słońcu. Ciepło może uszkodzić urządzenie.

source: Disable ``Lock when idle`` in the Battery settings
de: Deaktivieren Sie ``Sperren, wenn inaktiv`` in den Akku-Einstellungen
nb: Deaktiver `` Lås når inaktiv '' i batteriinnstillingene
pl: Wyłącz ``Zablokuj gdy bezczynny`` w ustawieniach baterii
