Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: Download an app which uses location services and cause it to start accessing your location data.
de: Laden Sie eine App herunter, die Standortdienste verwendet und lassen Sie diese auf ihre Standortdaten zugreifen.
pl: Pobierz aplikacje która używa usług lokalizacyjnych i udziel jej na dostępu do twojej lokalizacji.

source: Leave your device near a window but out of direct sunlight. To reduce energy consumption, turn the screen brightness down.
de: Legen Sie ihr Gerät in die Nähe eines Fensters, aber außerhalb direkter Sonneneinstrahlung. Um den Energie-Verbrauch zu reduzieren, stellen Sie die Bildschirmhelligkeit auf eine niedrige Stufe.
nb: Legg enheten din nær et vindu, men ikke i direkte sollys. For å redusere energiforbruket, skru ned lysstyrken på skjermen.
pl: Postaw swoje urządzenie blisko okna, ale nie w bezpośrednim słońcu. Aby zmniejszyć zużycie energii możesz obniżyć jasność ekranu.

source: After 20 minutes to an hour, your device should display your current location. You can now close the app and enable ``Lock when idle``. Future attempts to aquire your location should now take one to four minutes.
de: Nach 20 Minuten bis zu einer Stunde sollte Ihr Gerät Ihren aktuellen Standort anzeigen. Sie können nun die App schließen und ``Sperren, wenn inaktiv`` wieder aktivieren. Zukünftige Versuche ihren Standort zu ermitteln, sollten nun nur noch eine bis vier Minuten benötigen.
nb: Etter 20 minutter til en time skal enheten vise din nåværende posisjon. Du kan nå lukke appen og aktivere `` Lås når inaktiv ''. Fremtidige forsøk på å hente posisjonen din bør nå ta ett til fire minutter.
pl: Po 20 minutach do godziny, twoje urządzenie powinno wyświetlić twoją aktualną lokalizacje. Teraz możesz zakmnąć apliakcje i włączyć ``Zablokuj gdy bezczynny`` Przyszłe próby zdobycia twojej lokalizacji powinny zająć teraz od jednej do czterech minut.

source: App suspension
de: App Hintergrundsuspensierung
nb: App suspensjon
pl: Wstrzymywanie aplikacji

source: Apps are suspended whenever they are not in the foreground or the device is locked. When an app is suspended, it cannot receive location data. For this reason, apps will not be able to track your location whenever they are not in use or the device is locked.
de: Apps werden unterbrochen, sobald sie sich nicht im Vordergrund befinden oder das Gerät gesperrt ist. Wenn eine App unterbrochen wurde, kann sie ihre Standortdaten nicht erhalten. Aus diesem Grund werden Apps nicht in der Lage sein ihren Standort zu verfolgen, sobald sie nicht genutzt werden oder das Gerät gesperrt ist.
nb: Apper blir suspendert når de ikke er i forgrunnen eller enheten er låst. Når en app er suspendert, kan den ikke motta posisjonsdata. Av denne grunn vil ikke apper kunne spore posisjonen din når de ikke er i bruk eller enheten er låst.
pl: Aplikacje są wstrzymywane za każdym razem, gdy nie są na pierwszym planie albo gdy urządzenie jest zablokowane. Wstrzymana aplikacja nie otrzymuje danych lokalizacyjnych. Z tego powodu aplikacje nie mogą śledzić twojej lokalizacji, kiedy nie są w użyciu albo urządzenie jest zablokowane.

source: Install Ubuntu Touch
ca: Instal·lació de l'Ubuntu Touch
de: Ubuntu Touch installieren
es: Instalar Ubuntu Touch
nb: Installer Ubuntu Touch
pl: Instalacja Ubuntu Touch

source: Installing Ubuntu Touch is easy, and a lot of work has gone in to making the installation process less intimidating to the average user. The UBports Installer is a nice graphical tool that you can use to install Ubuntu Touch on a `supported device <https://devices.ubuntu-touch.io/>`_ from your `Linux <https://snapcraft.io/ubports-installer>`_, `Mac <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ or `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_ computer. For more experienced users, we also have manual installation instructions for every device `on the devices page <https://devices.ubuntu-touch.io/>`_.
de: Ubuntu Touch zu installieren ist einfach und es wurde eine Menge Arbeit investiert, den Installationsvorgang weniger einschüchternd für durchschnittliche Nutzer zu machen. Der UBports Installer ist ein schönes grafisches Werkzeug, mit dem sich Ubuntu Touch auf einem `unterstützten Gerät <https://ubuntu-touch.io/devices>`_ von Ihrem `Linux- <https://snapcraft.io/ubports-installer>`_, `Mac- <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ oder `Windows- <https://devices.ubuntu-touch.io/installer/?package=exe>`_ Computer installieren lässt. Für erfahrenere Nutzer haben wir auch eine Anleitung für die manuellen Installation für jedes Gerät `auf der Geräte-Seite <https://devices.ubuntu-touch.io/>`_.
pl: Instalacja Ubuntu Touch jest prosta, zostało włożone wiele pracy by uczynić proces mniej strasznym dla przeciętnego użytkownika. Instalator UBports to fajne narzędzie, którego możesz użyć do instalacji Ubuntu Touch na `wspieranym urządzeniu <https://devices.ubuntu-touch.io/>`_, z twojego komputera z `Linux <https://snapcraft.io/ubports-installer>`_, `Mac <https://devices.ubuntu-touch.io/installer/?package=dmg>`_ lub `Windows <https://devices.ubuntu-touch.io/installer/?package=exe>`_. Mamy też manualne instrukcje dla każdego urządzenia, dla bardziej doświadczonych użytkowników, na `stronie z urządzeniami <https://devices.ubuntu-touch.io/>`_.

source: If you're switching your device over from Android, you will not be able to keep any data that is currently on the device. Create an external backup if you want to keep it.
ca: Si esteu canviant el vostre dispositiu des de l'Android, no podreu mantenir les dades que tingueu actualment al dispositiu. Creeu una còpia de seguretat externa si les voleu mantenir.
de: Falls das Gerät bisher mit Android läuft, kann man seine aktuellen Daten nicht auf dem Gerät behalten. Möchte man sie behalten, muss man eine externe Sicherung anlegen.
nb: Hvis du bytter enheten fra Android, vil du ikke kunne lagre data som for øyeblikket er på enheten. Opprett en ekstern sikkerhetskopi hvis du vil beholde den.
pl: Jeśli zmieniasz urządzenie z androida, nie będziesz w stanie zachować swoich danych. Stwórz zewnętrzną kopie zapasową, jeśli chcesz je zachować.

source: You can `Download the UBports Installer from GitHub <https://github.com/ubports/ubports-installer/releases/latest>`_. The following packages are available:
de: Auf der `Download-Seite <https://github.com/ubports/ubports-installer/releases/latest>`_ lässt sich der Installer für das eigene Betriebssystem herunterladen. Die folgenden Pakete sind verfügbar:
nb: Du kan `Laste ned UBports Installer fra GitHub <https://github.com/ubports/ubports-installer/releases/latest>`_. Følgende pakker er tilgjengelige:
pl: Możesz też `pobrać Instalator UBports z GitHuba <https://github.com/ubports/ubports-installer/releases/latest>`_. Dostępne są następujące pakiety:

source: `Ubuntu or Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<version-number>.deb``
de: `Ubuntu oder Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<Versions-Nummer>.deb``
nb: `Ubuntu eller Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<version-number>.deb``
pl: `Ubuntu lub Debian <https://devices.ubuntu-touch.io/installer/?package=deb>`_: ``ubports-installer-<version-number>.deb``

source: `Other Linux distributions (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<version-number>.snap``
de: `Andere Linux-Distributionen (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<Versions-Nummer>.snap``
nb: `Andre Linux distributioner (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<version-number>.snap``
pl: `Inne dystrybucje Linuxowe (snap) <https://snapcraft.io/ubports-installer>`_: ``ubports-installer-<version-number>.snap``

source: `Other Linux distributions (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<version-number>.AppImage``
de: `Andere Linux-Distributionen (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<Versions-Nummer>.AppImage``
nb: `Andre Linux distributioner (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<version-number>.AppImage``
pl: `Inne dystrybucje Linuxowe (AppImage) <https://devices.ubuntu-touch.io/installer/?package=appimage>`_: ``ubports-installer-<version-number>.AppImage``

source: Start the installer and follow the on-screen instructions that will walk you through the installation process. That's it! Have fun exploring Ubuntu Touch!
ca: Inicieu l'instal·lador i seguiu les instruccions a la pantalla que us conduiran a través del procés d'instal·lació. Això és tot! Que gaudiu explorant l'Ubuntu Touch!
de: Man startet den Installer und folgt einfach den Anweisungen, die einen durch den Installationsvorgang führen. Das ist alles! Viel Spaß beim Erkunden von Ubuntu Touch!
es: Inicie el instalador y siga las instrucciones en pantalla que lo guiarán a través del proceso de instalación. ¡Eso es! ¡Diviértase explorando Ubuntu Touch!
pl: Rozpocznij instalacje i wykonuj instrukcje pojawiające się na ekranie, przeprowadzą cię przez cały proces instalacji. To wszystko! Ciesz się eksplorowaniem Ubuntu Touch!

source: If you're an experienced android developer and want to help us bring Ubuntu Touch to more devices, visit the :doc:`porting section </porting/Intro>`.
de: Erfahrene Android-Entwickler, die helfen wollen, Ubuntu Touch auf mehr Geräte zu bringen, finden Infos im :doc:`Portierungsabschnitt </porting/Intro>`.
pl: Jeśli jesteś doświadczonym programistą androidowym i chcesz pomóc nam poszerzyć liste urządzeń wspieranych przez Ubuntu Touch, odwiedź :doc: `sekcje portowania </porting/Intro>`.

source: If you need help, you can join UBports' support channels on `telegram <https://t.me/WelcomePlus>`_ or `matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ or ask a question `in the forum <https://forums.ubports.com/>`_ or on `askubuntu <https://askubuntu.com>`_. If you believe that the UBports Installer is not working correctly, you can also `file a new issue <https://github.com/ubports/ubports-installer/issues/new>`_ to help us solve the problem.
de: Wenn Sie Hilfe benötigen, können Sie den UBports Support-Channeln auf `Telegram <https://t.me/WelcomePlus>`_ oder `Matrix <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ folgen, oder eine Frage `im Forum <https://forums.ubports.com/>`_ oder auf `Askubuntu <https://askubuntu.com>`_ stellen. Wenn Sie glauben, dass der UBports Installer nicht korrekt funktioniert, können Sie auch eine `Github Issue erzeugen <https://github.com/ubports/ubports-installer/issues/new>`_, um uns dabei zu helfen das Problem zu lösen.
pl: Jeśli potrzebujesz pomocy możesz dołączyć do grupy pomocy UBports na `telegramie <https://t.me/WelcomePlus>`_ albo `matrixie <https://matrix.to/#/!KwdniMNeTmClpgHkND:matrix.org?via=matrix.org&via=ubports.chat&via=disroot.org>`_ lub zadać pytanie `na forum <https://forums.ubports.com/>`_ . Jeżeli masz wątpliwości czy Instalator UBports działa poprawnie, możesz równiesz `rozpocząć nowy problem <https://github.com/ubports/ubports-installer/issues/new>`_ aby pomóc nam go rozwiązać.

source: Connection lost during installation
de: Verbindung während der Installation verloren
pl: Utrata połączenia podczas instalacji

source: Try a different USB cable and a different USB port on your computer. Cheap and old cables tend to lose connection during the installation.
de: Versuchen Sie ein anderes USB-Kabel und einen anderen USB-Anschluss an Ihrem Computer zu nutzen. Günstige und alte Kabel neigen dazu die Verbindung während der Installation zu verlieren.
nb: Prøv en annen USB-kabel og en annen USB-port på datamaskinen. Billige og gamle kabler har en tendens til å miste tilkoblingen under installasjonen.
pl: Spróbuj innego kabla USB i innego portu USB w twoim komputerze. Tanie i stare kable mają słonność to tracenia połączenia podczas instalacji.

source: Windows Defender prevents Installer from starting
de: Windows Defender verhindert den Installer zu starten
nb: Windows Defender forhindrer installasjonen i å starte
pl: Windows Defender zapobiegł startowi Instalatora

source: We have contacted Microsoft about this problem, but they seem to think it's `enjoyable <https://twitter.com/Windows/status/1014984163433295875>`__. To dismiss the warning, click on "More Information", then select "Run anyway".
de: Wir haben Microsoft bezüglich dieses Problems kontaktiert, aber Sie scheinen zu denken das sei ein `erfreuliches Feature <https://twitter.com/Windows/status/1014984163433295875>`__. Um die Warnung zu ignorieren, klicken Sie auf "Mehr Informationen", und wählen Sie dann "Trotzdem starten".
pl: Skontaktowaliśmy się z Microsoftem ws. tego problemu, jednak oni uważają, że `jest nam do śmiechu <https://twitter.com/Windows/status/1014984163433295875>`__. Aby odrzucić ostrzeżenie, kliknij na "Więcej Informacji", potem zaznacz "Uruchom mimo to".

source: Device not detected
de: Gerät nicht erkannt
pl: Nie wykryto urządzenia

source: Virtual Machine
de: Virtuelle Maschine
pl: Wirtualna maszyna

source: If you're running the installer in a virtual machine, make sure the virtual machine is allowed to access the USB port.
de: Wenn Sie den Installer in einer virtuellen Maschine starten, stellen Sie sicher der virtuellen Maschine den Zugriff auf den USB Anschluss zu gewähren.
nb: Hvis du kjører installasjonsprogrammet på en virtuell maskin, må du sørge for at den virtuelle maskinen har tilgang til USB-porten.
pl: Jeśli instalator działa w maszynie wirtualnej, upewnij się, że maszyna ma dostęp do portu USB.

source: Windows ADB drivers
de: Windows ADB Treiber
nb: Windows ADB drivere
pl: Sterowniki ADB dla Windowsa

source: Install the `universal adb driver <http://adb.clockworkmod.com/>`_ and reboot your computer.
de: Installieren Sie den `universal adb driver <http://adb.clockworkmod.com/>`_ und starten Sie Ihren Computer neu.
nb: Installer den `universelle adb-driveren <http://adb.clockworkmod.com/>`_ og start datamaskinen på nytt.
pl: Zainstaluj `uniwersalne sterowniki adb <http://adb.clockworkmod.com/>`_ i uruchom ponownie swój komputer.

source: Run ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` in the terminal and restart the installer. This does not affect the snap package.
de: Führen Sie ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` im Terminal aus und starten Sie den Installer neu. Dies betrifft nicht das Snap package.
pl: Wykonaj ``echo 0x2ae5 >> ~/.android/adb_usb.ini`` w terminalu i zresetuj instalator. Nie dotyczy pakietu ze snapa.

source: Missing udev-rules
de: Fehlende udev Regeln
pl: Brak udev-rules

source: If the device not detected on Linux and packages other than snap, you might be missing **udev-rules**.
de: Wenn das Gerät unter Linux und bei anderen Paketen außer Snap nicht erkannt wird, könnten Ihnen **udev-rules** fehlen.
pl: Jeśli urządzenie nie zostało wykryte na Linuxie i pakietach innych niż snap, może ci brakować **udev-rules**.

source: See if ``/etc/udev/rules.d/51-android.rules`` exists and contains the rules below. If not, add them to the file and run ``sudo service udev restart`` or ``sudo udevadm control --reload-rules && udevadm trigger``.
de: Prüfen Sie, ob ``/etc/udev/rules.d/51-android.rules`` existiert und die nachfolgend genannten Regeln enthält. Wenn nicht, fügen Sie diese zu der Datei hinzu und führen Sie ``sudo service udev restart`` oder ``sudo udevadm control --reload-rules && udevadm trigger`` aus.
nb: Sjekk om``/etc/udev/rules.d/51-android.rules`` finnes og inneholder reglene nedenfor. Hvis ikke kan du legge dem til og kjøre ``sudo service udev restart`` eller ``sudo udevadm control --reload-rules && udevadm trigger``.
pl: Zobacz czy ``/etc/udev/rules.d/51-android.rules`` istnieją i zawierają zasady poniżej. Jeśli nie, dodaj je do tego pliku i wykonaj ``sudo service udev restart`` lub ``sudo udevadm control --reload-rules && udevadm trigger``.

source: Other issues
de: Andere Probleme
nb: Andre problemer
pl: Inne problemy

source: If the troubleshooting tips do not work, you might also try following the manual installation instructions for your device `on the devices page <https://devices.ubuntu-touch.io/>`_.
de: Wenn die Problembehandlungs-Hinweise nicht funktionieren, könnten Sie auch versuchen die folgenden manuellen Installations-Anweisungen für Ihr Gerät `auf der Geräte-Seite <https://devices.ubuntu-touch.io/>`_ auszuführen.
nb: Hvis feilsøkingstipsene ikke fungerer, kan du også prøve å følge de manuelle installasjonsinstruksjonene for enheten `på enhetssiden <https://devices.ubuntu-touch.io/>`_.
pl: Jeśli wymienione wskazówki nie działają, możesz sprawdzić instrukcje instalacji dla twojego urządzenia `na stronie z urządzeniami <https://devices.ubuntu-touch.io/>`_.

source: Install on legacy Android devices
ca: Instal·lació a dispositius Android clàssics
de: Installation auf Altgeräten
es: Instalación en dispositivos Android heredados (legacy)
nb: Installer på eldre Android-enheter
pl: Instalacja na starszych urządzeniach z Androidem

source: While the installation process is fairly simple on most devices, some legacy Bq and Meizu devices require special steps. This part of the guide does not apply to other devices.
ca: Tot i que el procés d'instal·lació és relativament senzill a la major part de dispositius, alguns dispositius Bq i Meizu clàssics requereixen de passos especials. Aquesta part de la guia no s'aplica a d'altres dispositius.
de: Während die Installation auf den meisten Geräten recht einfach ist, erfordern manche Geräte von BQ oder Meizu spezielle Schritte, aufgrund ihrer geschlossenen Natur. Dieser Teil der Anleitung gilt nicht für andere Geräte.
pl: Proces instalacji jest bardzo prosty na większości urządzeń, jedynie niektóre starsze urządzenia Bq i Meizu potrzebują dodatkowych kroków. Ta część poradnika nie obejmuje pozostałych urządzeń.

source: This is more or less uncharted territory. If your device's manufacturer does not want you to install an alternative operating system, there's not a lot we can do about it. The instructions below should only be followed by experienced users. While we appreciate that lots of people want to use our OS, flashing a device with OEM tools shouldn't be done without a bit of know-how and plenty of research.
ca: Això és més o menys territori sense trepitjar. Si el fabricant del vostre dispositiu no vol que us instal·leu un sistema operatiu alternatiu, no hi ha massa cosa que podem fer. Les instruccions a sota les haurien de seguir únicament els usuaris experimentats. Tot i que ens agrada que molta gent vulgui usar el nostre sistema operatiu, instal·lar a un dispositiu amb eines OEM no s'hauria de fer sense una mica de coneixement i molta recerca.
de: Das ist mehr oder weniger unbekanntes Gebiet. Wenn der Hersteller deines Gerätes nicht möchte, dass ein alternatives Betriebssystem installiert wird, dann können wir nicht viel machen. Die folgenden Anweisungen sollten nur von erfahrenen Nutzern befolgt werden. Während wir wertschätzen, dass viele Menschen unser Betriebssystem nutzen wollen, sollte das Flashen eines Gerätes mit OEM-Werkzeugen nicht ohne ein bisschen Knowhow und viele Nachforschungen gemacht werden.
pl: To jest mniej więcej niezbadany grunt. Jeśli producent twojego urządzenia nie chce byś instalował inne systemy operacyjne niewiele możesz z tym zrobić. Instrukcje poniżej powinny być wykonywane tylko przez doświadcznoych użytkowników. Doceniamy, że sporo osób chce używać naszego systemu, ale flashowanie urządzenia nie powinno mieć miejsca bez odrobiny wiedzy jak to zrobić i mnóstwa wyszukiwania.

source: Meizu devices are pretty much stuck on Flyme. While the MX4 can be flashed successfully in some cases, the Pro5 is Exynos-based and has its own headaches.
ca: Els dispositius Meizu estan més o menys bloquejats amb el Flyme. Mentre que el MX4 es pot instal·lar amb èxit en alguns casos, el Pro5 està basat en Exynos i presenta els seus propis maldecaps.
de: Meizu-Geräte hängen so ziemlich bei Flyme fest. Während das MX4 erfolgreich in einigen Fällen geflasht werden kann, ist das Pro5 Exynos-basiert und hat seine eigenen Probleme.
pl: Urządzenia Meizu przeważnie zatrzymują się na Flyme. Podczas gdy MX4 może zostać zflashowana bez problemu w niektórych przypadkach, Pro5 bazujący na Exynosie ma swoje kaprysy.

source: BE VERY CAREFUL! You are responsible for your own actions!
ca: ANEU AMB MOLTA CURA! Sou responsable de les vostres pròpies accions!
de: HÖCHSTE VORSICHTIG! Alle Aktionen auf eigene Gefahr!
nb: VÆR VELDIG FORSIKTIG! Du er ansvarlig for dine egne handlinger!
pl: BĄDŹ OSTROŻNY! Robisz to na własną odpowiedzialność!

source: Disconnect all devices and non-essential peripherals from your PC. Charge your device on a wall-charger (not your PC) to at least 40 percent.
de: Trennen Sie alle Geräte und nicht-essentielle Peripherie von Ihrem Rechner. Laden Sie Ihr Gerät an der Steckdose (nicht am Rechner) auf mindestens 40 Prozent auf.
pl: Odłącz wszystkie urządzenia i niepotrzebne peryferia z komputera. Naładuj swoje urządzenia do conajmniej 40 procent.

source: Download the Ubuntu Touch ROM for your device and extract the zip files:
de: Ubuntu Touch ROM für Ihr Gerät herunterladen und Entpacken der ZIP-Dateien:
nb: Last ned Ubuntu Touch ROM for enheten din og pakk ut zip-filene:
pl: Pobierz ROM Ubuntu Touch na twoje urządzenie i rozpakuj pliki zip:

source: Download the latest version of `SP flash tool <https://spflashtool.com/download/>`_ (*aka MTK flash tool*).
de: Die neueste Version des `SP Flash Tools <https://spflashtool.com/download/>`_ (*aka MTK flash tool*) wird benötigt.
nb: Last ned siste versjon av`SP Flash Tool <https://spflashtool.com/download/>`_ (*også kjent som MTK flash tool*).
pl: Pobierz najnowszą wersje `SP flash tool <https://spflashtool.com/download/>`_ (*aka MTK flash tool*).

source: Extract the zip files
de: Die zip-Dateien entpacken
nb: Pakk ut zip filene
pl: Rozpakuj pliki zip

source: Open a Terminal, enter the SP flash tool directory and run it with ``sudo ./flash_tool.sh``.
de: Öffnen Sie ein Terminal, navigieren Sie in das Verzeichnis des SP Flash Tools und starten Sie es mit ``sudo ./flash_tool.sh``.
pl: Otwórz Terminal, wejdź do folderu gdzie znajduje się SP flash tool i wpisz ``sudo ./flash_tool.sh``.

source: On Ubuntu 17.10, there are issues with flash_tool loading the shared library 'libpng12', so this can be used as a workaround:
ca: A l'Ubuntu 17.10. hi ha problemes amb el flash_tool carregant la biblioteca compartida 'libpng12', així que això podria usar-se com a alternativa:
de: In Ubuntu 17.10 hat flash_tool Probleme mit dem Laden der Bibliothek 'libpng12'. Abhilfe schafft Folgendes:
pl: Na Ubuntu 17.10 występują problemy podczas ładowania biblioteki 'libpng12' przez flash_tool, użyj tego jako obejścia:

source: In the "Scatter-loading File" section, press the "choose" button and select the ``*Android_scatter.txt`` file from the archive you downloaded in the second step.
de: Im "Scatter-loading File" Bereich, klicken Sie auf den "choose"-Button und wählen Sie die Datei ``*Android_scatter.txt`` aus dem Archiv, das sie im zweiten Schritt heruntergeladen haben.
pl: W sekcji "Scatter-loading File", naciśnij przycisk "choose" i zaznacz plik ``*Android_scatter.txt`` z archiwum, które pobrałeś/aś w poprzednim etapie.

source: Choose "Firmware Upgrade" from the drop-down menu.
de: "Firmware Upgrade" aus dem Drop-Down-Menü wählen
nb: Velg "Firmware Upgrade" fra rullegardinmenyen.
pl: Wybierz "Firmware Upgrade" z wysuwanego menu.
