Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: While the installation process is fairly simple on most devices, some legacy Bq and Meizu devices require special steps due to their closed nature. This part of the guide does not apply to any other devices or bq devices that are running the Canonical version of Ubuntu Touch.
es: Mientras que el proceso de instalación es bastante simple en la mayoría de los dispositivos, algunos dispositivos heredados (legacy) Bq y Meizu necesitan unos pasos especiales debido a su naturaleza cerrada. Esta parte de la guía no se aplica a ningún otro dispositivo o dispositivos Bq que están usando la versión Ubuntu Touch de Canonical.

source: This is more or less uncharted territory. If the device manufacturers don't want you to install an alternative operating system on their devices, there's not a lot we can do about it. The instructions below are very vague and should only be followed by experienced users. While we appreciate that lots of people want to use our OS, flashing a device with OEM tools shouldn't be done without a bit of know-how and plenty of research.
es: Esto es mas o menos territorio inexplorado. Si los fabricantes del dispositivo no quieren que instale un sistema operativo alternativo en sus dispositivos, no hay mucho que podamos hacer nosotros. Las instrucciones de abajo son muy vagas y deben seguirlas solo los usuarios experimentados. Mientras que apreciamos que montones de personas quieran usar nuestro sistema operativo, flashing un dispositivo con herramientas OEM no debería hacerse sin un poco de conocimiento y un montón de investigación.

source: BQ devices: Download the official Ubuntu Edition firmware from `their website <http://www.mibqyyo.com/en-download/>`_ and use their SP Flash Tool to flash it.
es: Dispositivos BQ: descargue el firmware oficial de Ubuntu Edition de `su web <http://www.mibqyyo.com/en-download/>`_ y use su herramienta SP Flash para la instalación.

source: Meizu devices: You are pretty much stuck on Flyme. For the MX4, there are some instructions floating around for downgrading your OS, gaining root with an exploit, unlocking your bootloader, and so on. We aren't going to link to them here for obvious reasons. The Pro5 is Exynos-based and has its own headaches. You're even more at your own risk on these.
es: Dispositivos Meizu: mayormente está atascado con Flyme. Para el MX4, hay algunas instrucciones por ahí para bajar de versión su sistema operativo, obtener root mediante una vulnerabilidad de seguridad (exploit), desbloqueando su cargador de arranque (bootloader), y así. No podemos enlazarlas desde aquí por razones evidentes. El Pro5 está basado en Exynos y tiene sus propios dolores de cabeza. Usted está aún más a su propio riesgo en estos.

source: BE VERY CAREFUL! Getting this part wrong can permanantly damage or brick your device. NEVER check the "Format All" option in SP Flash Tool and carefully read everything that it tells you. Some users have destroyed the partition that holds their hardware IDs and can no longer connect to Wi-Fi or cellular networks.
es: ¡TENGA MUCHO CUIDADO! Realizando esta parte mal puede dañar o bloquear permanentemente su dispositivo. NUNCA seleccione la opción "Formatear todo" en la herramienta SP Flash y lea cuidadosamente todo lo que le diga. Algunos usuarios han destrozado la partición que guarda la identificación de su hardware y no pueden nunca mas conectarse a una red inalámbrica o a una red móvil.
