Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: ``-t type`` type can be either ``chroot`` or ``lxc``. Default is ``chroot`` and is compatible with every device. If the kernel of your device supports it then ``lxc`` is suggested.
ca: `-t type`` type (tipus) pot ser ser o bé ``chroot`` o ``lxc``. Per defecte és ``chroot`` i és compatiible amb tots els dispositius. Si el nucli del vostre dispositiu li dóna suport aleshores se suggereix ``lxc``.
de: ``-t type`` der Typ kann entweder ``chroot`` oder ``lxc`` sein. Standard ist ``chroot`` und ist kompatibel mit jedem Gerät. Falls der Kernel des Geräts dies unterstützt, dann ist ``lxc`` empfehlenswert.
es: ``-t type`` type puede ser tanto ``chroot`` como ``lxc``. Por defecto es ``chroot`` y es compatible con todos los dispositivos. Si el núcleo de su dispositivo lo soporta, entonces es ``lxc`` la opción sugerida.
nb: ``-t type``-type kan være enten``chroot`` eller ``lxc``. Forvalget er ``chroot`` og er kompatibelt med alle enhter. Om kjernen på din enhet støtter det foreslås bruk av ``lxc``.
pl: ``-t rodzaj`` może być `chroot`` lub ``lxc``. Domyślnie jest ``chroot``, ale jeśli kernel twojego urządzenia wspiera ``lxc`` to jest ono rekomendowane.

source: The creating process can take some time, due to the size of the container (some hundred of megabytes).
ca: El procés de creació pot portar un cert temps, a causa de la mida del contenidor (algunes centenars de megabytes).
de: Der Erstellprozess kann einige Zeit in Anspruch nehmen, aufgrund der Größe des Containers (mehrere hundert Megabyte).
es: El proceso de creación puede tardar algún tiempo, debido al tamaño del contenedor (algunos cientos de megabytes).
nb: Opprettingsprosessen kan ta litt tid på grunn av størrelsen på beholderen (noen hundre megabyte).
pl: Proces tworzenia może potrwać troche czasu, spowodowany romiarem kontenera (kilkaset megabajtów).

source: The ``create`` command shown above cannot be run directly in the terminal app, due to apparmor restrictions. You can run it from another device using either ``adb`` or ``ssh`` connection. Alternatively, you can run it from the terminal app using a loopback ssh connection running this command: ``ssh localhost``.
de: Der zuvor gezeigte ``create``-Befehl kann aufgrund von apparmor-Restriktionen nicht direkt in der Terminal-App ausgeführt werden. Er lässt sich stattdessen von einem anderen Gerät aus entweder über ``adb`` oder ``ssh`` starten. Alternativ lässt er sich in der Terminal-App über eine Loopback-SSH-Verbindung mithilfe des Kommandos ``ssh localhost`` ausführen.
pl: Komenda ``create`` pokazana wyżej nie może być uruchomiona bezpośrednio w aplikacji terminala przez restrykcje apparmor. Możesz uruchomić ją z innego urządzenia używając połączenia``adb`` albo ``ssh``. Alternatywnie możesz uruchomić ją z aplikacji terminala używając wstecznie zapętlonego połączenia ssh, uruchamiając tą komende: ``ssh localhost``.

source: List containers
ca: Fer una llista de contenidors
de: Container auflisten
es: Lista de contenedores
pl: Wyświetl kontenery

source: Use the *Settings Manage Libertine Containers* sub-menu to list all the containers you have created on the device.
de: Nutzen Sie das Untermenü *Settings Manage Libertine Containers*, um alle Container aufzulisten, die Sie auf dem Gerät erzeugt haben.
pl: Używaj sub-menu *Settings Manage Libertine Containers*, aby wyświetlić wszystkie kontenery, które stworzyłeś na tym urządzeniu.

source: You can also use the command line. Run::
de: Sie können auch die Kommandozeile nutzen::
nb: Du kan også bruke kommandolinjen. Kjør::
pl: Możesz też użyć wiersza poleceń. Wpisz::

source: Destroy a container
ca: Destrucció d'un contenidor
de: Einen Container zerstören
es: Destruir un contenedor
pl: Zniszcz kontener

source: Manage applications
ca: Gestió d'aplicacions
de: Anwendungen verwalten
es: Gestionar aplicaciones
nb: Administrer applikasjoner
pl: Zarządzaj aplikacjami

source: Once a container is set up, the installed applications are available in the app drawer. You can also tap the name of the container in the *Manage Libertine Containers* menu.
de: Sobald ein Container aufgesetzt ist, werden die installierten Applikationen in der App-Übersicht angezeigt. Sie können auch den Namen des Containers im Menü *Manage Libertine Containers* antippen.
pl: Kiedy kontener jest skonfigurowany, zainstalowane aplikacje będą dostępne na liście aplikacji. Będziesz też mógł/a kliknąć na nazwe kontenera w menu *Manage Libertine Containers* .

source: You can also list them via command line::
de: Sie können diese auch über die Kommandozeile auflisten::
nb: Du kan også liste dem via kommandolinjen ::
pl: Możesz też je wypisać z wiersza poleceń::

source: Install a package
de: Installieren Sie ein Paket
nb: Installer en pakke
pl: Zainstaluj pakiet

source: From the apps list in the *Manage Libertine Containers* menu tap the + sign to get a dialog box to add a package.
de: Ausgehend von der App-Liste im Menü *Manage Libertine Containers* tippen Sie auf das + Zeichen, um eine Dialogbox zu öffnen, mit der Pakete hinzugefügt werden können.
pl: Z poziomu aplikacji wypisanych w menu *Manage Libertine Containers* kliknij znak +, aby dodać pakiet.

source: Enter the package name if you know it. Otherwise you can search the archives for a package. You can make this process easier by making the *Lubuntu Software Center* your first package install. Being a desktop app, you will need to use the *Libertine Tweak Tool* in the *Open Store* to make the text large enough to read on a mobile device.
de: Geben Sie den Paket-Namen ein, wenn er Ihnen bekannt ist. Anderenfalls können Sie in den Archiven nach dem Paket suchen. Sie können diesen Prozess vereinfachen, indem Sie als erstes Paket das *lubuntu-software-center* installieren. Da es sich um eine Desktop-Applikation handelt, werden Sie das *Libertine Tweak Tool* im *Open Store* verwenden müssen, um den Text ausreichend groß zu skalieren, damit er auf einem Mobilgerät gelesen werden kann.
nb: Skriv inn pakkenavnet hvis du vet det. Ellers kan du søke i arkivene etter en pakke. Du kan gjøre denne prosessen enklere ved å gjøre * Lubuntu Software Center * til din første pakkeinstallasjon. For å være en stasjonær app, må du bruke * Libertine Tweak Tool * i * Open Store * for å gjøre teksten stor nok til å lese på en mobil enhet.
pl: Wprowadź nazwe pakietu, jeśli ją znasz. W przeciwnym wypadku możesz poszukać pakietu w archiwach. Możesz uczynić to jeszcze prostrzym instalując najpierw *Lubuntu Software Center*. Mówiąc o aplikacjach desktopowych, będziesz musiał/a użyć *Libertine Tweak Tool* z *Open Store*, aby ustawić tekst wystarczająco dużym, by móc go odczytać na urządzeniu mobilnym.

source: Packages may also be installed via command line::
de: Pakete können auch über die Kommandozeile installiert werden::
nb: Pakker kan også installeres via kommandolinjen ::
pl: Pakiety mogą być również zainstalowane poprzez wiersz poleceń::

source: Remove a package
de: Entfernen Sie ein Paket
nb: Fjern en pakke
pl: Usuń pakiet

source: On the package list, within the container (*System Settings* > *Libertine* > *Manage Libertine Containers* > *CONTAINER NAME*), swipe right on the package you want to remove to reveal the option to remove the package.
de: In der Paketliste innerhalb des Containers (*Systemeinstellungen* > *Libertine* > *Manage Libertine Containers* > *CONTAINER NAME*), streichen Sie nach rechts über das Paket, das Sie entfernen wollen, um die entsprechende Option anzuzeigen, mit der das Paket gelöscht werden kann.
pl: Na liście pakietów w danym kontenerze ( *Ustawienia Systemowe*> *Libertine*> *Manage Libertine Containers* > *CONTAINER NAME*), przenieś się do pakietu, który chcesz usunąć, aby odsłonić opcje do usunięcia pakietu.

source: Or you can remove the package via the command line::
de: Oder entfernen Sie das Paket über die Kommandozeile::
nb: Eller du kan fjerne pakken via kommandolinjen ::
pl: Albo możesz usunąć patkiet poprzez wiersz poleceń::

source: If you have more than one container, then you can use the option ``-i CONTAINER-IDENTIFIER`` to specify for which container you want to perform an operation.
ca: Si teniu més d'un contenidor, aleshores podeu usar l'opció ``-i CONTAINER-IDENTIFIER`` per especificar per a quin contenidor voleu realitzar una operació.
de: Falls es mehr als einen Container gibt, kann man die Option ``-i CONTAINER-IDENTIFIER`` angeben, den Container auszuwählen, auf den die Operation ausgeführt werden soll.
es: Si tiene mas de un contenedor, entonces puede usar la opción ``-i CONTAINER-IDENTIFIER`` para especificar en que contenedor quiere llevar a cabo una operación.
pl: Jeśli masz więcej niż jeden kontener, możesz użyć opcji ``-i CONTAINER-IDENTIFIER``, aby sprecyzować, na którym kontenerze chcesz wykonać operacje.

source: Run desktop application
de: Desktop-Anwendungen nutzen
nb: Kjør skrivebordsapplikasjon
pl: Uruchamianie aplikacji desktopowych

source: Run it from the app menu like any other app. To start a graphical application from the command line, for example ``gedit``, run in a terminal::
de: Starten Sie es aus dem App-Menü wie jede andere App. Um eine grafische Applikation von der Kommandozeile zu starten, beispielsweise ``gedit``, führen Sie folgenden Befehl im Terminal aus::
nb: Kjør det fra appmenyen som alle andre apper. For å starte et grafisk program fra kommandolinjen, for eksempel `` gedit '', kjør i en terminal ::
pl: Uruchamiaj je jak pozostałe aplikacje. Aby zacząć aplikacje graficzną z wiersza poleceń, na przykład ``gedit``, wpisz w terminalu::

source: Files
ca: Fitxers
de: Dateien
es: Archivos
nb: Filer
pl: Pliki

source: Libertine applications do have access to these folders:
ca: Les aplicacions del Libertine tenen accés a les carpetes següents:
de: Libertine-Anwendungen haben Zugriff auf diese Ordner:
es: Las aplicaciones de Libertine tienen acceso a estas carpetas:
nb: Libertine-applikasjoner har tilgang til disse mappene:
pl: Aplikacje libertine mają dostęp do tych folderów:

source: Documents
de: Dokumente
es: Documentos
nb: Dokumenter
pl: Dokumenty

source: Music
ca: Música
de: Musik
es: Música
nb: Musikk
pl: Muzyka

source: Pictures
ca: Imatges
de: Bilder
es: Imágenes
nb: Bilder
pl: Zdjęcia

source: Downloads
ca: Descàrregues
es: Descargas
nb: Nedlastinger
pl: Pobrane

source: Videos
ca: Vídeos
es: Vídeos
nb: Videoer
pl: Filmy

source: Tips
de: Tipps und Tricks
pl: Porady

source: Locations
ca: Ubicacions
de: Verzeichnisse
es: Ubicación
nb: Lokasjoner
pl: Lokalizacje

source: For every container you create there will be two directories created:
ca: Per cada contenidor que creeu es crearan dos directoris:
de: Für jeden Container werden zwei Verzeichnisse erstellt:
es: Por cada contenedor que cree, se crearán dos directorios:
pl: Dla każdego nowego kontenera, zostaną sworzone dwa foldery:

source: A root directory ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` and
ca: Un directori arrel ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` i
de: Ein Wurzelverzeichnis ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` und
es: Un directorio raíz ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` y
nb: En rotmappe ``~/.cache/libertine-container/CONTAINER-IDENTIFIER/rootfs/`` og
pl: folder roota ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``

source: a user directory ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
ca: un directori d'usuari ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
de: ein Nutzerverzeichnis ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
es: un directorio de usuario ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``
pl: folder urzytkownika ``~/.local/share/libertine-container/user-data/CONTAINER-IDENTIFIER/``

source: Shell access
ca: Accés a la consola
de: Shell-Zugriff
es: Acceso al terminal
nb: Terminalvindutilgang
pl: Dostęp do powłoki

source: There are 2 options for executing commands inside the container.
de: Es gibt zwei Möglichkeiten, Befehle innerhalb des Containers auszuführen.
pl: Są dwa sposoby na wykonywanie komend w kontenerze.

source: **The first option** is based on ``libertine-container-manager exec``. It lets you run your commands as root. The drawback is that the container is not completely set up. So far we know that the `folders mentioned above (Documents, Music, ...) are not mounted <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>`_ i.e., the ``/home/phablet/`` directory is empty. Likewise the directory referenced in ``TMPDIR`` is not available which may lead to problems with software that tries to create temporary files or directories. You may use this option e.g., for installing packages.
de: **Die erste Option** basiert auf ``libertine-container-manager exec``. Es ermöglicht es Ihnen, Befehle als root auszuführen. Der Nachteil ist, dass der Container nicht vollständig konfiguriert ist. Bisher wissen wir, dass die zuvor genannten `Ordner (Dokumente, Musik,...) nicht gemountet sind <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>``_ d. h. das Verzeichnis ``/home/phablet/`` ist leer. Ebenso ist das unter ``TMPDIR`` referenzierte Verzeichnis nicht verfügbar, was zu Problemen mit Applikationen führen kann, die versuchen temporäre Dateien oder Verzeichnisse zu erstellen. Sie können diese Option z. B. für die Installation von Paketen verwenden.
pl: **Pierwsza opcja** jest bazowana na ``libertine-container-manager exec``. Pozwala uruchamiać twoje komendy jako root. Wadą jest to, że kontener nie jest w pełni skonfigurowany. Na tę chwile wiemy, że `foldery wymienione powyżej (Documents, Music, ...) nie są zamontowane <https://askubuntu.com/questions/831830/libertine-terminal-applications-how-to-access-to-the-real-home-dir#comment1273744_833984/>`_ t.j., lokalizacja ``/home/phablet/`` jest pusta. Także folder wymieniony w ``TMPDIR`` nie jest dostępny, co może prowadzić do problemów z oprogramowaniem, które próbuje stworzyć chwilowe pliki lub foldery. Możesz użyć tej opcji np, do instalowania pakietów.

source: To execute a command you can use the following pattern::
de: Um einen Befehl auszuführen, können Sie folgendes Schema verwenden::
nb: For å utføre en kommando kan du bruke følgende mønster:
pl: Aby wykonać komende, możesz użyć podanego schematu::

source: For example run::
de: Führen Sie zum Beispiel aus::
nb: For eksempel kjør::
pl: Na przyład wykonaj::

source: To get a shell into your container as ``root`` run::
de: Um eine ``root`` Shell in Ihrem Container zu bekommen, führen Sie folgendes aus::
pl: Aby uzystać dostęp do powłoki kontenera jako ``root`` wpisz::

source: **The second option** is based on ``libertine-launch``. It will execute your commands as user phablet in a completely set up container. So you may use this option to modify your files using installed packages.
de: **Die zweite Option** basiert auf dem ``libertine-launch``. Es führt Ihre Befehle als user phablet in einem komplett eingerichteten Container aus. Sie können diese Option also verwenden, um Ihre Dateien mit installierten Paketen zu ändern.
pl: **Druga opcja** jest bazowana na ``libertine-launch``. Wykona twoje komendy jako użytkonik phablet w pełni skonfigurowanym kontenerze. Więc możesz użyć tej opcji, aby modyfikować twoje pliki używając zainstalowanych pakietów.

source: To get a shell as user ``phablet`` run::
de: Um eine Shell als Benutzer ``phablet`` zu erhalten, führen Sie folgendes aus::
pl: Aby uzyskać powłoke jako użytkownik ``phablet`` wpisz::

source: When you launch bash in this way you will not get any specific feedback to confirm that you are now *inside* the container. You can check ``ls /`` to confirm for yourself that you are inside the container. The listing of ``ls /`` will be different inside and outside of the container.
ca: Quan llenceu el bash d'aquesta manera no obtindreu cap retorn específic per confirmar que esteu ara *a dins* del contenidor. Podeu verificar ``ls /`` per confirmar que esteu a dins del contenidor. La llista de ``ls /`` serà diferent a dins i a fora del contenidor.
de: Wenn bash auf diese Weise gestartet wird, erhält man keine spezielle Rückmeldung, dass man sich nun *in* einem Container befindet. Mithilfe von ``ls /`` lässt sich aber ermitteln, ob man sich in einem Container befindet. Die Auflistung von ``ls /`` ist unterschiedlich innerhalb und außerhalb.
es: Cuando inicie bash de esta manera no obtendrá ninguna reacción concreta que le confirme que ya está *dentro* de un contenedor. Puede comprobar ``ls /`` para confirmar que está dentro de un contenedor. La lista que mostrará ``ls /`` es diferente si está fuera o dentro del contenedor.
pl: Kiedy odpalisz basha w ten sposób nie otrzymasz, żadnego konkretnego oznaku, że jesteś *wewnątrz* kontenera. Możesz sprawdzić ``ls /``, aby potwierdzić, że jesteś wewnątrz kontenera. Wynik ``ls /`` będzie różny wewnątrz i na zewnątrz kontenera.

source: Accessing SD card
de: Zugriff auf SD-Karten
nb: Aksesserer SD kort
pl: Uzyskiwanie karty SD

source: In order to access your SD-card or any other part of the regular filesystem from inside your libertine container you must create a bind mount.
de: Um auf Ihre SD-Karte oder andere Bereiche des regulären Dateisystem innerhalb Ihrer Libertine Container zuzugreifen, müssen Sie einen *bind* Mountpunkt erzeugen.
pl: Aby uzyskać dostęp do karty SD lub innej części normalnego systemu plików wewnątrz twojego kontenera libertine musisz stworzyć wiązanie montowania.

source: In order to add a bind mount use::
de: Um einen bind mount hinzuzufügen nutzen Sie::
pl: Aby dodać wiązanie montowania użyj::

source: You can also make deep links in case you only want parts of your SD-card available in the container. In this case just the entire path to the directory you want to bind mount::
de: Sie können auch deep links erzeugen, sofern Sie nur bestimmte Teile Ihrer SD-Karte innerhalb des Containers verfügbar machen wollen. In diesem Fall geben Sie lediglich den vollständigen Pfad zu dem Verzeichnis an, für das sie einen bind mount erzeugen wollen::
pl: Możesz też stworzyć głęboki link w wypadku gdy chcesz, żeby tylko część twojej karty SD była dostępna w kontenerze. W tym wypadku po prostu cała ścieżka do położenia, do której chcesz dodać wiązanie montowania::

source: This will not allow the container access to any of the directories earlier in the path for anything other than accessing your mounted directory.
de: Dieses Vorgehen erlaubt dem Container nur auf das gemountete Verzeichnis zuzugreifen und schließt alle Verzeichnisse, die im Verzeichnisbaum darüber liegen, vom Zugriff auf.
pl: To nie pozwoli kontenerowi na dostęp do żadnej z poprzenich lokalizacji ścieżki innej niż twojej zamontowanej ścieżki.

source: In order to use the SD-card as extra space for your container, make sure first to format it using ext4 or similar. There is a mis-feature in udisk2 that mounts SD-cards (showexec) that ensures only files ending in .bat, .exe or .com can be executed from the drive if it is (v)fat formatted. This has been changed in other distributions allowing any file to have execute priviliges, but not ubuntu. The reccomended workaround is to add a udev rule to control how to mount a card with a given id, but since the udev rules are on the read only port on touch, this is not possible.
de: Um die SD-Karte als zusätzlichen Speicherplatz für Ihren Container zu nutzen, stellen Sie sicher sie zunächst mit ext4 oder einem ähnlichen Dateisystem zu formatieren. Es gibt ein mis-Feature in udisk2 um SD-Karten zu mounten (showexec) das sicherstellt, dass nur Dateien mit den Suffixen .bat, .exe oder .com in dem Verzeichnis ausgeführt werden dürfen, wenn es (v)fat formatiert ist. Das wurde in anderen Distributionen geändert, wodurch jede Datei Ausführrechte haben kann, aber nicht in Ubuntu. Der empfohlene Workaround ist, eine neue udev Regel anzulegen, die definiert, wie eine Karte mit einer gegebenen ID gemountet werden soll. Da aber udev rules auf der read only Seite von Ubuntu Touch liegen, ist das nicht möglich.
pl: Aby używać karty SD jako dodatkowe miejsce dla twojego kontenera, najpierw upewnij się, że . W udisk2 istnieje brak funkcjonalności, który montuje karty SD (showexec) i sprawia, że tylko pliki kończące się na .bat, .exe lub .com mogą zostać wykonane z dysku jeśli jest zformatowany formatowaniem (v)fat. Zostało to naprawione na innych dystrybucjach przez pozwolenie każdemu plikowi na uprawanienia wykonywania, ale nie na ubuntu. Rekomendowanym obejściem jest dodanie zasady udev, aby kontrolować jak zamontować karte z danym id, ale od kiedy zasady udev są tylko do odczytu, nie jest to możliwe.

source: Shortcuts
de: Tastenkombinationen
nb: Snarveier
pl: Skróty

source: If you want, you can add aliases for command line tools. Add lines like the following ones to your ``~/.bash_aliases``::
de: Wenn Sie möchten, können Sie Aliase für Kommandozeilenwerkzeuge hinzufügen. Füge Zeilen wie die folgenden zu deinen ``~/.bash_aliases`` hinzu::
pl: Jeśli chcesz, możesz dodać aliasty do narzędzi w wierszu poleceń. Dodaj do ``~/.bash_aliases`` linie podobne do następujących::

source: Background
ca: Explicació
de: Hintergrund
es: Contexto
nb: Bakgrunn
pl: Tło

source: A display server coordinates input and output of an operating system. Most Linux distributions today use the X server. Ubuntu Touch does not use X, but a new display server called Mir. This means that standard X applications are not directly compatible with Ubuntu Touch. A compatibility layer called XMir resolves this. Libertine relies on XMir to display desktop applications.
ca: Un servidor de pantalla coordina l'entrada i la sortida d'un sistema operatiu. La major part de les distribucions Linux avui en dia usen el servidor X. L'Ubuntu Touch no usa l'X, sinó un nou servidor de pantalla anomenat Mir. Això significa que les aplicacions estàndard de l'X no són directament compatibles amb l'Ubuntu Touch. Una capa de comptabilitat anomenada XMir resol això. El Libertine depèn del XMir per mostrar les aplicacions d'escriptori.
de: Ein Display Server koordiniert die Ein- und Ausgänge eines Betriebssystems. Die meisten Linux-Distributionen heutzutage nutzen den X Server. Ubuntu Touch nutzt aber nicht X, sondern einen neuen Display Server namens Mir. Das bedeutet, die Standard-X-Anwendungen sind nicht direkt kompatibel mit Ubuntu Touch. Eine Kompatibilitätsschicht namens XMir löst das. Libertine baut auf XMir auf, um Desktop-Anwendungen anzuzeigen.
es: Un servidor de pantalla coordina la entrada y salida de un sistema operativo. La mayoría de distribuciones Linux actuales usan el servidor X. Ubuntu Touch no usa X sino un nuevo servidor de pantalla llamado Mir. Esto significa que las aplicaciones estándar X no son directamente compatibles con Ubuntu Touch. Una capa de compatibilidad llamada XMir soluciona esto. Libertine depende de XMir para mostrar las aplicaciones de escritorio.
pl: Serwer wyświetlania koordynuje wejścia i wyjścia systemu operacyjnego. Większość Dystrybucji Linuxa używa dzisiaj serweru X. Ubuntu Touch nie używa X, a nowy serwer wyświetlania nazywany Mir. To znaczy, że standardowe aplikacje X nie są kompatybilne z Ubuntu Touch. Warstwa kompatybilności nazywana XMir rozwiązuje ten problem. Libertine polega na XMir, aby wyświetlać aplikacje desktopowe.
