Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: On computer: get your rndis ip address e.g:``hostname -I``
ca: A l'ordinador: obteniu la direcció ip rndis, per exemple: ``hostname -I``
de: Auf dem Rechner: die rndis-IP-Adresse ermitteln, z.B. per:``hostname -I``
es: En el ordenador: obtenga su dirección ip rndis p.ej. ``hostname -I``
nb: På datamaskinen: skaff din rndis ip address f.eks:``hostname -I``
pl: Na komputerze: zdobądź adres ip rndisu twojego urządzenia np: ``hostname -I``

source: On phone:
ca: Al telèfon:
de: Am Mobilgerät:
es: En el teléfono:
nb: På telefonen:
pl: Na telefonie:

source: add gateway: ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
ca: afegiu la passarel·la: ``sudo route add default gw RNDIS_IP_DEL_VOSTRE_ORDINADOR``
de: Vorgabestrecke hinzufügen: ``sudo route add default gw RECHNER_RNDIS_IP``
es: añada la vía: ``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
nb: legg til portner:``sudo route add default gw YOUR_COMPUTER_RNDIS_IP``
pl: dodaj brame: ``sudo route add default gw RNDIS_IP_TWOJEGO_KOMPUTERA``

source: add nameservers: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
ca: afegiu els servidors de noms: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
de: Namensserver hinzufügen: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
es: añada nombre de servidores: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
nb: legg til navnetjenere: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``
pl: dodaj serwery nazw: ``echo "nameserver 8.8.8.8" | sudo tee /etc/resolv.conf``

source: refresh dns table: ``resolvconf -u``
ca: actualitzeu la taula de dns: ``resolvconf -u``
de: DNS-Tabelle aktualisieren: ``resolvconf -u``
es: recargue la tabla dns: ``resolvconf -u``
nb: oppfrisk dns tabellen: ``resolvconf -u``
pl: odśwież tabele dns ``resolvconf -u``

source: On computer:
ca: A l'ordinador:
de: Auf dem Rechner:
es: En el ordenador:
nb: På datamaskinen:
pl: Na komputerze:

source: enable ip forwarding: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
ca: habiliteu el reenviament: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
de: IP-Weiterleitung aktivieren: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
es: habilite el reenvío de la ip: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
nb: aktiver ip videresending: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``
pl: włącz przesyłanie dalej ip: ``echo 1 | sudo tee /proc/sys/net/ipv4/ip_forward``

source: apply NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
ca: apliqueu el NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
de: NAT anwenden: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
es: aplique la traducción de direcciones de red (NAT): ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
nb: aktiver NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``
pl: zastotuj NAT: ``sudo iptables -t nat -A POSTROUTING -s 10.0.0.0/8 -o eth0 -j MASQUERADE``

source: References
ca: Referències
de: Referenzen
es: Referencias
nb: Referanser
pl: Źródła

source: Screen Casting your UT device to your computer
ca: Exportació de la pantalla del vostre dispositiu UT a l'ordinador
de: Bildschirmübertragung an den Rechner
es: Grabando la salida de pantalla (screencasting) de su dispositivo UT a su ordenador
nb: Skjermvideo fra din UT enhet til din datamaskin
pl: Nagrywanie ekranu twojego urządzenia UT na twoim komputerze

source: Ubuntu Touch comes with a command line utility called ``mirscreencast`` which dumps screen frames to a file. The idea here is to stream UT display to a listening computer over the network or directly trough adb so that we can either watch it live or record it to a file.
de: Ubuntu Touch kommt mit einem Befehlszeilenprogramm namens ``mirscreencast``, das Bildschirmframes in eine Datei ausgibt. Die Idee ist es, UT-Displays über das Netzwerk oder direkt über ADB an einen empfangenden Computer zu streamen, so dass wir sie entweder live ansehen oder in eine Datei aufnehmen können.
nb: Ubuntu Touch kommer med et kommandolinjeverktøy kalt ``mirscreencast`` som dumper skjermbilder til en fil. Ideen her er å strømme UT-skjerm til en datamaskin over nettverket eller direkte gjennom adb slik at vi enten kan se den live eller lagre den inn til en fil.
pl: Ubuntu Touch przychodzi z narzędziem wiersza poleceń nazywanym ``mirscreencast``, które zapisuje klatki obrazu do pliku. Zamysł jest taki, by streamować obraz UT na słuchający komputer poprzez sieć albo bezpośrednio przez adb tak, aby można było oglądać go na żywo albo nagrać do pliku.

source: Using adb
ca: Ús d'adb
de: Über adb
es: Usando adb
pl: Używanie adb

source: You can catch output directly from ``adb exec-out`` command and forward it to mplayer::
ca: Podeu capturar la sortida directament de l'ordre ``adb exec-out`` i enviar-la al mplayer::
de: Die Ausgabe kann direkt von ``adb exec-out`` an mplayer weitergeleitet werden::
es: Puede coger directamente la salida de la orden ``adb exec-out`` y enviarla a mplayer::
nb: Du kan hente utdata direkte fra kommandoen ``adb exec-out`` og videresende den til mplayer ::
pl: Możesz odebrać sygnał bezpośrednio komendą``adb exec-out`` i przekazać go do mplayera::

source: NB: ``timeout`` here is used in order to kill process properly on device ( here 120 seconds ). Otherwise process still continuing even if killed on computer. You can reduce or increase frame per second with``--cap-interval`` (1 = 60fps, 2=30fps, ...) and size of frames ``384 640`` means width=384 height=640
ca: Noteu: aquí s'usa ``timeout``per tancar adequadament el procés al dispositiu (aquí 120 segons). En cas contrari el procés continuarà encara tot i que s'hagi tancat a l'ordinador. Podeu reduir o incrementar els marcs per segon amb ``--cap-interval`` (1 = 60fps, 2=30fps, ...) i la mida dels marcs ``384 650`` significa amplada=384 alçada=640
de: Hinweis: ``timeout`` wird hier genutzt, um den Prozess auf dem Gerät wieder zu beenden (hier 120 Sekunden). Sonst würde der Prozess auf dem Telefon weiterlaufen, selbst nachdem er auf dem Rechner beendet wird. Die Bilder pro Sekunde können mit ``--cap-interval`` angepasst werden (1 = 60fps, 2=30fps, ...) und die Bildgröße mit ``384 640``, was Breite = 384 und Höhe = 640 bedeutet
es: Nota bene: ``timeout`` se usa aquí para finalizar adecuadamente el proceso en el dispositivo (en este caso 120 segundos). Si no el proceso continuaría incluso si es finalizado en el ordenador. Puede reducir o aumentar los fotogramas por segundo con ``--cap-interval`` (1 = 60fps, 2=30fps, ...) y el tamaño de los fotogramas ``384 640`` significa anchura=384 altura=640
nb: NB: ``timeout`` brukes her for å avslutte prosessen riktig på enheten (her 120 sekunder). Ellers fortsetter prosessen selv om den avsluttes på datamaskinen. Du kan redusere eller øke bilder per sekund med``-- cap-interval`` (1 = 60 bps, 2 = 30 bps, ...) og størrelsen på bildene ``384 640`` betyr bredde=384 høyde=640
pl: Uwaga: ``timeout`` jest używany aby prawidłowo zabić procesy na urządzeniu (tutaj 120 sekund). Inaczej procesy będą wciąż kontynuowane nawet jeśli zostaną zabite na komputerze. Możesz zredukować albo zwiększyć liczbe klatek na sekunde przez ``--cap-interval`` (1=60fps, 2=30fps, ...) i romiar klatek ``384 640`` to 384 szerokości i 640 wysokości

source: Via network
ca: Via xarxa
de: Via Netzwerk
es: Vía red
nb: Via nettverk
pl: Przez internet

source: On receiver
ca: Al receptor
de: Am Empfänger
es: En el receptor
nb: På mottakerenhet
pl: Na odbiorniku

source: For real time casting:
ca: Per emissió en temps real:
de: Für Echtzeit-Übertragung:
es: Para emisión (casting) en tiempo real:
nb: For sanntids skjermvideo:
pl: Dla przesyłania w czasie rzeczywistym:

source: Prepare your computer to listen to a tcp port(here 1234) and forward raw stream to a video player (here mplayer) with a frame size of 384x640::
ca: Prepareu el vostre ordinador per escoltar a un port tcp (aquí 1234) i reenviar l'emissió en brut a un reproductor de vídeo (aquí el mplayer) amb una mida de marcs de 384x640::
de: Man lässt den Rechner an einem TCP-Port lauschen (1234) und leitet den rohen Datenstrom an einen Videospieler (hier mplayer) mit einer Bildgröße hier von 384x640::
es: Prepare su ordenador para escuchar en un puerto tcp (en este caso 1234) y enviar la emisión sin procesar a un reproductor de vídeo (en este caso mplayer) con un tamaño de fotograma de 384x640::
nb: Klargjør datamaskinen din til å lytte til en tcp-port (her 1234) og videresend rå overføring til en videospiller (her mplayer) med en rammestørrelse på 384x640 ::
pl: Przygotuj twój komputer aby nasłuchiwał port tcp(tutaj 1234), rozpakowywał przekazywał surowy strumień do odtwarzacza video (tutaj mplayer) o wielkości obrazu 384x640 ::

source: For stream recording:
ca: Per a la gravació de la transmissió:
de: Zum Aufnehmen:
es: Para la grabación de la transmisión:
nb: For strømmeopptak:
pl: Dla nagrywania obrazu:

source: Prepare your computer to listen to a tcp port(here 1234), ungzip and forward raw stream to a video encoder (here mencoder)::
ca: Prepareu el vostre ordinador per escoltar al port tcp (aquí 1234), descomprimir amb el ungzip i reenviar l'emissió en brut a un codificador de vídeo (el mencoder en aquest cas)::
de: Man lässt den Rechner an einem TCP-Port lauschen (1234), entpackt die Pakete und leitet den rohen Datenstrom an einen Videokodierer (hier mencoder)::
es: Prepare su ordenador para escuchar en un puerto tcp (1234 en este caso), descomprima (ungzip) y envíe la emisión sin procesar a un codificador de vídeo (mencoder en este caso)::
nb: Klargjør datamaskinen din til å lytte til en tcp-port (her 1234), unzip og videresend rådatastrømmen til en videokoder (her mencoder) ::
pl: Przygotuj twój komputer aby nasłuchiwał port tcp(tutaj 1234), rozpakowywał gzip i przekazywał surowy strumień do enkodera video (tutaj mencoder)::

source: On device
ca: Al dispositiu
de: Auf dem Gerät
es: En el dispositivo
nb: På enhet
pl: Na urządzeniu

source: Forward and gzip stream with 60fps (--cap-interval 1) and frame size of 384x640 to computer 10.42.0.209 on port 1234 ::
ca: Envieu i comprimiu amb gzip amb 60fps(--cap-interval 1) i mida de marc de 384x640 al ordinador 10.42.0.209 al port 1234::
de: Man packt und leitet den Datenstrom mit einer Bildrate von hier 60fps (..cap-interval 1) und Bildgröße von 384x640 zum Rechner 10.42.0.209 auf Port 1234 ::
es: Envíe y comprima (gzip) la emisión a 60fps (--cap-interval 1) y un tamaño de fotograma de 384x640 al ordenador 10.42.0.209 en el puerto 1234 ::
pl: Przekaż i gzipuj strumień z 60fps'ami (--cap-interval 1) i klatke o rozmiarze 384x640 na komputer 10.42.0.209 na port 1234 ::

source: Example script
ca: Script d'exemple
de: Beispielskript
es: Script de ejemplo
nb: Eksempelskript
pl: Przykładowy skrypt

source: This script allows you to screen cast remote UT device to your local PC (must have ssh access to UT and mplayer installed on PC), run it on your computer::
ca: Aquest script us permet enviar la sortida de pantalla del vostre dispositiu UT remot al vostre PC local (ha de tenir accés per ssh al UT i el mplayer instal·lat al PC), executeu-lo al vostre ordinador::
de: Dieses Skript ermöglicht die Bildschirmübertragung zum lokalen Rechner (Voraussetzung ist SSH-Zugriff auf UT und der installierte mplayer auf dem Rechner). Auf dem Rechner führt man aus::
es: Este script le permite enviar la salida de pantalla de su dispositivo UT remoto a su PC local (debe tener acceso ssh a UT y mplayer instalado en su PC), ejecute en su ordenador::
pl: Ten skrypt pozwala ci zdalnie przesyłać ekran urządzenia UT na twój komputer (musisz mieć dostęp ssh do UT i mplayer zainstalowany na PC), wykonaj to na swoim komputerze::

source: You can download it here: :download:`files/mircast.sh`
ca: El podeu descarregar aquí: :download:`files/mircast.sh`
de: Hier: :download:`files/mircast.sh` ist das Skript zum Herunterladen
es: Puede descargarlo de aquí: :download:`files/mircast.sh`
nb: Du kan laste det ned her: download:`files/mircast.sh`
pl: Możesz pobrać to stąd: :download:`files/mircast.sh`

source: initial source: https://wiki.ubuntu.com/Touch/ScreenRecording
ca: font inicial: https://wiki.ubuntu.com/Touch/ScreenRecording
de: Ursprüngliche Quelle: https://wiki.ubuntu.com/Touch/ScreenRecording
es: fuente inicial: https://wiki.ubuntu.com/Touch/ScreenRecording
nb: innledende kilde: https://wiki.ubuntu.com/Touch/ScreenRecording
pl: pierwotne źródło: https://wiki.ubuntu.com/Touch/ScreenRecording

source: Shell access via ssh
ca: Accés a la consola via ssh
de: Shell-Zugriff über SSH
es: Acceso al terminal vía ssh
nb: Terminalvindu tilgang via ssh
pl: Dostęp do powłoki poprzez ssh

source: You can use ssh to access a shell from your PC. This is useful for debugging or more advanced shell usage.
ca: Podeu fer servir el ssh per accedir a una consola des del vostre PC. Això és útil per depurar o per a un ús més avançat de la consola.
de: SSH kann für einen Shell-Zugriff vom Rechner aus genutzt werden. Dies ist nützlich zur Fehlerdiagnose oder fortgeschrittene Shell-Nutzung.
es: Puede usar ssh para acceder al terminal desde su PC. Esto es útil para depurar o para un uso mas avanzado del terminal.
pl: Możesz używać ssh, aby uzystać dostęp do powłoki z poziomu twojego komputera. To jest bardzo przydatne podczas debuggowania albo bardziej zaawansowanych zastosowań powłoki.

source: You need a ssh key pair for this. Logging in via password is disabled by default.
ca: Us cal un parell de claus ssh per això. L'inici de sessió mitjançant contrasenya està deshabilitat de forma predeterminada.
de: Ein SSH-Schlüsselpaar wird benötigt. Das Einloggen per Passwort ist standardmäßig deaktiviert.
es: Necesita una pareja de claves de ssh para esto. La autorización de acceso vía contraseña está deshabilitada por defecto.
nb: Du trenger et ssh-nøkkelpar for dette. Innlogging via passord er deaktivert som standard.
pl: Potrzebujesz do tego klucza ssh. Logowanie przez hasło jest domyślnie wyłączone.

source: Create your public key
ca: Creeu la vostra clau pública
de: Öffentlichen Schlüssel erzeugen
es: Cree su clave pública
nb: Opprett din offentlige nøkkel
pl: Stwórz swój klucz publiczny

source: If not already created, create your public key, default choices should be fine for LAN, you can leave empty password if you don't want to deal with it each time::
ca: Si ja no l'heu creada, creeu la vostra clau pública, les opcions predeterminades són adequades per a la xarxa d'àrea local, podeu deixar la contrasenya buida si no voleu haver d'entrar-la cada cop::
de: Falls noch nicht geschehen, erzeugt man den öffentlichen Schlüssel. Die Standardeinstellungen sollte für ein LAN ausreichen. Das Passwort kann leer gelassen werden, wenn man es nicht jedes Mal eintippen will::
es: Si no la ha creado ya, cree su clave pública, las opciones por defecto deberían ser suficientes para una red de área local, puede dejar en blanco el campo de contraseña si no quiere tener que introducirla en cada ocasión::
nb: Hvis ikke allerede opprettet, oppretter du den offentlige nøkkelen, standardvalg skal være bra nok for LAN, du kan benytte tomt passord hvis du ikke vil håndtere det hver gang:
pl: Jeśli tego jeszcze nie zrobiłeś stwórz swój klucz publiczny, domyślny wybór powinien być dla LAN'u, możesz też zostawić puste hasło, jeśli nie chcesz się z tym męczyć za każdym razem::

source: Copy the public key to your device
ca: Copieu la clau pública al vostre dispositiu
de: Öffentlichen Schlüssel auf das Gerät kopieren
es: Copie la clave pública a su dispositivo
nb: Kopier den offentlige nøkkelen til din enhet
pl: Skopiuj klucz publiczny na swoje urządzenie

source: You need then to transfer your public key to your device. There are multiple ways to do this. For example:
ca: Us cal transferir a continuació la vostra clau pública al dispositiu. Hi ha múltiples maneres de fer això. Per exemple:
de: Der öffentliche Schlüssel muss auf das Gerät transferiert werden. Hierfür gibt es verschiedene Möglichkeiten. Zum Beispiel:
es: Necesita después transferir su clave pública a su dispositivo. Existen diversas maneras de hacer esto. Por ejemplo:
pl: Potem będziesz musiał wyeksportować swój klucz na twoje urządzenie. Są dwa sposoby, aby to zrobić. Na przykład:

source: Connect the ubports device and the PC with a USB cable. Then copy the file using your filemanager.
ca: Connecteu el dispositiu ubports i el PC amb un cable USB. A continuació copieu el fitxer usant el vostre gestor de fitxers.
de: Das Gerät per USB-Kabel mit dem Rechner verbinden. Dann kopiert man die Datei über die Dateiverwaltung.
es: Conecte el dispositivo con ubports y el PC con un cable USB. Después copie el archivo usando su administrador de archivos.
nb: Koble ubports-enheten og PC-en med en USB-kabel. Kopier deretter filen ved hjelp av filbehandleren.
pl: Połącz swoje urządzenie z PC kablem usb. Potem skopiuj plik używając twojego menedżera plików.

source: Or transfer the key via the internet by mailing it to yourself, or uploading it to your own cloud storage, or webserver, etc.
ca: O transferiu la clau via Internet enviant-vos un correu electrònic, o carregant-la al vostre emmagatzemament de núvol, o servidor web, etc.
de: Man kann auch den Schlüssel über das Internet an sich selbst senden, per Mail, Own Cloud, Webserver etc.
es: O envíe la clave vía internet mandándosela por correo electrónico a usted mismo, o subiéndola a su propio almacenamiento en la nube, o servidor web, etc.
nb: Eller overfør nøkkelen via internett ved å sende den til deg selv, eller laste den opp til din egen skylagring, eller webserver e.l.
pl: Albo przetransportuj klucz przez internet, mailując do siebie, albo wrzucając go do chmury, serwera, itp.

source: You can also connect via :doc:`adb <adb>` and use the following command to copy it::
ca: Podeu connectar també via :doc:`adb <adb>` i usar l'ordre següent per copiar-la::
de: Man kann sich auch per :doc:`adb <adb>` verbinden folgendes Kommando zum Kopieren nutzen::
es: También puede conectar vía :doc:`adb <adb>` y usar la siguiente orden para copiarla::
nb: Du kan også koble til via: doc: `adb <adb>` og bruke følgende kommando for å kopiere den ::
pl: Możesz również połączyć sie przez :doc: `adb <adb` i użyć komendy poniżej aby go skopiować::

source: Configure your device
ca: Configureu el vostre dispositiu
de: Das Gerät konfigurieren
es: Configure su dispositivo
nb: Konfigurer din enhet
pl: Skonfiguruj twoje urządzenie

source: Now you have the public key on the UBports device. Let's assume it's stored as ``/home/phablet/id_rsa.pub``. Use the terminal app or and adb connection to perform the following steps on your phone. ::
ca: Ara teniu la vostra clau pública al dispositiu UBports. Suposem que està desada com ``/home/phablet/id_rsa.pub``. Useu l'aplicació de terminal o la connexió adb per realitzar els passos següents al vostre telefon.::
de: Angenommen, der öffentliche Schlüssel wurde unter ``/home/phablet/id_rsa.pub`` abgelegt, können folgende Schritte in der Terminal App oder per adb-Verbindung auf dem Gerät ausgeführt werden::
es: Ahora ya tiene la clave pública en el dispositivo con UBports. Supongamos que está almacenada como ``/home/phablet/id_rsa.pub``. Use la aplicación de terminal o una conexión adb para realizar los siguientes pasos en su teléfono. ::
nb: Nå har du den offentlige nøkkelen på UBports-enheten. La oss anta at den er lagret som `` / home / phablet / id_rsa.pub ''. Bruk terminalappen og eller ADB-tilkoblingen for å utføre følgende trinn på telefonen. ::
pl: Teraz masz już klucz na urządzeniu z Ubuntu Touch. Załóżmy, że jest przechowywany jako ``/home/phablet/id_rsa.pub``. Użyj aplikacji terminala albo połączenia adb, aby wykonać następujące kroki na swoim telefonie. ::

source: Now start the ssh server. If you are using an Android-based phone::
de: Jetzt starten Sie den ssh Server, wenn Sie ein Android-basiertes Telefon verwenden::
nb: Start nå ssh-serveren. Hvis du bruker en Android-basert telefon:
pl: Teraz rozpocznij serwer ssh. Jeśli używasz telefonu bazującego na Androidzie::

source: If you are using a Linux-based phone (like the Pinephone)::
de: Wenn Sie ein Linux-basiertes Telefon nutzen (wie das Pinephone)::
nb: Hvis du bruker en Linux-basert telefon (som Pinephone):
pl: Jeśli używasz telefonu bazującego na Linuxie (jak Pinephone)::

source: Connect
ca: Connecteu
de: Verbinden
es: Conectar
nb: Koble til
pl: Połączenie się

source: Now everything is set up and you can use ``ssh`` ::
ca: Ara tot està configurat i podeu usar ``ssh`` ::
de: Jetzt ist alles eingestellt und und ``ssh`` kann genutzt werden::
es: Ahora ya está configurado todo y puede usar ``ssh`` ::
nb: Nå er alt satt opp, og du kan bruke `` ssh '' ::
pl: Teraz wszystko jest już ustawione i możesz korzystać z ``ssh``::

source: Of course you can now also use ``scp`` or ``sshfs`` to transfer files.
ca: Per suposat que podeu usar també ``scp`` o ``sshfs``per transferir fitxers.
de: Natürlich kann man auch ``scp`` oder ``sshfs`` zur Dateiübertragung nutzen.
es: Por supuesto ahora también puede usar ``scp`` o ``sshfs`` para transferir archivos.
nb: Selvfølgelig kan du nå også bruke `` scp '' eller `` sshfs '' for å overføre filer.
pl: Teraz możesz również używać ``scp`` lub ``sshfs`` do przesyłania plików.

source: Switch release channels
ca: Commutació dels canals d'alliberament
de: Kanal wechseln
es: Cambiar canales de publicación
nb: Bytt utgivelseskanaler
pl: Przełącz kanał aktualizacji

source: You can change the release channel using the system settings. The 3 existing channels are stable, rc (release candidate) and devel (nightly builds). For more info, see :doc:`the release schedule </about/process/release-schedule>`.
de: Sie können den Freigabekanal über die Systemeinstellungen ändern. Die 3 existierenden Kanäle sind stabil, rc (release candidate) und devel (nightly builds). Für mehr informationen, :doc:`the release schedule </about/process/release-schedule>`.
nb: Du kan endre utgivelseskanal ved bruk av systeminnstillingene. De tre eksisterende kanalene er stabil, rc (utgivelseskandidat) og devel (nattlige bygg). Mer info er å finne i :doc:`utgivelsesplanen </about/process/release-schedule>`.
pl: Możesz zmienić kanał aktualizacji używając ustawień systemowych. 3 istniejące kanały to stabilny, rc (release candidate) i devel (codzienne kompilacje). Po więcej informacji zobacz :doc: `harmonogram aktualizacji </about/process/release-schedule>`.

source: Android apps
pl: Aplikacje androidowe

source: `Anbox <https://anbox.io>`_ is a minimal Android container and compatibility layer that allows you to run Android apps on GNU/Linux operating systems such as UBports.
de: `Anbox <https://anbox.io>``_ ist ein minimaler Android-Container und eine Kompatibilitätsschicht, die es Ihnen ermöglicht, Android-Anwendungen auf dem GNU/Linux-Betriebssystemen auszuführen.
nb: `Anbox <https://anbox.io>` _ er et minimalt Android-container- og kompatibilitetslag som lar deg kjøre Android-apper på GNU / Linux-operativsystemer som UBports.
pl: `Anbox <https://anbox.io>`_ to minimalny kontener z Androidem i warstwa kompatybilności, która umożliwia ci uruchamianie aplikacji Androidowych na systemach GNU/Linuxowych jak UBports.
