Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: When "host" is used in this document, it refers to another device which you can connect your Ubuntu Touch device to. Your host device must have ``adb`` and ``fastboot`` installed.
de: Wenn in diesem Dokument "host" verwendet wird, bezieht es sich auf ein anderes Gerät, mit dem Sie Ihr Ubuntu Touch-Gerät verbinden können. Auf Ihrem Host-Gerät muss ``adb``` und ``fastboot`` installiert sein.
nb: Når "vert" brukes i dette dokumentet, refererer det til en annen enhet som du kan koble Ubuntu Touch-enheten din til. Vertsenheten din må ha ``adb`` og ``fastboot`` installert.
pl: Kiedy wymienony jest "host" odnosi się to do innego urządzenia (PC), do którego możesz podpiąć urządzenie z Ubuntu Touch. Twój host musi mieć zainstalowane ``adb`` i ``fastboot``.

source: You will need to execute commands on your Ubuntu Touch device to install Anbox and APKs. You can do that by using the terminal application, but it is easier to use ``adb shell`` or :doc:`set up ssh </userguide/advanceduse/ssh>` to access your phone from your host.
de: Um Anbox und APKs zu installieren, müssen Sie Befehle auf Ihrem Ubuntu Touch Gerät ausführen. Sie können das erreichen, indem Sie die Terminal Applikation nutzen, aber es ist einfacher über ``adb shell`` oder :doc:`ssh </userguide/advanceduse/ssh>` von Ihrem Host-System auf ihr Smartphone zuzugreifen.
nb: Du må utføre kommandoer på Ubuntu Touch-enheten din for å installere Anbox og APK-er. Du kan gjøre det ved å bruke terminalapplikasjonen, men det er lettere å bruke `` adb shell '' eller: doc: `set up ssh </ userguide / advanceduse / ssh>` for å få tilgang til telefonen din fra verten.
pl: Będziesz musiał wykonać komendy na twoim urządzeniu Ubuntu Touch aby zainstalować APK'i. Możesz to zrobić używając aplikacji terminala, ale łatwiejsze w użyciu jest ``adb shell` albo :doc: `ustawienie ssh </userguide/advanceduse/ssh>`, aby uzyskać dostęp do telefonu na swoim host'cie.

source: Supported devices
ca: Dispositius suportats
de: Unterstützte Geräte
nb: Støttede enheter
pl: Wspierane urządzenia

source: Make sure your device is supported:
ca: Assegureu-vos que el vostre dispositiu té suport:
de: Sicherstellen, dass das Gerät unterstützt wird:
nb: Forsikre deg om at enheten din støttes:
pl: Upewnij się, że twoje urządzenie jest wspierane:

source: Meizu Pro 5 (codename: ``turbo``, name of the boot partition: ``bootimg``)
de: Meizu Pro 5 (Codename: ``turbo``, Name der Bootpartition: ``bootimg``)
nb: Meizu Pro 5 (kodenavn: ``turbo``, navn på oppstartspartisjonen: ``bootimg``)
pl: Meizu Pro 5 (nazwa kodowa: ``turbo``, nazwa partycji boot: ``bootimg``)

source: Fairphone 2 (codename: ``FP2``, name of the boot partition: ``boot``)
de: Fairphone 2 (Codename: ``FP2```, Name der Bootpartition: ```boot```)
nb: Fairphone 2 (kodenavn: ``FP2``, navn på oppstartspartisjon: ``boot``)
pl: Fairphone 2 (nazwa kodowa: ``FP2``, nazwa partycji boot: ``boot``)

source: OnePlus One (codename: ``bacon``, name of the boot partition: ``boot``)
de: OnePlus One (Codename: ``bacon``, Name der Bootpartition: ``boot``)
nb: OnePlus One (kodenavn: ``bacon``, navn på oppstartspartisjon: ``boot``)
pl: OnePlus One (nazwa kodowa: ``bacon``, nazwa partycji boot: ``boot``)

source: Nexus 5 (codename: ``hammerhead``, name of the boot partition: ``boot``)
de: Nexus 5 (Codename: ``hammerhead``, Name der Bootpartition: ``boot``)
nb: Nexus 5 (kodenavn: ``hammerhead``, navn på oppstartspartisjon: ``boot``)
pl: Nexus 5 (nazwa kodowa: ``hammerhead``, nazwa partycji boot: ``boot``)

source: BQ M10 HD (codename: ``cooler``, name of the boot partition: ``boot``)
de: BQ M10 HD (Codename: ``cooler``, Name der Bootpartition: ``boot```)
nb: BQ M10 HD (kodenavn: ``cooler``, navn på oppstartspartisjon: ``boot``)
pl: BQ M10 HD (nazwa kodowa: ``cooler``, nazwa partycji boot: ``boot``)

source: BQ M10 FHD (codename: ``frieza``, name of the boot partition: ``boot``)
de: BQ M10 FHD (Codename: ``frieza``, Name der Bootpartition: ``boot``)
nb: BQ M10 FHD (kodenavn: ``frieza``, navn på oppstartspartisjon: ``boot``)
pl: BQ M10 FHD (nazwa kodowa: ``frieza``, nazwa partycji boot: ``boot``)

source: You will need the device codename and the name of your boot partition for the installation.
ca: Us caldrà el nom de codi del dispositiu i el nom de la vostra partició d'arrencada per a la instal·lació.
de: Der Codename und der Name der Boot-Partition werden für die Installation benötigt.
nb: Du trenger enhetens kodenavn og navnet på oppstartspartisjonen din for installasjonen.
pl: Będziesz potrzebował nazwy kodowej urządzenia oraz nazwe partycji boot do instalacji.

source: How to install
ca: Com instal·lar-ho
de: Installationsanleitung
nb: Hvordan installere
pl: Jak zainstalować

source: Installing Anbox is only recommended for experienced users.
de: Die installation von Anbox ist nur für erfahrene Benutzer empfohlen.
nb: Installering av Anbox anbefales bare for erfarne brukere.
pl: Instalacja Anboxa jest rekomendowana tylko dla doświadczonych użytkowników.

source: If you own a Meizu Pro 5, a BQ M10 HD or a BQ M10 FHD you need to flash a specific boot image. **You will need to re-flash that image after each Ubuntu Touch update** so when you update from OTA-10 to OTA-11 for example. Not doing so can put your phone into an unstable state. Only update your Ubuntu Touch device when you have a computer with you to re-flash that boot image.
de: Wenn Sie ein Meizu Pro 5, ein BQ M10 HD oder ein BQ M10 FHD benutzen, müssen Sie ein spezifisches Boot-Image aufspielen. **Sie müssen dieses Boot-Image nach jedem Ubuntu-Update neu aufspielen** wenn Sie also Beispielsweise von OTA-10 auf OTA-11 updaten. Wenn Sie dies nicht machen, kann dies ihr Telefon in einen Instabilen Zustand versetzen. Updaten Sie ihr Ubuntu Touch Gerät nur, wenn Sie einen Computer haben um das Boot-Image neu aufzuspielen.
pl: Jeśli posiadasz Meizu Pro 5, BQ M10 HD lub BQ M10 FHD będziesz potrzebował specjalny obraz boot. **Będziesz musiał zflashować ten obraz po każdej aktualizacji Ubuntu Touch**,np kiedy zakualizowałeś system z OTA-10 do OTA-11. Nie zrobienie tego może doprowadzić twojrz urządzenie do niestabilnego stanu. Wykonuj akualizacje Ubuntu Touch, tylko gdy masz komputer, na którym jesteś w stanie zflashować obraz boot.

source: Make sure your supported device runs on 16.04 (Anbox doesn't work on 15.04).
de: Stellen Sie sicher, dass Ihr Gerät mit 16.04 läuft (Anbox funktioniert nicht mit 15.04)
nb: Forsikre deg om at den støttede enheten kjører 16.04 (Anbox fungerer ikke 15.04).
pl: Upewnij się, że twoje wspierane urządzenie działa na 16.04 (Anbox nie działa na 15.04).

source: Be sure to have a `backup <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ of the device.
de: Stellen Sie sicher, dass Sie ein `backup <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ auf ihrem Gerät haben.
nb: Sørg for å ha en `sikkerhetskopi <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ av enheten.
pl: Upewnij się, że posiadasz `kopie zapasową <https://askubuntu.com/questions/602850/how-do-i-backup-my-ubuntu-phone>`_ urządzenia.

source: Open a terminal on your host and set some device specific variables by running ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, but replace the part between the quotes respectively with the codename and name of the boot partition for your device. See the above list.
de: Öffnen Sie ein Terminal auf Ihrem Host und setzen Sie einige gerätespezifische Variablen, indem Sie ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"`` ausführen, aber ersetzen Sie den Teil zwischen den Anführungszeichen jeweils durch den Codenamen und Namen der Bootpartition für Ihr Gerät. Siehe die obige Liste.
nb: Åpne en terminal på verten din og sett noen enhetsspesifikke variabler ved å kjøre `` export CODENAME = "turbo" && export PARTITIONNAME = "bootimg" ``, men erstatt delen mellom anførselstegnene henholdsvis med kodenavnet og navnet på oppstartspartisjonen for din enhet. Se listen over.
pl: Otwórz terminal na twoim komputerze i ustaw specyficzne zmienne urządzenia wpisując ``export CODENAME="turbo" && export PARTITIONNAME="bootimg"``, zamień część w cudzysłowie zgodnie z nawą kodową i nazwą partycji boot twojego urządzenia. Zobacz liste powyżej.

source: Activate developer mode on your device.
ca: Activeu el mode de desenvolupament al vostre dispositiu.
de: Entwicklermodus auf dem Gerät aktivieren.
nb: Aktiver utviklermodus på enheten din.
pl: Aktywuj tryb programisty na twoim urządzeniu.

source: Connect the device to your host and run the following commands from your host (same terminal you ran the ``export`` command in)::
de: Verbinden Sie das Gerät mit Ihrem Host und führen Sie die folgenden Befehle von Ihrem Host aus (dasselbe Terminal, in dem Sie den Befehl ``export`` ausgeführt haben)::
nb: Koble enheten til verten din og kjør følgende kommandoer fra verten din (samme terminal du kjørte kommandoen `` eksport '' i) ::
pl: Podłącz urządzenie do twojego hosta i wpisz podane komendy na twoim host'cie ( w tym samym terminalu, w którym wykonałeś komende ``export``)::

source: Wait for the device to reboot, then run this from your host::
de: Warten Sie, bis das Gerät neu gestartet wurde, und führen Sie dann folgendes von Ihrem Host aus::
nb: Vent til enheten starter på nytt, og kjør dette fra verten din ::
pl: Poczekaj, aż urządzenie uruchomi się ponownie, wtedy wykonaj to z poziomu komputera::

source: Done! You might have to refresh the apps scope (pull down from the center of the screen and release) for the new Android apps to show up.
de: Erledigt! Möglicherweise müssen Sie den Anwendungsbereich der Apps aktualisieren (ziehen Sie ihn aus der Mitte des Bildschirms heraus und geben Sie ihn frei), damit die neuen Android-Apps angezeigt werden.
nb: Ferdig! Du må kanskje oppdatere appens omfang (trekk ned fra midten av skjermen og slipp) for at de nye Android-appene skal vises.
pl: Gotowe! Teraz możesz odświerzyć stos aplikacji (pociągnij ze srodka ekranu i puść) aby pojawiły się nowe aplikacje Androidowe.

source: You now have an adb server running inside your phone. This guide asks you to run some ``adb`` commands, sometime on your computer, sometime on your phone. Carefully check on which device you are!
de: Jetzt haben Sie einen ADB-Server auf Ihrem Telefon laufen. Dieser Assistent wird Sie manchmal fragen, ob Sie den ``adb`` Befehl auf Ihrem Computer oder Ihren Telefon ausführen möchten. Achten Sie vorsichtig darauf, auf welchem Gerät Sie gerade sind!
nb: Du har nå en ADB-server som kjører på telefonen. Denne guiden ber deg om å kjøre noen `` adb '' - kommandoer, en gang på datamaskinen din, en gang på telefonen. Sjekk nøye hvilken enhet du er!
pl: Teraz masz serwer adb działający wewnątrz twojego telefonu. Ten poradnik poprosi się, abyś wpisał/a kilka komend ``adb``, czasem na komputerze, czasem na telefonie. Ostrożnie sprawdź, w którym urządzeniu teraz jesteś!

source: You can check that adb server is correctly running locally on your phone by opening the terminal app and enter ``adb devices``. You should see something like::
de: Sie können lokal auf Ihrem Telefon testen ob der ADB Server Korrekt läuft, indem Sie die terminal-App öffnen und ``adb devices`` eingeben. Sie sollten etwas ähnliches sehen wie::
nb: Du kan kontrollere at adb-serveren kjører riktig lokalt på telefonen din ved å åpne terminalappen og skrive inn `` adb-enheter ''. Du bør se noe sånt som ::
pl: Możesz sprawdzić czy serwer adb działa poprawnie wewnątrz twojego telefonu, po przez otworzenie aplikacji terminala i wpisanie ``adb devices``. Powinieneś/nnaś zobaczyć coś takiego::

source: How to install new APKs
de: Wie neue APKs zu installieren sind
nb: Hvordan installere nye APK'er
pl: Jak zainstalować nowe APKi

source: Copy the APK to ``/home/phablet/Downloads``, then run the following from your host::
de: Kopieren Sie die APK nach ``/home/phablet/Downloads`` und führen Sie dann folgendes von Ihrem Host aus::
nb: Kopier APK til `` / home / phablet / Downloads '', og kjør følgende fra verten din:
pl: Skopiuj APK do ``/home/phablet/Downloads``, potem wykonaj następującą komende z twojego hosta::

source: Keep your apps up to date
de: Halten Sie Ihre Apps auf dem neuesten Stand
nb: Hold appene dine oppdatert
pl: Aktualizuj twoje aplikacje

source: To keep your apps up to date you can use of F-Droid or ApkTrack. If you want to install any of the above apps you can find them here:
nb: For å holde appene dine oppdatert kan du bruke F-Droid eller ApkTrack. Hvis du vil installere noen av appene ovenfor, kan du finne dem her:
pl: Aby zaktualizować twoje aplikacje moższ używać F-Droida lub ApkTrack. Jeśli chcesz zainstalować jedną z powyższych aplikacji możesz znaleźć ją tutaj:

source: How to uninstall apps
de: So deinstallieren Sie Apps
nb: Hvordan avinstallere app'er
pl: Jak odinstalować aplikacje

source: To uninstall apps, run ``adb uninstall [APP_ID]`` from your Ubuntu Touch device::
de: Um Apps zu deinstallieren, führen Sie ```adb uninstall [APP_ID]`` von Ihrem Ubuntu Touch-Gerät aus::
nb: For å avinstallere app'er, kjør `` adb avinstaller [APP_ID] '' fra Ubuntu Touch-enheten din ::
pl: Aby odinstalować aplikacje, wpisz ``adb uninstall [APP_ID]`` na urządzeniu z Ubuntu Touch::

source: Access Android storage
de: Zugriff auf Android Speicher
nb: Få tilgang til Android-lagring
pl: Dostęp do pamięci Androida

source: Android storage is located at ``/home/phablet/anbox-data/data/media/0``.
de: Der Android Speicher befindet sich unter ``/home/phablet/anbox-data/data/media/0``.
nb: Android-lagring er plassert i `` / home / phablet / anbox-data / data / media / 0 ''.
pl: Pamięć Androida jest zlokalizowana w ``/home/phablet/anbox-data/data/media/0``.

source: Links to android libraries can be made in their respective XDG counterparts::
de: Links zu Android Bibliotheken können in ihren entsprechenden XDG Pendants erzeugt werden::
nb: Koblinger til android-biblioteker kan gjøres i deres respektive XDG-kolleger:
pl: Linki do androidowych bibliotek mogą być stworzone w swoich odpowiednikach XDG::

source: Troubleshooting
de: Problembehandlung
nb: Feilsøking
pl: Rozwiązywanie problemów

source: If installing ``anbox-ubuntu-touch`` or ``android-tools-adb`` on the device fails with an error about unsufficient space, try this::
de: Wenn die Installation von ``anbox-ubuntu-touch`` oder ``android-tools-adb`` auf dem Gerät mit einem Fehler über zu wenig Platz fehlschlägt, versuchen Sie Folgendes::
nb: Hvis installering av `` anbox-ubuntu-touch '' eller `` android-tools-adb '' på enheten mislykkes med en feil om utilstrekkelig plass, kan du prøve dette:
pl: Jeśli instalacja ``anbox-ubuntu-touch` lub ``android-tools-adb`` na urządzeniu zatrzymała się z błędem o niewystarczającej ilości miejsca, spróbuj tego::

source: When you want to install an apk but get the error ``Invalid APK file`` that error could also mean "file not found"
de: Wenn Sie eine APK installieren wollen, aber den Fehler ``Ungültige APK-Datei`` erhalten, könnte dieser Fehler auch bedeuten, dass die Datei nicht gefunden wurde
nb: Når du vil installere en APK, men får feilen `` Ugyldig APK-fil '', kan feilen også bety "filen ble ikke funnet"
pl: Kiedy chcesz zainstalować aplikacje, ale wyskakuje ci błąd ``Invalid APK file``, który może oznaczać że "plik nie został odnaleziony"

source: Check that you typed the file name correctly
de: Überprüfen Sie, ob Sie den Dateinamen korrekt eingegeben haben
nb: Kontroller at du har tastet inn filnavnet riktig
pl: Sprawdź czy poprawnie napisałeś/aś nazwę pliku

source: If the APK does not reside in the current folder where you execute adb, you have to specify the full path, e.g. ``/home/phablet/Downloads/my-app.apk`` instead of just ``my-app.apk``
de: Wenn sich die APK nicht im aktuellen Ordner befindet, in dem Sie ADB ausführen, müssen Sie den vollständigen Pfad angeben, z. B. ``/home/phablet/Downloads/my-app.apk`` anstelle von nur ``my-app.apk``
nb: Hvis APK ikke ligger i den gjeldende mappen der du kjører adb, må du spesifisere hele banen, f.eks. `` / home / phablet / Downloads / my-app.apk '' i stedet for bare `` my-app.apk ''
pl: Jeśli APK nie znajduje się w obecnym folderze, gdzie wykonałeś/aś adb, musisz podać pełną ścieżkę, np. ``/home/phablet/Downloads/my-app.apk`` zamiast tylko ``my-app.apk``

source: Reporting bugs
ca: Informació d'errors
de: Fehler melden
nb: Rapportering av feil
pl: Zgłaszanie błędów

source: Please :doc:`report any bugs </contribute/bugreporting>` you come across. Bugs with Ubuntu Touch 16.04 are reported in `the normal Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch/issues>`_ and issues with Anbox are reported on `our downstream fork <https://github.com/ubports/anbox/issues>`_. Thank you!
de: Bitte :doc:`Berichten Sie alle Fehler </contribute/bugreporting>`, auf die Sie stoßen. Fehler mit Ubuntu Touch 16.04 werden in `dem normalen Ubuntu Touch Tracker <https://github.com/ubports/ubuntu-touch/issues>`_ und Probleme mit Anbox werden in `unser Downstream-Fork <https://github.com/ubports/anbox/issues>`_ gemeldet. Vielen Dank!
nb: Vennligst: doc: `rapportere eventuelle feil </contribute/bugreporting>` du kommer over. Feil med Ubuntu Touch 16.04 er rapportert i `den normale Ubuntu Touch tracker <https://github.com/ubports/ubuntu-touch/issues>` _ og problemer med Anbox rapporteres på `vår nedstrøms fork <https://github.com/ubports/anbox/issues> `_. Takk skal du ha!
pl: Prosimy o :doc: `zgłaszanie błędów </contribute/bugreporting`, na które się natrafisz. Błędy związane z Ubuntu 16.04 są zgłaszane w `ogólnym trackerze Ubuntu Touch <https://github.com/ubports/ubuntu-touch/issues>`_ i problemy związane z Anboxem są zgłaszane w `naszym oddolnym forku <https://github.com/ubports/anbox/issues>`_. Dziękujemy!

source: Daily use
ca: Ús diari
de: Tägliche Nutzung
es: Uso diario
nb: Daglig bruk
pl: Codzienne użytkowanie

source: This section of the documentation details common tasks that users may want to perform while using their Ubuntu Touch device.
ca: Aquesta secció de la documentació explica tasques comunes que els usuaris podrien desitjar fer quan usen el seu dispositiu Ubuntu Touch.
de: Dieser Abschnitt der Dokumentation gibt Aufschluss darüber, wie man ein Ubuntu Touch-Gerät üblicherweise nutzt.
es: Esta sección de la documentación detalla las tareas comunes que los usuarios pueden querer realizar mientras usan su dispositivo con Ubuntu Touch.
nb: Denne delen av dokumentasjonen beskriver vanlige oppgaver som brukere kanskje vil utføre mens de bruker Ubuntu Touch-enheten.
pl: Ta sekcja dokumentacji przybliża częste czynności, jakie użytkownicy mogą chcieć robić na swoim urządzeniu z Ubuntu Touch.

source: Run desktop applications
ca: Execució d'aplicacions d'escriptori
de: Desktop-Anwendungen nutzen
es: Ejecutar aplicaciones de escritorio
nb: Kjør skrivebordsprogrammer
pl: Uruchamiaj aplikacje desktopowe

source: Libertine allows you to use standard desktop applications in Ubuntu Touch.
ca: El Libertine us permet usar aplicacions estàndard d'escriptori a l'Ubuntu Touch.
de: Libertine ermöglicht die Nutzung von Standard-Desktop-Anwendungen in Ubuntu Touch.
es: Libertine le permite usar aplicaciones estándar de escritorio en Ubuntu Touch.
nb: Libertine lar deg bruke standard skrivebords-applikasjoner i Ubuntu Touch.
pl: Libertine pozwala ci używać normalnych aplikacji desktopowych na Ubuntu Touch.

source: To install applications you may use the phone's *Settings* interface or you may use the command line as described further below.
de: Um Applikationen zu installieren, können Sie das *Systemeinstellungen* Menü des Smartphones oder, wie nachfolgend beschrieben, die Kommandozeile nutzen.
nb: For å installere applikasjoner kan du bruke telefonens * Innstillinger * -grensesnitt, eller du kan bruke kommandolinjen som beskrevet lenger nedenfor.
pl: Aby zainstalować aplikacje możesz używać interfejsu *Ustawień* albo możesz używać wiersza poleceń jak opisano poniżej.

source: Manage containers
ca: Gestió de contenidors
de: Container verwalten
es: Gestione los contenedores (containers)
pl: Zarządzaj kontenerami

source: Create a container
ca: Creació d'un contenidor
de: Einen Container anlegen
es: Cree un contenedor (container)
pl: Stwórz kontener

source: The first step is to create a container where applications can be installed:
ca: El primer pas per crear un contenidor on es poden instal·lar aplicacions:
de: Der erste Schritt besteht darin, einen Container zu erstellen, in dem Anwendungen installiert werden können::
es: El primer paso es crear un contenedor donde puedan instalarse las aplicaciones:
pl: Pierwszymi krokiem jest stworzenie kontenera, gdzie aplikacje mogą być zainstalowane:

source: Open Settings and scroll down to *Libertine* under the *System* sub-heading.
de: Öffnen Sie die *Systemeinstellungen* und scrollen Sie herunter zu *Libertine* unter der *System* Unter-Überschrift.
pl: Otwórz Ustawienia i scroll'uj na doł do *Libertine* w podgrupie *System*.

source: Tap *Libertine* to get to the *Manage Libertine Containers* sub-menu. If you have other containers already installed, they will be visible here. Tap the + sign at the upper right to add a container.
de: Tippen Sie auf *Libertine*, um zum Untermenü *Manage Libertine Containers* zu gelangen. Wenn Sie bereits andere Container installiert haben, werden diese hier angezeigt. Tippen Sie auf das + Zeichen oben rechts, um einen Container hinzuzufügen.
pl: Kliknij *Libertine*, aby dostać się do sub-menu *Manage Libertine Containers*. Jeśli masz zainstalowany już jakiś kontener będzie on tu widoczny. Kliknij znak + w prawym górnym rogu, aby dodać kontener.

source: The *Container Options* dialog box will open asking you to enter a container name and password if desired. Confirm your entries by tapping OK, and the container will be created.
de: Die *Container Options* Dialogbox wird angezeigt und die Eingabe eines Namens und Passwortes ermöglicht, wenn dies gewünscht ist. Akzeptieren Sie Ihre Eingaben, indem Sie auf OK tippen. Im Anschluss wird der Container erzeugt.
pl: Pojawi się okno *Container Options*, aby zapytać cie o nazwe i hasło kontenera. Potwierdź swoje wybory klikając OK, utworzy to kontener.

source: To do this via command line follow these steps::
de: Um das über die Kommandozeile zu erledigen, folgen Sie den folgenden Schritten::
nb: Følg disse trinnene for å gjøre dette via kommandolinjen:
pl: Aby to zrobić poprzez wiersz poleceń postępuj wg tych kroków::

source: You can add extra options such as:
ca: Podeu afegir opcions addicionals com ara:
de: Zusätzliche Optionen können hinzugefügt werden:
es: Puede añadir opciones extra tales como:
nb: Du kan legge til ekstra alternativer som:
pl: Możesz dodać dodatkowe opcje jak::

source: ``-n name`` name is a more user friendly name of the container
ca: ``-n name`` name (nom) és un nom del contenidor més amigable per l'usuari
de: ``-n name`` als Name kann etwas nutzerfreundliches festgelegt werden
es: ``-n name`` name es un nombre del contenedor mas fácil de usar
pl: ``-n nazwa`` nazwa to bardziej wygodna dla użytkownika nazwa kontenera
