Repository: ubports/docs.ubports.com
Catalog: locales/*/LC_MESSAGES/userguide.po
Languages: ca, de, es, nb, pl

source: Shell access via adb
ca: Accés a la consola via adb
de: Shell-Zugriff über adb
es: Acceso al terminal vía adb
nb: Skall-tilgang via ADB
pl: Dostęp do powłoki poprzez adb

source: You can put your UBports device into developer mode and access a Bash shell from your PC. This is useful for debugging or more advanced shell usage.
ca: Podeu posar el vostre dispositiu UBports en mode desenvoluament i accedir una consola Bash des del vostre ordinador. Això és útil per depuracions o per a un ús més avançat de la consola.
de: Du kannst Dein UBports-Gerät in den Entwicklermodus versetzen und vom Desktop-PC auf eine Bash-Shell zugreifen.
es: Puede poner su dispositivo con UBports en modo de desarrollador y acceder a una terminal con Bash desde su PC. Esto es útil para depurar o para un uso mas avanzado de la terminal.
nb: Du kan sette UBports-enheten din i utviklermodus og få tilgang til et Bash-terminalvindu fra PC-en. Dette er nyttig for feilsøking eller mer avansert terminalbruk.
pl: Możesz postawić swoje urządzenie w trybie programisty i uzyskać dostęp do powłoki Bash na twoim komputerze. To jest przydatne podczas debuggowania i bardziej zaawansowanych zastosowań.

source: Install ADB
ca: Instal·lació de l'ADB
de: ADB-Installation
es: Instalar ADB
nb: Installer ADB
pl: Instalacja ADB

source: First, you'll need ADB installed on your computer.
ca: En primer lloc, us caldrà instal·lar l'ADB al vostre ordinador.
de: Zuerst muss ADB auf dem PC installiert werden.
es: Primero necesitará tener instalado ADB en su ordenador.
nb: Først trenger du ADB installert på datamaskinen din.
pl: Pierwsze co musisz zrobić to zainstalować ADB na twoim komputerze.

source: On Ubuntu::
ca: A l'Ubuntu::
de: Unter Ubuntu::
es: En Ubuntu::
nb: I Ubuntu::
pl: Na Ubuntu::

source: On Fedora::
ca: Al Fedora::
de: Unter Fedora::
es: En Fedora::
nb: I Fedora::
pl: Na Fedorze::

source: And on MacOS with `Homebrew <https://brew.sh>`_::
ca: I al MacOS amb `Homebrew <https://brew.sh>`_::
de: Und unter MacOS mit `Homebrew <https://brew.sh>`_::
es: Y en MacOS con `Homebrew <https://brew.sh>`_::
nb: Og på MacOS med `Homebrew <https://brew.sh>`_::
pl: I na MacOS poprzez `Homebrew <https://brew.sh>`_::

source: For Windows, grab the command-line tools only package from `developer.android.com <https://developer.android.com/studio/index.html#downloads>`_.
de: Für Windows `hier <https://developer.android.com/studio/index.html#downloads>`_ nur die command-line-tools herunterladen.
nb: For Windows henter du kun kommandolinjeverktøyene fra `developer.android.com <https://developer.android.com/studio/index.html#downloads>`_.
pl: Dla Windowsa, pobierz konsolowe narzędzia z `developer.android.com <https://developer.android.com/studio/index.html#downloads>`_.

source: Enable developer mode
ca: Habiliteu el mode de desenvolupador
de: Aktiviere den Entwicklermodus
es: Habilite el modo de desarrollador
nb: Aktiver utviklermodus
pl: Włącz tryb programisty

source: Next, you'll need to turn on Developer Mode.
ca: A continuació, haureu d'activar el mode de desenvolupador.
de: Als Nächstes ist es nötig, den Entwicklermodus zu aktivieren.
es: Siguiente, necesitará activar el modo de desarrollador.
nb: Deretter må du slå på utviklermodus.
pl: Następnie włącz Tryb Programisty.

source: Reboot your device
ca: Reinicieu el vostre dispositiu
de: Gerät neustarten
es: Reinicie su dispositivo
nb: Utfør omstart av din enhet
pl: Uruchom ponownie urządzenie

source: Place your device into developer mode (Settings - About - Developer Mode - check the box to turn it on)
ca: Poseu el vostre dispositiu en mode de desenvolupador (Configuració del sistema - Quant a - Mode de desenvolupador - marqueu la casella per activar-lo)
de: Gerät in den Entwicklermodus versetzen (Systemeinstellungen - Über - Entwicklermodus - Auswahlfeld aktivieren)
es: Ponga su dispositivo en modo de desarrollador (Configuración - Acerca de - Modo de desarrollador - marcar el recuadro para activarlo)
nb: Sett din enhet i utviklermodus (Innstillinger - Om - Utviklermodus - merk av i boksen for å slå den på)
pl: Umieść swoje urządzenie w trybie programisty (Ustawienia - Informacje - Tryb programisty - kliknij przycisk, aby go włączyć)

source: Plug the device into a computer with adb installed
ca: Endolleu el dispositiu a un ordinador amb l'adb instal·lat
de: Das Gerät mit einem PC verbinden, auf dem adb installiert ist
es: Conecte el dispositivo a un ordenador con adb instalado
nb: Koble enheten til en datamaskin med ADB installert
pl: Podłącz urządzenie do komputera z zainstalowanym adb

source: Open a terminal and run ``adb devices``.
ca: Obriu una terminal i executeu ``adb devices``.
de: Konsole öffnen und ``adb devices`` ausführen.
es: Abra una terminal y ejecute ``adb devices``.
nb: Åpne et terminalvindu og kjør ``adb devices``.
pl: Otwórz terminal i wykonaj komende ``adb devices``.

source: When you're done using the shell, it's a good idea to turn Developer Mode off again.
ca: Quan hagueu acabat d'usar la consola, és una bona idea desactivar un altre cop el mode de desenvolupament.
de: Wenn die Shell nicht mehr verwendet wird, sollte der Entwicklermodus wieder deaktiviert werden.
es: Cuando acabe de usar el terminal, es una buena idea apagar el modo de desarrollador de nuevo.
nb: Når du er ferdig med å bruke terminalvinduet, er det en god idé å slå av utviklermodus igjen.
pl: Kiedy skończysz korzystać z powłoki dobrym pomysłem jest ponowne wyłączenie Trybu Programisty.

source: If there's a device in the list here (The command doesn't print "List of devices attached" and a blank line), you are able to use ADB successfully. If not, continue to the next section.
ca: Si hi ha un dispositiu a la llist aquí (l'ordre no imprimeix «Llista de dispositiu adjunts» i una línia en blanc), podeu usar l'ADB correctament. Si no n'hi ha, continueu a la secció següent.
de: Wenn sich ein Gerät in der Liste befindet (der Befehl gibt nicht "List of devices attached" und eine leere Zeile aus), kann ADB genutzt werden. Wenn nicht, folge den Anweisungen im nächsten Abschnitt.
es: Si hay un dispositivo en la lista aquí (la orden no imprime "Lista de dispositivos adjuntos" y una línea en blanco), ya está dispuesto para usar ADB con éxito. Si no, continúe a la sección siguiente.
nb: Hvis det er en enhet i listen her (Kommandoen skriver ikke ut "Liste over tilkoblede enheter" og en tom linje), kan du bruke ADB med hell. Hvis ikke, fortsett til neste avsnitt.
pl: Jeśli urządzenie jest na liście (Komenda nie wypisuje "List of devices attached" i pustą linie) to znaczy, że zainstalowałeś ADB pomyślnie. Jeśli nie to przejdź do następnej sekcji.

source: Adb shell commands::
de: Adb Shell Komandos::
nb: ADB-terminalvindukommandoer:
pl: Komendy powłoki adb::

source: Additional Adb commands::
de: Zusätzliche Adb Kommandos::
nb: Flere ADB kommandoer:
pl: Dodatkowe komendy adb::

source: For more ADB commands refer to the `official documentation <https://developer.android.com/studio/command-line/adb>`_.
de: Weitere ADB Befehle finden Sie in der `offiziellen Dokumentation <https://developer.android.com/studio/command-line/adb>`_.
nb: For flere ADB kommandoer, henvis til `official documentation <https://developer.android.com/studio/command-line/adb>`_.
pl: Po więcej komend ADB zobacz`oficjalną dokumentacje <https://developer.android.com/studio/command-line/adb>`_.

source: Add hardware IDs
ca: Addició d'identificadors de maquinari
de: Hinzufügen von Hardware-IDs
es: Añada identificadores (IDs) del hardware
nb: Legg til maskinvare ID'er
pl: Dodaj ID sprzętu

source: ADB doesn't always know what devices on your computer it should or should not talk to. You can manually add the devices that it does not know how to talk to.
ca: L'ADB no sempre sap a quins dispositius del vostre ordinador els hauria o no els hauria de parlar. Podeu afegir manualment els dispositiu amb els quals no sap com parlar.
de: ADB erkennt nicht immer die Geräte am PC, die angesprochen werden sollen. Du kannst Geräte, die nicht erkannt werden konnten, manuell hinzufügen.
es: ADB no siempre sabe con que dispositivos conectados a su ordenador debe o no comunicarse. Puede añadir manualmente los dispositivos con los que no sepa como comunicarse.
nb: ADB vet ikke alltid hvilke enheter på datamaskinen din det skal eller ikke bør snakke med. Du kan legge til enhetene manuelt som den ikke vet hvordan den skal kommunisere med.
pl: ADB nie zawsze wie, z którymi urządzeniami powinno rozmawiać, z którymi nie. Możesz ręcznie dodać urządzenia, z którymi nie wie jak rozmawiać.

source: Just run the command for your selected device if it's below. Then, run ``adb kill-server`` followed by the command you were initially trying to run.
ca: Simplement executeu l'ordre per al vostre dispositiu seleccionat si hi és a sota. A continuació, executeu ``adb kill-server`` seguit de l'ordre que intentàveu executar inicialment.
de: Einfach den Befehl für das ausgewählte Gerät ausführen, falls es in der folgenden Liste aufgeführt ist. Nach dem Befehl ``adb kill-server`` kann dann der ursprünglich gewünschte Befehl ausgeführt werden.
es: Simplemente ejecute la orden para su dispositivo seleccionado si está debajo. Entonces ejecute ``adb kill-server`` seguido de la orden que inicialmente estaba intentando ejecutar.
nb: Bare kjør kommandoen for den valgte enheten din hvis den er nedenfor. Deretter, kjør ``adb kill-server`` etterfulgt av kommandoen du opprinnelig forsøkte å kjøre.
pl: Wykonaj tą komende dla twojego urządzenia, jeśli wyświetla się poniżej. Potem wykonaj ``adb kill-server``, po czym komende, którą początkowo chciałeś wykonać.

source: CalDAV and CardDAV synchronization
ca: Sincronització del CalDAV i del CardDAV
de: CalDAV- und CardDAV-Synchronisation
nb: CalDAV og CardDAV synkronisering
pl: synchronizacja CalDAV i CardDAV

source: CalDAV and CardDAV are protocols to synchronize calendars and contacts with a remote server. Many email-hosters provide a CalDAV and CardDAV interface.
de: CalDAV und CardDAV sind Protokolle zur Synchronisierung von Kalendern und Kontakten mit einem externen Server. Viele E-Mail-Anbieter stellen eine CalDAV- und CardDAV-Schnittstelle zur Verfügung.
nb: CalDAV og CardDAV er protokoller for å synkronisere kalendere og kontakter med en ekstern server. Mange e-post tilbydere tilbyr et CalDAV- og CardDAV-grensesnitt.
pl: CalDAV and CardDAV to protokoły synchronizujące kalendarze i kontakty z serwerem zdalnym. Spora część hostów emaili udostępnia interfejs CalDAV i CardDAV.

source: **Note:** CalDAV Sync can also be set up in using the calendar app. Open the app, click on the little calendar icon in the top right corner and select "Add internet calendar > Generic CalDAV". Enter your calendar URL as well as your username and password to complete the process.
ca: **Nota:** La sincronització CalDAV també es pot establir usant l'aplicació de calendari. Obriu l'aplicació, cliqueu sobre la icona petita de calendari al racó superior dret i trieu «Afegeix un calendari d'Internet > CalDAV genèric». Entreu l'URL del vostre calendari així com el vostre nom d'usuari i la contrasenya per completar el procés.
de: **Hinweis:** CalDAV-Synchronisierung kann auch in der Kalender-App eingestellt werden. Man öffnet die App, klickt auf das kleine Kalendersymbol in der rechten oberen Ecke und wählt "Internetkalender hinzufügen > Generic CalDAV". Um den Vorgang abzuschließen, gibt man die Kalender-Internetadresse ein, ebenso wie den Nutzernamen und das Passwort.
nb: ** Merk: ** CalDAV Sync kan også settes opp ved bruk av kalender-appen. Åpne appen, klikk på det lille kalenderikonet øverst til høyre og velg "Legg til internettkalender> Generisk CalDAV". Skriv inn URL-adressen til kalenderen, samt brukernavnet og passordet ditt for å fullføre prosessen.
pl: **Uwaga** Synchronizacja CalDAV może być także ustawiona za pomocą aplikacji kalendarza. Otwórz aplikacje, kliknij na małą ikone kalendarza w prawym górnym rogu i zaznacz "Dodaj kalendarze Online >Generic CalDAV". Wprowadź URL twojego kalendarza, jak i twoją nazwę użytkownika i hasło, aby zakończyć proces.

source: At the moment, there is no carddav implementation directly accessible from the Ubuntu Touch graphical user-interface, so the only way to sync carddav is by using syncevolution + cron. However, there is a simple way to do that with a script that you can run in the terminal or via phablet SSH connection. These instructions work for caldav as well.
de: Im Moment gibt es keine carddav-Implementierung, welche über die grafische Oberfläche von Ubuntu Touch erreichbar wäre. Die einzige Möglichkeit, per carddav zu synchronisieren, ist durch die Nutzung von syncevolution + cron. Hierfür gibt es einen einfachen Weg über ein Skript, das im Terminal oder über eine phablet-SSH-Verbindung ausgeführt werden kann. Diese Instruktionen funktionieren auch für caldav.
nb: For øyeblikket er det ingen carddav-implementering direkte tilgjengelig fra det grafiske brukergrensesnittet i Ubuntu Touch, så den eneste måten å synkronisere carddav er ved å bruke syncevolution + cron. Det er imidlertid en enkel måte å gjøre det med et skript som du kan kjøre i terminalen eller via phablet SSH-tilkobling. Disse instruksjonene fungerer også for caldav.
pl: Na ten moment nie ma żadnej bezpośredniej graficznej implementacji carddav dla Ubuntu Touch, więc jednym sposobem aby synchronizować carddav jest używanie syncevolution + cron. Jednakże, dobrym pomysłem jest zrobić skrypt, który będzie uruchamiany w terminalu albo przez SSH. Podane instrukcje działają również dla caldav.

source: Follow this `guide <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>`_ to activate Developer Mode and ADB (or SSH) connection.
ca: Seguiu aquest `guia <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>`_ per activar el mode de desenvolupament i la connexió ADB (o SSH).
de: Diese `Anleitung <https://docs.ubports.com/en/latest/userguide/advanceduse/adb.html>`_ erklärt die Aktivierung des Entwicklermodus und von ADB-Verbindungen (oder SSH).
pl: Postępuj zgodnie z tym `poradnikiem <https://docs.ubports.com/pl/latest/userguide/advanceduse/adb.html>`_, aby aktytować Tryb Programisty oraz połączenie ADB (lub SSH).

source: Download this `script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (let's call it dav.sh) and edit the following variables:
ca: Descarregueu l'`script <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (anomenem-lo dav.sh)i editeu les variables següents:
de: Man lädt dieses `Skript <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (nennen wir es dav.sh) herunter und bearbeitet die folgenden Variablen:
nb: Last ned dette `skriptet <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (la oss kalle det dav.sh) og redigere følgende variabler:
pl: Pobierz ten `skrypt <https://gist.github.com/bastos77/0c47a94dd0bf3e394f879c0ff42b7839>`_ (nazwij go dav.sh) i zedytuj następujące zmienne:

source: server side : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (of your ownCloud/nextCloud/baikal/SOGO/... server)
ca: costat del servidor: CAL_URL, **CONTACTS_URL**, USUARI, CLAU (del vostre servidor ownCloud/nextCloud/baikal/SOGO/... )
de: Server : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (im ownCloud/nextCloud/baikal/SOGO/... Server)
nb: tjenersiden : CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (for din ownCloud/nextCloud/baikal/SOGO/... -tjenerr)
pl: po stronie serwera: CAL_URL, **CONTACTS_URL**, USERNAME, PASSWORD (twojego serwera ownCloud/nextCloud/baikal/SOGO/...)

source: CONTACT and CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (it's more cosmetic)
ca: CONTACT i CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (és més cosmètic)
de: CONTACT und CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (eher kosmetisch)
nb: KONTAKT- og KALENDERNAVN / SYNLIG_NAVN / OPPSETTSNAVN (det er mer estetisk)
pl: CONTACT i CALENDAR _ NAME / VISUAL_NAME / CONFIG_NAME (to bardziej kosmetyczne)

source: CRON_FREQUENCY (for the frequency of synchronization)
de: CRON_FREQUENCY (Frequenz mit der die Synchronisation erfolgt)
nb: CRON_FREQUENCY (for synkroniseringsfrekvensen)
pl: CRON_FREQUENCY (częstotliwość synchronizacji)

source: Line 61: write ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , instead of ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, to avoid permission denied error
ca: Línia 61: escriviu ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"``, en comptes de ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, per evitar l'error de falta de permís
de: Zeile 61: Man ersetzt ``sudo echo "$COMMAND_LINE" > /sbin/sogosync`` durch ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"``, um einen Zugriffsfehler zu vermeiden
nb: Linje 61: skriv ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , istedet for ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``,
pl: Linia 61: zapisz ``sudo sh -c "echo '$COMMAND_LINE' > /sbin/sogosync"`` , zamiast ``sudo echo "$COMMAND_LINE" > /sbin/sogosync``, aby uniknąć błędu o braku uprawnień

source: Move the file to your Ubuntu Touch device, either by file manager or with adb::
de: Verschieben Sie die Datei auf Ihr Ubuntu Touch-Gerät, entweder über den Dateimanager oder mit ADB::
nb: Flytt filen til din Ubuntu Touch-enhet, enten via filbehandleren eller med adb ::
pl: Przenieś plik na twoje urządzenie z Ubuntu Touch, używając albo menedżera plików albo adb::

source: Connect with the phablet shell (``adb shell``) or directly on the phone Terminal app and type the following::
ca: Connecteu-vos amb la consola de la phablet (``adb shell``) o directament am l'aplicació de terminal del telèfon, i entreu el següent::
de: Man stellt die Verbindung mit der phablet shell her (``adb shell``) oder öffnet direkt das Terminal auf dem Telefon und gibt folgendes ein::
nb: Koble til med phablet-skallet (``adb shell``) eller direkte i enhetsterminalen og skriv følgende::
pl: Połącz sie z powłoką phbaleta (``adb shell``) albo wpisz następującą komende w aplikacji terminala na twoim telefonie::

source: Sources:
ca: Fonts:
de: Quellen:
nb: Kilder:
pl: Źródła:

source: Advanced use
ca: Ús avançat
de: Erweiterte Verwendung
es: Uso avanzado
nb: Avansert bruk
pl: Zaawansowane użytkowanie

source: This section of the documentation details advanced tasks that power users may want to perform on their Ubuntu Touch device.
ca: Aquesta secció de la documentació detalla tasques avançades que el usuaris avançats poden desitjar realitzar als seus dispositius Ubuntu Touch.
de: In diesem Abschnitt der Dokumentation werden erweiterte Arbeitsschritte beschrieben, die erfahrene Benutzer auf ihrem Ubuntu Touch-Gerät durchführen können.
es: Esta sección de la documentación detalla tareas avanzadas que los usuarios avanzados pueden querer realizar en sus dispositivos con Ubuntu Touch.
nb: Denne delen av dokumentasjonen beskriver avanserte oppgaver som kraftbrukere kanskje vil utføre på deres Ubuntu Touch-enhet.
pl: Ta sekcja dokumentacji przybliża zaawansowane zadania, które power userzy mogą chcieć robić na swoich urządzeniach z Ubuntu Touch.

source: Some of these guides involve making your system image writable, which may break OTA updates. The guides may also reduce the overall security of your Ubuntu Touch device. Please consider these ramifications before hacking on your device too much!
ca: Algunes d'aquestes guies impliquen fer escrivible a la vostra imatge de sistema, cosa que pot trencar les actualitzacions OTA. Les guies poden també reduir la seguretat general del vostre dispositiu Ubuntu Touch. Si us plau considereu aquestes implicacions abans de trastejar massa amb el vostre dispositiu!
de: In einigen dieser Anleitungen wird das System-Image beschreibbar gemacht, was OTA-Aktualisierungen stören kann. Die Anleitungen können mitunter auch die allgemeine Sicherheit Ihres Ubuntu Touch-Geräts verringern. Diese möglichen Auswirkungen sollten vor dem Ausführen der entsprechenden Befehle berücksichtigt werden!
es: Algunas de estas guías implican hacer su imagen de sistema escribible, lo cual puede romper las actualizaciones OTA. Las guías también pueden reducir la seguridad en general de su dispositivo Ubuntu Touch. ¡Considere estas repercusiones antes de trastear demasiado su dispositivo!
nb: Noen av disse guidene innebærer å gjøre systemavbildning din overskrivbar, noe som kan ødelegge OTA-oppdateringer. Guidene kan også redusere den generelle sikkerheten til Ubuntu Touch-enheten. Vennligst vurder disse konsekvensene før du hacker på enheten din for mye!
pl: Niektóre z tym poradników wymagając obrazu systemu zdolnego do zapisu, co może uszkodzić aktualizacje OTA. Poradniki mogą także zmniejszać bezpieczeństwo twojego urządzenia z Ubuntu Touch. Weź pod uwage te konsekwencej przed zbytnim hackowaniem na twoim urządzeniu!

source: Reverse tethering
ca: Punt d'accés invers a la xarxa
de: Umgekehrtes Tethering
es: Anclaje a red inverso
nb: Omvendt tjudring
pl: Wsteczny tethering

source: Some users may not have an available wifi connection for their phone nor a data subscription from their mobile provider. This short tutorial will help you to connect your Ubuntu Touch to your computer to access internet.
ca: És possible que alguns usuari no tinguin una connexió wifi disponible per al seu telèfon ni un contracte de dades del seu proveïdor telefònic. Aquest tutorial breu us ajudarà a connectar el vostre Ubuntu Touch al vostre ordinador per accedir Internet.
de: Einige Nutzer verfügen eventuell weder über eine WLAN-Verbindung für ihr Smartphone noch über Datenvolumen ihres Mobilfunkproviders. Diese kurze Anleitung unterstützt Sie dabei Ihr Ubuntu Touch-Gerät über Ihren Computer mit dem Internet zu verbinden.
es: Algunos usuarios pueden no tener una conexión inalámbrica para su teléfono ni un plan de datos de su proveedor móvil. Este breve tutorial le ayudará a conectar su Ubuntu Touch a su ordenador para poder acceder a Internet.
nb: Enkelte brukere har kanskje ikke en tilgjengelig wifi-tilkobling for telefonen eller et dataabonnement fra mobilleverandøren. Denne korte opplæringen vil hjelpe deg med å koble Ubuntu Touch til datamaskinen din for å få tilgang til internett.
pl: Niektórzy użytkownicy mogą nie mieć dostępnego połączenia wifi na ich telefonach, ani dostępnych danych komórkowych. Ten krótki poradnik pomoże ci połączyć twój telefon z Ubuntu Touch do komputera, tak aby uzyskać dostęp do internetu.

source: Prerequisite: Phone is connected to the computer with usb and developer mode enabled.
ca: Prerequisit: El telèfon està connectar a l'ordinador amb l'usb i el mode desenvolupador està activat.
de: Grundvoraussetzung: das Smartphone ist mittels USB-Kabel mit dem Computer verbunden und der Entwicklermodus ist in den Einstellungen des Smartphones aktiviert.
es: Prerrequisito: el teléfono está conectado al ordenador mediante usb y el modo de desarrollador está activado.
nb: Forutsetning: Telefonen er koblet til datamaskinen med usb og utviklermodus aktivert.
pl: Wstępny warunek: Telefon jest połączony do komputera kablem usb i try programisty jest włączony.

source: Steps
ca: Passos
de: Schritte
es: Pasos
nb: Steg
pl: Etapy

source: On phone: ``android-gadget-service enable rndis``
ca: Al telèfon: ``android-gadget-service enable rndis``
de: Am Mobilgerät: ``android-gadget-service enable rndis``
es: En el teléfono: ``android-gadget-service enable rndis``
nb: På telefonen: ``android-gadget-service enable rndis``
pl: Na telefonie: ``android-gadget-service enable rndis``
